[
    {
        "title": "Announcement under Regulation 30 (LODR)-Press Release / Media Release 1 Jun - Tata Motors May 2025 sales: 70,187 units, down 9% YoY; PV sales down 11%, CV sales down 5%.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=63a0b8ca-a986-450e-ab90-5db4dd0ecb6f.pdf",
        "date": "1 Jun - Tata Motors May 2025 sales: 70,187 units, down 9% YoY; PV sales down 11%, CV sales down 5%."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Analyst / Investor Meet - Intimation 28 May - Scheduled analyst and institutional investor meetings on June 2, 2025, by Tata Motors.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=0ed6981f-0342-4d3f-b157-158e649fd863.pdf",
        "date": "28 May - Scheduled analyst and institutional investor meetings on June 2, 2025, by Tata Motors."
    },
    {
        "title": "Intimation Under Regulation 30 Regarding Letter Dispatched To The Shareholders Of The Company 24 May - Tata Motors dispatched letters for FY25 Annual Report access and AGM details; includes dividend and e-voting dates.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=ca97833e-dba2-4788-9ca3-e95b31b597f9.pdf",
        "date": "24 May - Tata Motors dispatched letters for FY25 Annual Report access and AGM details; includes dividend and e-voting dates."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Newspaper Publication 24 May - Copies of newspaper advertisement pertaining to the 80th AGM of the Company.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=10c27029-2c14-46d8-b3c1-44bb98794d8e.pdf",
        "date": "24 May - Copies of newspaper advertisement pertaining to the 80th AGM of the Company."
    },
    {
        "title": "Business Responsibility and Sustainability Reporting (BRSR) 24 May - Tata Motors files FY24-25 Business Responsibility and Sustainability Report as per SEBI regulations.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=0ab929be-ff32-4b19-a799-5b63bd464c41.pdf",
        "date": "24 May - Tata Motors files FY24-25 Business Responsibility and Sustainability Report as per SEBI regulations."
    }
]