{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "13-05-2025",
                "Bharti Airtel Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/05/2025 inter alia to consider and approve Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4) and year ended on March 31 2025. Financial Results for the Fourth Quarter (Q4) and Year ended March 31, 2025 and recommendation of final dividend for FY 2024-25 (As Per BSE Announcement Dated on 13.05.2025)"
            ],
            [
                "06-02-2025",
                "Quarterly Results"
            ],
            [
                "06-02-2025",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/02/2025 inter alia to consider and approve The Audited Financial Results (Standalone & Consolidated) For The Third Quarter (Q3) And Nine Months Ended On December 31 2024. FInancial results for the quarter (Q3) and nine months ended December 31, 2024 (As per BSE Announcement Dated on 06/02/2025) Integared Filing (Financial) for the third quarter (Q3) and nine months ended December 31, 2024. (As Per BSE Announcement dated on 10.02.2025)"
            ],
            [
                "28-10-2024",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2024 inter alia to consider and approve the Audited Financial Results (Standalone & Consolidated) for the second quarter (Q2) and six months ended on September 30 2024. Conclusion of Board Meeting dated October 28, 2024 Outcome of the Board meeting - Financial results Change in Board of Directors (As per BSE Announcement dated on: 28/10/2024)"
            ],
            [
                "05-08-2024",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/08/2024 inter alia to consider and approve the Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30 2024 Board Meeting Outcome for Financial Results for the first quarter (Q1) ended June 30, 2024 Financial Results for the first quarter (Q1) ended June 30, 2024 Update on Board meeting dt. August 05, 2024 Appointment of Rohit Krishan Puri as Joint Company Secretary of the Company w.e.f. August 06, 2024. Upon his said appointment, Rohit Krishan Puri has been designated as ''Joint Company Secreyary & Compliance Officer'' and a Key Managerial Personnel of the Company. (As per BSE Announcement Dated on 05/08/2024)"
            ],
            [
                "14-05-2024",
                "Quarterly Results"
            ],
            [
                "14-05-2024",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/05/2024 inter alia to consider and approve the Audited Financial Results (Standalone & Consolidated) for the fourth quarter and year ended on March 31 2024. Recommendation of Final Dividend for FY 2023-24 Financial results for the fourth quarter (Q4) and year ended March 31, 2024 and Recommendation of Dividend Quarterly Report for the fourth quarter (Q4) ended March 31, 2024 Financial results for the quarter and year ended March 31, 2023 Recommendation of Final Dividend for FY 2023-24 (As Per BSE Announcement dated on 14.05.2024)"
            ],
            [
                "19-01-2024",
                "We are enclosing herewith an announcement made by Bharti Hexacom Limited, a subsidiary of the Company."
            ],
            [
                "05-02-2024",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/02/2024 inter alia to consider and approve Audited Financial Results (Standalone & Consolidated) for the third quarter (Q3) ended on December 31 2023. Conclusion of Board meeting dated February 05, 2024 In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the third quarter (Q3) and nine months ended December 31, 2023: - Audited consolidated financial results as per Ind AS - Audited standalone financial results as per Ind AS - Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Monday, February 05, 2024 and based on its recommendation, approved by the Board of Directors at its meeting held on Monday, February 05, 2024. The Board meeting commenced at IST 1400 Hrs and is still in progress. (As per BSE Announcement Dated on 05/02/2024)"
            ],
            [
                "31-10-2023",
                "Quarterly Results"
            ],
            [
                "31-10-2023",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/10/2023 inter alia to consider and approve the Audited Financial Results (Standalone & Consolidated) for the second quarter (Q2) ended on September 30 2023. For the above purpose and as per the Companys Code of Conduct for prohibition of Insider Trading the Trading Window for dealing in the securities of the Company has been closed from Sunday October 01 2023 to Thursday November 02 2023 (both days inclusive). Conclusion of Board meeting dated October 31, 2023 In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the second quarter (Q2) and six months ended September 30, 2023: - Audited consolidated financial results as per Ind AS - Audited standalone financial results as per Ind AS - Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, October 31, 2023 and based on its recommendation, approved by the Board of Directors at its meeting held Tuesday, October 31, 2023. The Board meeting commenced at IST 0800 Hrs and is still in progress. Financial Results for the second quarter (Q2) and six months ended September 30, 2023 (As per BSE Announcement Dated on 31/10/2023)"
            ],
            [
                "03-08-2023",
                "Quarterly Results"
            ],
            [
                "03-08-2023",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/08/2023 inter alia to consider and approve Pursuant to Regulation 29 of SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 notice is hereby given that the meeting of the Board of Directors of the Company will be held on Thursday August 03 2023 to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30 2023. For the above purpose and as per the Companys Code of Conduct for prohibition of Insider Trading the Trading Window for dealing in the securities of the Company has been closed from Saturday July 01 2023 till Saturday August 05 2023 (both days inclusive). Financial results for the first quarter ended on June 30, 2023 Conclusion of Board meeting dated August 03, 2023 In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the first quarter (Q1) ended June 30, 2023: (i) Audited consolidated financial results as per Ind AS (ii) Audited standalone financial results as per Ind AS (iii) Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Thursday, August 03, 2023 and based on its recommendation, approved by the Board of Directors at its meeting held Thursday, August 03, 2023. The Board meeting commenced at IST 1400 Hrs and is still in progress. (As per BSE Announcement Dated on 03/08/2023)"
            ],
            [
                "16-05-2023",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 16/05/2023 inter alia to consider and approve Pursuant to Regulation 29 of SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 notice is hereby given that the meeting of the Board of Directors of the Company will be held on Tuesday May 16 2023 to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4) and year ended on March 31 2023. For the above purpose and as per the Companys Code of Conduct for prohibition of Insider Trading the Trading Window for dealing in the securities of the Company has been closed from April 01 2023 (Saturday) to May 18 2023 (Thursday) (both days inclusive). BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 16/05/2023 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(e) of the SEBI (Listing Obligation and Disclosure Requirements) Regulations, 2015 and further to our intimation dt. May 02, 2023, we wish to inform you that the Board of directors of the Company shall inter-alia consider the recommendation/ declaration of dividend, if any, for the financial year 2022-23, in its meeting scheduled to be held on Tuesday, May 16, 2023. (As Per BSE Announcement dated on 11.05.2023) Board has considered and recommended a final dividend of Rs. 4/- per fully paid-up equity share of face value Rs. 5/- each and Re. 1/- per partly paid-up equity share of face value Rs. 5/- each (paid-up Rs. 1.25 per share) for the financial year 2022-23. The dividend is in proportion to the amount paid-up on each equity share of face value Rs. 5/- each (As Per BSE Bulletin Dated on 16.05.2023) In terms of Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (''SEBI Listing Regulations''), we wish to inform you that on the recommendation of HR & Nomination Committee, the Board of Directors of the Company, at its meeting held on May 16, 2023, has approved the re-appointment of Ms. Kimsuka Narasimhan as an Independent Director for a further term of five (5) years i.e. from March 30, 2024 to March 29, 2029, subject to the approval of members. The details, as required to be disclosed under aforesaid Regulation 30 read with SEBI Circular dated September 9, 2015, are enclosed as ''Annexure A''. Further to our intimation dated May 16, 2023 under Regulations 30, 33 and 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the fourth quarter (Q4) and year ended March 31, 2023 approved by Board of Directors in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1815 Hrs. (As Per BSE Announcement dated on 16.05.2023)"
            ],
            [
                "07-02-2023",
                "Quarterly Results"
            ],
            [
                "07-02-2023",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2023 inter alia to consider and approve Audited Financial Results (Standalone & Consolidated) for the third quarter (Q3) ended on December 31 2022. For the above purpose and as per the Companys Code of Conduct for prohibition of Insider Trading the Trading Window for dealing in the securities of the Company has been closed from January 01 2023 (Sunday) to February 09 2023 (Thursday) (both days inclusive). In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the third quarter (Q3) ended December 31, 2022: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, February 07, 2023 and based on its recommendation, approved by the Board of Directors at its meeting held Tuesday, February 07, 2023. The Board meeting commenced at IST 1400 Hrs and is still in progress. Pursuant to Regulation 30 and other applicable provisions of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the quarterly report for the third quarter (Q3) ended December 31, 2022 being released by the Company. Further to our intimation dated February 07, 2023 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the third quarter (Q3) ended December 31, 2022 approved by Board of Directors in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1800 Hrs. (As Per BSE Announcement Dated on 07.02.2023)"
            ],
            [
                "31-10-2022",
                "Quarterly Results"
            ],
            [
                "31-10-2022",
                "Quarterly Results Outcome of the Board meeting dated October 31, 2022 Quarterly report for the second quarter (Q2) ended September 30, 2022 Financial results for the second quarter (Q2) and six months ended September 30, 2022 Further to our intimation dated October 31, 2022 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the second quarter (Q2) and six months ended September 30, 2022 approved by Board of Directors in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1730 Hrs. (As Per BSE Announcement Dated on 31.10.2022)"
            ],
            [
                "08-08-2022",
                "Quarterly Results"
            ],
            [
                "08-08-2022",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/08/2022 inter alia to consider and approve Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30 2022 In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the first quarter (Q1) ended June 30, 2022: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Monday, August 08, 2022 and based on its recommendation, approved by the Board of Directors at its meeting held on Monday, August 08, 2022. The Board meeting commenced at IST 1400 Hrs and is still in progress. Kindly take the same on record. Financial results for the first quarter (Q1) ended June 30, 2022 Further to our intimation dated August 08, 2022 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the first quarter (Q1) ended June 30, 2022 approved by Board of Directors in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1820 Hrs. Kindly take the same on record. (As Per BSE Announcement Dated on 08/08/2022)"
            ],
            [
                "17-05-2022",
                "Quarterly Results"
            ],
            [
                "17-05-2022",
                "Audited Results BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/05/2022 ,inter alia, to consider and approve Pursuant to Regulation 29 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of the Board of Directors of the Company will be held on Tuesday, May 17, 2022 to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4) and year ended on March 31, 2022. For the above purpose and as per the Company's Code of Conduct for prohibition of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from April 01, 2022 (Friday) to May 19, 2022 (Thursday) (both days inclusive). Kindly take the above information on record. BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/05/2022 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(e) of the SEBI (Listing Obligation and Disclosure Requirements) Regulations, 2015 and in furtherance to our intimation dt. May 05, 2022, we wish to inform you that the Board of directors of the Company shall inter-alia consider the recommendation/ declaration of dividend, if any, for the financial year 2021-22 in its meeting scheduled to be held on Tuesday, May 17, 2022. Kindly take the above information on record. (As per BSE Announcement Dated on 12/5/2022) has considered and recommended a dividend of Rs. 3/- per fully paid-up equity share of face value Rs. 5/- each and Rs. 0.75/- per partly paid-up equity share of face value Rs. 5/- each (paid-up Rs. 1.25 per share) for the financial year 2021-22. The dividend is in proportion to the amount paid-up on each equity share of face value Rs. 5/- each. Financial results for the fourth quarter (Q4) and year ended March 31, 2022 and Recommendation of Dividend Further to our intimation dated May 17, 2022 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the fourth quarter (Q4) and year ended March 31, 2022 approved by Board in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1725 Hrs. Change in the Board of Directors of Bharti Airtel Limited We wish to inform you that based on the recommendations of Audit Committee and subject to the approval of shareholders in the forthcoming Annual General Meeting ('AGM'), the Board of Directors, in its meeting held on Tuesday, May 17, 2022, has re-appointed Deloitte Haskins & Sells LLP (Firm's registration no. 117366W/W-100018), Chartered Accountants as Statutory Auditors of the Company for a further period of five (5) years to hold office from the conclusion of this AGM till the conclusion of the 32nd AGM to be held in calendar year 2027. We wish to inform you that based on the recommendations of HR & Nomination Committee and subject to the approval of shareholders, the Board of Directors, in its meeting held on Tuesday, May 17, 2022, has approved the re-appointment of Gopal Vittal (DIN: 02291778), Managing Director designated as 'Managing Director & CEO' for a further period of five (5) years i.e. from February 01, 2023 to January 31, 2028. Gopal Vittal is not debarred from holding the office of director by virtue of any order of SEBI or any other such authority. (As Per BSE Announcement Dated on 17.05.2022)"
            ],
            [
                "08-02-2022",
                "Quarterly Results"
            ],
            [
                "08-02-2022",
                "Quarterly Results Inter alia, to consider routine financing/ re-financing strategies and any resultant enablements for fundraising through debt instruments including debentures, bonds, loans etc. either denominated in Indian rupees or in foreign currency and of suitable tenor and characteristics, subject to applicable regulatory/ statutory approval(s) as applicable. In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the third quarter (Q3) ended December 31, 2021: a) Audited consolidated financial results as per Ind AS b) Audited standalone financial results as per Ind AS c) Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, February 08, 2022 and based on its recommendation, approved by the Board of Directors at its meeting held on Tuesday, February 08, 2022. The Board meeting commenced at IST 1400 Hrs. and is still in progress. Kindly take the same on record. Outcome of the Board meeting dt. February 08, 2022 Further to our intimation dated February 08, 2022 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the third quarter (Q3) ended December 31, 2021 approved by Board in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1730 Hrs. Kindly take the same on record. (As per BSE Announcement Dated on 08/02/2022)"
            ],
            [
                "28-01-2022",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/01/2022 inter alia to consider and approve the proposal for issuance of equity shares through preferential issue (other than to Promoter / Promoter Group) subject to all such regulatory/ statutory approvals as may be required including the approval of shareholders of the Company. Further to the intimation dated January 24, 2022, we wish to inform you that the Board of Directors ('Board') of the Company, at its meeting held today i.e. January 28, 2022, approved the issuance of upto 71,176,839 equity shares of face value of Rs. 5/- each of the Company to Google International LLC on a preferential basis in accordance with Chapter V of the SEBI (Issue of Capital and Disclosure Requirements) Regulations, 2018 ('ICDR Regulations'), as amended and other applicable laws, at a price of Rs. 734/- per equity share aggregating to Rs. 52,243.80 million, subject to the approval of regulatory/ statutory authorities and the shareholders of the Company at the Extraordinary General Meeting. The Board has also authorised the Special Committee of Directors to take actions on all incidental matters related to the aforesaid Issue. The Press Release being issued by the Company in this regard is enclosed. (As Per BSE Announcement Dated on 28/01/2022)"
            ],
            [
                "04-01-2022",
                "Further to our intimations dated April 14, 2021 and in terms of Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (Listing Regulations), we enclose following in reference to the meeting of Board of Directors of the Company held today i.e. Tuesday, January 04, 2022: a) Statement being issued by the Company w.r.t. update on the scheme of arrangement for new corporate structure. (Annexure A) b) Details as required to be disclosed under Regulation 30 of the Listing Regulations read with SEBI Circular dated September 9, 2015. (Annexure B) Kindly take the above information on record."
            ],
            [
                "02-11-2021",
                "Quarterly Results In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the second quarter (Q2) ended September 30, 2021: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, November 02, 2021 and based on its recommendation, approved by the Board of Directors at its meeting held on Tuesday, November 02, 2021. The Board meeting commenced at IST 1400 Hrs. and is still in progress. Kindly take the same on record. Further to our intimation dated November 02 2021 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 w.r.t. the audited financial results for the second quarter (Q2) ended September 30 2021 approved by Board in its meeting held today we wish to inform you that the said Board meeting of the Company has been concluded at IST 1810 Hrs. Kindly take the same on record. Financial results for the second quarter (Q2) ended September 30, 2021 (As Per BSE Announcement Dated on 11/2/2021)"
            ],
            [
                "29-08-2021",
                "Inter alia, to consider and approve various capital raising options through equity or equity linked or debt instruments or any combination there-of, as the Board may deem appropriate. Further to our intimation dated August 25, 2021 and pursuant to Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors ('Board') of the Company, at its meeting held today, comprehensively reviewed the industry scenario, business environment, financial/ business strategy of the Company and approved the Company's plan to raise further capital. Accordingly, the Board approved the issuance of equity shares of face value of Rs. 5/- each of the Company on rights basis to eligible equity shareholders of the Company as on the record date (to be notified later), of an Issue size of upto Rs. 21,000 Crores (Rs. Twenty One Thousand Crores Only) ('Issue'). The Board approved the enclosed terms of the Issue. (As Per BSE Announcement dated on 29.08.2021) Inter alia, comprehensively reviewed the industry scenario, business environment, financial/ business strategy of the Company and approved the Company's plan to raise further capital. Accordingly, the Board approved the issuance of equity shares of face value of Rs. 5/- each of the Company on rights basis to eligible equity shareholders of the Company as on the record date (to be notified later), of an Issue size of upto Rs. 21,000 Crores (Rs. Twenty One Thousand Crores Only) (`Issue'). The Board approved the following terms of the Issue: (a) Rights Issue Price: Rs. 535/- per fully paid-up equity share (including a premium of Rs. 530/- per equity share). (b) Terms of payment of Issue Price: 25% on application and balance in two more additional calls as may be decided by the Board/ Committee of the Board from time to time based on the Company's requirements within an overall time-horizon of 36 months. (c) Rights Entitlement Ratio: 1 equity share for every 14 equity shares held by eligible shareholders as on the record date. Further the Board has constituted a 'Special Committee of Directors' to decide the other terms and conditions of the Issue including Issue period and the record date. The promoter and promoter group of the Company will collectively subscribe to the full extent of their aggregate rights entitlement. In addition, they will also subscribe to any unsubscribed shares in the Issue. (As Per BSE Bulletin Dated on 30.08.2021) Bharti Airtel Ltd has informed BSE regarding Outcome of Board Meeting held on August 29, 2021. (As Per BSE Announcement Dated on 30.08.2021)"
            ],
            [
                "03-08-2021",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/08/2021 ,inter alia, to consider and approve Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30, 2021. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from July 01, 2021 (Thursday) to August 05, 2021 (Thursday) (both days inclusive). Please take the above information on record. In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the first quarter (Q1) ended June 30, 2021: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, August 03, 2021 and based on its recommendation, approved by the Board of Directors at its meeting held on Tuesday, August 03, 2021. The Board meeting commenced at IST 1400 Hrs and is still in progress. Kindly take the same on record. Further to our intimation dated August 03, 2021 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the first quarter (Q1) ended June 30, 2021 approved by Board in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at IST 1840 Hrs. Kindly take the same on record. (As per BSE Announcement Dated on 3/8/2021)"
            ],
            [
                "17-05-2021",
                "Quarterly Results"
            ],
            [
                "17-05-2021",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/05/2021 ,inter alia, to consider and approve the Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4) and year ended on March 31, 2021. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from April 01, 2021 to May 19, 2021 (both days inclusive). Please take the above information on record. In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the fourth quarter (Q4) and year ended March 31, 2021: Audited consolidated financial results as per Ind AS Audited standalone financial results as per Ind AS Auditor's reports Declaration on Auditor's Report with unmodified opinion pursuant to the Regulation 33(3) and 52(3) of Listing Regulations read with SEBI circular no. CIR/CFD/CMD/56/2016 dated May 27, 2016. The above financial results have been reviewed by the Audit Committee in its meeting held on Monday, May 17, 2021 and based on its recommendation, approved by the Board of Directors at its meeting held on Monday, May 17, 2021. The Board meeting commenced at IST 1400 Hrs. and is still in progress. Further to our intimation dated May 17, 2021 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the fourth quarter (Q4) and year ended March 31, 2021 approved by Board of Directors in its meeting held today, we wish to inform you that the said meeting of the Board of Directors of the Company commenced at IST 1400 Hrs. and has been concluded at IST 1800 Hrs. Kindly take the same on record. We are pleased to inform you that subject to the provisions of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 and approval of shareholders in the ensuing Annual General Meeting, the Board of Directors of the Company, in its meeting held on Monday, May 17, 2021, has recommended the re-appointment of Sunil Bharti Mittal as the Chairman of the Company for a further term of five years w.e.f. October 01, 2021. The details as required to be disclosed under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 read with SEBI Circular dated September 9, 2015, are enclosed as 'Annexure A'. (As Per BSE Announcement dated on 17.05.2021)"
            ],
            [
                "14-04-2021",
                "we wish to inform you that the Board of directors of Bharti Airtel limited, in its meeting held on Wednesday, April 14, 2021, has approved the Composite scheme of arrangement between Bharti Airtel Limited, Nettle Infrastructure Investments Limited, Airtel Digital Limited, Telesonic Networks Limited and Airtel Limited and their respective shareholders and creditors under sections 230 to 232 and other applicable provisions of the Companies Act, 2013 ('Scheme'). The details as required to be disclosed under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 read with SEBI Circular dated September 9, 2015, are enclosed 'Annexure A'."
            ],
            [
                "17-02-2021",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/02/2021 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of Listing Regulations, as amended, we wish to inform you that a meeting of Board of Directors of the Company is scheduled to be held on Wednesday, February 17, 2021 to discuss the future strategic plans and reorganization of shareholding framework of subsidiary company(ies) which may result in consolidation/ acquisition of shares of subsidiary company(ies), the consideration of which may be discharged through issuance of equity shares of the Company on a preferential basis and/ or cash. Please take the above information on record. Outcome of the Board meeting dt. February 17, 2021 We wish to inform you that the Board of Directors ('Board'), in its meeting held on Wednesday, February 17, 2021, has constituted a 'Special Committee of Directors' to consider and evaluate in detail, various options (or combination thereof) for re-organisation of businesses and shareholding structure of the Company and its various subsidiaries to achieve required flexibility and sharper focus on digital and non-telecom businesses of the Company to enable any unlocking of enhanced value for its stakeholders. The Special Committee shall place its suitable recommendations to the Board for consideration and/ or approval. Kindly take the above on record. Preferential issue of upto 36,469,913 equity shares to Lion Meadow Investment Ltd., a Warburg Pincus entity, at a price of INR 600/- per equity share i.e. at 0.50% premium to the floor price determined in accordance with the ICDR Regulations. (As Per BSE Announcement dated on 17.02.2021)"
            ],
            [
                "03-02-2021",
                "Quarterly Results"
            ],
            [
                "03-02-2021",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/02/2021 ,inter alia, to consider and approve the Audited Financial Results (Standalone & Consolidated) for the third quarter (Q3) ended December 31, 2020. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from January 01, 2021 to February 05, 2021 (both days inclusive). Please take the above information on record. BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/02/2021 ,inter alia, to consider and approve Further to our intimation dated January 20, 2021 and pursuant to Regulation 29 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors, in its meeting scheduled on Wednesday, February 03, 2021, shall also consider routine financing/ re-financing strategies and any consequent raising of capital through various instruments including debentures, bonds, loans etc. either denominated in Indian rupees or in foreign currency and of suitable tenor and characteristics, subject to applicable regulatory/ statutory approval(s). Kindly take the above information on record. (As Per BSE Announcement Dated on 31/01/2021) Outcome of the Board meeting dt. February 03, 2021 Disclosure w.r.t approval of fund raising under regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the third quarter (Q3) ended December 31, 2020: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Wednesday, February 03, 2021 and based on its recommendation, approved by the Board of Directors at its meeting held on Wednesday, February 03, 2021. The Board meeting commenced at 02:00 P.M. and is still in progress. Kindly take the same on record. (AS Per BSE Announcement Dated on 03.02.2021)"
            ],
            [
                "27-10-2020",
                "Quarterly Results"
            ],
            [
                "27-10-2020",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/10/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Tuesday, October 27, 2020 to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the Second quarter (Q2) and half year ended on September 30, 2020. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from September 27, 2020 to October 29, 2020 (both days inclusive). Please take the above information on record. Pursuant to Regulation 30 of SEBI Listing Regulations, 2015 read with SEBI Circular no. CIR/CFD/CMD/4/2015 dated September 09, 2015 ('SEBI Circular') and in terms of the provisions of the SEBI (Share Based Employee Benefits) Regulations, 2014, we wish to inform you that the HR & Nomination Committee in its meeting held on Tuesday, October 27, 2020 has approved the grant of stock options. Kindly take the same on record. (As Per BSE Announcement Dated on 27.10.2020)"
            ],
            [
                "29-07-2020",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/07/2020 ,inter alia, to consider and approve the Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30,2020. For the purpose of the above and as per the Company''s Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from June 29, 2020 to July 31, 2020 (both days inclusive). Please take the above information on record. In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the first quarter (Q1) ended June 30, 2020: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Wednesday, July 29, 2020 and based on its recommendation, approved by the Board of Directors at its meeting held on Wednesday, July 29, 2020. The Board meeting commenced at 06:00 P.M. and is still in progress. Kindly take the same on record. Further to our intimation dated July 29, 2020 under Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the first quarter (Q1) ended June 30, 2020 approved by Board in its meeting held today, we wish to inform you that the said Board meeting of the Company has been concluded at 09.00 P.M. Kindly take the same on record. (AS Per BSE Announcement Dated on 29.07.2020)"
            ],
            [
                "18-05-2020",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 18/05/2020 ,inter alia, to consider and approve (a) The Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4)and year ended on March 31, 2020; and (b) The Dividend, if any, for the financial year 2019-20. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from April 01, 2020 to May 20, 2020 (both days inclusive). Further to our intimation dated May 18, 2020 and in terms of Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (''Listing Regulations''), we are pleased to inform you that subject to the approval of the shareholders in the ensuing Annual General Meeting (''AGM''), the Board of Directors (''Board'') of the Company at its meeting held today i.e. May 18, 2020 (commenced at IST 1800 Hrs. and is still in progress), has considered and recommended a final dividend of Rs. 2/- per equity share (face value of Rs. 5/- each) for the financial year 2019-20. The above dividend, if declared by the shareholders at the ensuing AGM, will be credited / dispatched within 30 days from the date of AGM. Kindly take the same on record. Further to our intimation dated May 18, 2020 under Regulations 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board meeting w.r.t. Financial Results and Dividend commenced at IST 1800 Hrs. and concluded at IST 2220 Hrs. Kindly take the same on record. (As Per BSE Announcement Dated on 18.05.2020) Further to our communication dated May 18, 2020, we are re-submitting the revised quarterly report on the financial results for the fourth quarter (Q4) and year ended March 31, 2020 due to inadvertent/ minor error in the placing of certain table headings. There is no change or error in the figures/ financial data reported. We request you to please take this on record and ignore/ withdraw from your website, our earlier submission of quarterly report. (As Per BSE Announcement Dated on 19.05.2020)"
            ],
            [
                "04-02-2020",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Tuesday, February 04, 2020, to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the third quarter (Q3) ended on December 31, 2019. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from January 01, 2020 to February 06, 2020 (both days inclusive). Please take the above information on record. In compliance with Regulations 30 and 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the following for the third quarter (Q3) ended December 31, 2019: ? Audited consolidated financial results as per Ind AS ? Audited standalone financial results as per Ind AS ? Auditor's reports The above financial results have been reviewed by the Audit Committee in its meeting held on Tuesday, February 04, 2020 and based on its recommendation, approved by the Board of Directors at its meeting held on Tuesday, February 04, 2020. The Board meeting commenced at 01:30 P.M. and is still in progress. Kindly take the same on record. Pursuant to Regulation 30 and other applicable provisions of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we are enclosing herewith the quarterly report for the third quarter (Q3) ended December 31, 2019 being released by the Company. Kindly take the same on record. In terms of Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('SEBI Listing Regulations'), we wish to inform you that on the recommendation of HR and Nomination Committee, the Board of Directors of the Company, in its meeting held on February 04, 2020, has approved the re-appointment of Mr. Shishir Priyadarshi (DIN: 03459204) as an Independent Director for a further term of five (5) years i.e. from February 04, 2020 to February 03, 2025, subject to the approval of members. The details as required to be disclosed under aforesaid Regulation 30 read with clause 7 of Para A of Annexure I of SEBI Circular dated September 9, 2015, are enclosed as 'Annexure A'. Kindly take the same on record. (As Per BSE Announcement Dated 04.02.2020)"
            ],
            [
                "14-01-2020",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/01/2020 ,inter alia, to consider and approve Further to our communication dated January 08, 2020 and in terms of Regulations 29(1) and 29(2) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, as amended, we wish to inform you that a meeting of the Special Committee of Directors for Fund Raising of the Company is proposed to be held on Tuesday, January 14, 2020 to inter alia, consider and determine: (i) the issue price of the Equity Shares (including any discount on the floor price calculated in accordance with SEBI ICDR Regulations and as approved by our shareholders pursuant to a resolution dated January 3, 2020); and (ii) the issue price and other terms of the FCCBs. Kindly take the above on record. (i) Qualified Institutions Placement of equity shares of face value of Rs. 5 each ('Equity Shares') under Chapter VI of Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2018, as amended ('SEBI ICDR Regulations') and applicable provisions of the Companies Act, 2013 and the rules framed thereunder, each as amended ('Companies Act') (the 'Issue'); and (ii) Issuance of Foreign Currency Convertible Bonds ('FCCBs'). (As Per BSE Announcement Dated on 14/01/2020)"
            ],
            [
                "04-12-2019",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/12/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(d) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Wednesday, December 04, 2019 to, inter-alia, consider and evaluate any and all proposals for raising of funds either by issuance of equity shares, and or bonds including foreign currency convertible bonds / debentures / non-convertible debt instruments alongwith warrants / convertible debentures / securities and / or any other equity based instruments / securities including through qualified institutions placement or rights issue, or through any other permissible mode or any combination thereof of any of the above, subject to all such regulatory / statutory / shareholder approvals as may be required. Outcome of the Board Meeting (As Per BSE Announcement Dated on 04.12.2019)"
            ],
            [
                "14-11-2019",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/11/2019 ,inter alia, to consider and approve the Audited Financial Results (Standalone & Consolidated) for the second quarter (Q2) and half year ended on September 30, 2019."
            ],
            [
                "29-10-2019",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/10/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Tuesday, October 29, 2019, to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the second quarter (Q2) and half year ended on September 30, 2019. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from October 01, 2019 to October 31, 2019 (both days inclusive). Please take the above information on record. Please be informed that the management of the Company recommended to the Board of Directors that the agenda item related to the approval of audited financial results for the second quarter (Q2) and half year ended September 30, 2019 which was to be a part of the Board meeting today be deferred till November 14, 2019 on account of the fact that more clarity is needed on the AGR matter arising out of recent judgement of Hon'ble Supreme Court. The Company is approaching DoT to seek clarity on the total amounts involved and request for their support to deal with this adverse outcome. The Board of Directors, in its meeting held today, has accepted the management's recommendation and deferred the agenda item relating to the approval of the said financial results till Thursday, November 14, 2019. All other agenda items shall be taken up by the Board in the meeting to be resumed today in the ordinary course. Kindly take the same on record. (As Per BSE Announcement dated on 29/10/2019)"
            ],
            [
                "01-08-2019",
                "Quarterly Results"
            ],
            [
                "06-05-2019",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/05/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Monday, May 06, 2019, to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the fourth quarter (Q4) and year ended on March 31, 2019. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from April 01, 2019 to May 08, 2019 (both days inclusive). Please take the above information on record."
            ],
            [
                "28-02-2019",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/02/2019 ,inter alia, to consider and approve In furtherance to our intimation dated January 31, 2019 and pursuant to Regulation 29(1)(d) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a meeting of the Board of Directors of the Company is scheduled on Thursday, February 28, 2019 to, inter-alia, consider (i) the recommendations of ''Special Committee of Directors for Fund Raising' and; (ii) the proposal for raising of funds by issue of equity shares, bonds/debentures or other securities including through qualified institutions placement, rights issue, preferential issue or through any other permissible mode or a combination thereof, subject to such regulatory/ statutory approvals as may be required and determination of issue price, if any. Kindly take the above on record."
            ],
            [
                "31-01-2019",
                "Quarterly Results"
            ],
            [
                "20-12-2018",
                "BHARTI AIRTEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/12/2018 ,inter alia, to consider and approve consider various fund raising options for the Company as the Board may deem appropriate."
            ],
            [
                "25-10-2018",
                "Interim Dividend"
            ],
            [
                "26-07-2018",
                "Dear Sir/Madam, Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Thursday, July 26, 2018, to consider and take on record the Audited Financial Results (Standalone & Consolidated) for the first quarter (Q1) ended on June 30, 2018. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from June 26, 2018 to July 28, 2018 (both days inclusive). Please take the above information on record. Thanking you, Sincerely Yours, For Bharti Airtel Limited Rohit Krishan Puri Dy. Company Secretary"
            ],
            [
                "24-04-2018",
                "Dividend"
            ],
            [
                "12-03-2018",
                "Pursuant to Regulation 29(1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Monday, 12th day of March 2018, to consider inter-alia, enablement from board to opportunistically raise funds including by issuance of secured / unsecured, listed / unlisted, non-convertible debentures, bonds or such other similar debt instrument(s) either denominated in indian rupees or in foreign currency. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from March 01, 2018 to March 14, 2018 (both days inclusive). Please take the above information on recorrd."
            ],
            [
                "18-01-2018",
                "Interim Dividend"
            ],
            [
                "01-01-1970",
                "The Board of Directors in their meeting dated 25th October 2016 had constituted a Committee of Directors ('COD') to evaluate selling stake in Bharti Infratel, following which 13.96% shares was sold to a Group of Private Equity Investors and to QIPs by way of market transactions. Airtel now holds directly and through its subsidiary an overall shareholding of 58% in Bharti Infratel. Airtel has been approached by a few reputed Global Investors to acquire a significant stake in Bharti Infratel which, if accepted, could result in such investors acquiring control of Bharti Infratel. The COD has recommended that such proposals be duly considered. It may however be noted that the Company has not entered into any agreements in relation to any such proposal or discussions and there is no certainty of any transaction until such time the Board reviews and approves a final proposal."
            ],
            [
                "01-01-1970",
                "In furtherance to our intimation dated October 31, 2017 under Regulations 30 & 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 w.r.t. the audited financial results for the second quarter (Q2) and half year ended September 30, 2017 approved by Board in its Board meeting held today, we wish to inform that the said Board meeting of the Company had concluded at 05:30 PM. Kindly take the same on record."
            ],
            [
                "31-10-2017",
                "Pursuant to Regulation 29 (1) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, notice is hereby given that the meeting of Board of Directors of the Company will be held on Tuesday, 31st day of October 2017, to consider and take on record the Audited Financial Results for the second quarter (Q2) and half year ended on September 30, 2017. For the purpose of the above and as per the Company's Internal Code for Prevention of Insider Trading, the Trading Window for dealing in the securities of the Company has been closed from October 01, 2017 to November 02, 2017 (both days inclusive). Please take the above information on record."
            ],
            [
                "18-07-2017",
                ""
            ],
            [
                "25-07-2017",
                "Quarterly Results"
            ],
            [
                "09-05-2017",
                "Dividend"
            ],
            [
                "14-03-2017",
                "Buy Back of Shares"
            ],
            [
                "07-02-2017",
                ""
            ],
            [
                "24-01-2017",
                "With reference to earlier intimation under Regulations 30 & 33 of the SEBI (LO&DR) Regulation, 2015 regarding the financial results for the third quarter (Q3) and nine months ended December 31, 2016 at the Board Meeting on January 24, 2017, Bharti Airtel Ltd has further informed BSE that Board Meeting of the Company has concluded at 07:15 P.M."
            ],
            [
                "25-10-2016",
                "Quarterly Results"
            ],
            [
                "27-07-2016",
                "Quarterly Results"
            ],
            [
                "27-04-2016",
                "Final Dividend & Buy Back of Shares"
            ],
            [
                "28-01-2016",
                "Quarterly Results"
            ],
            [
                "26-10-2015",
                "Quarterly Results"
            ],
            [
                "04-08-2015",
                "Quarterly Results"
            ],
            [
                "28-04-2015",
                "Final Dividend"
            ],
            [
                "28-04-2015",
                "Final Dividend"
            ],
            [
                "04-02-2015",
                "Quarterly Results"
            ],
            [
                "30-10-2014",
                "Quarterly Results"
            ],
            [
                "13-08-2014",
                "Interim Dividend"
            ],
            [
                "29-07-2014",
                "Quarterly Results"
            ],
            [
                "29-04-2014",
                "Final Dividend"
            ],
            [
                "29-04-2014",
                "Audited Results"
            ],
            [
                "29-01-2014",
                "Quarterly Results"
            ],
            [
                "30-10-2013",
                "Quarterly Results"
            ],
            [
                "31-07-2013",
                "Quarterly Results"
            ],
            [
                "02-05-2013",
                "Audited Results"
            ],
            [
                "01-02-2013",
                "Quarterly Results"
            ],
            [
                "07-11-2012",
                "Quarterly Results"
            ],
            [
                "08-08-2012",
                "Quarterly Results"
            ],
            [
                "02-05-2012",
                "Audited Results"
            ],
            [
                "08-02-2012",
                "Quarterly Results"
            ],
            [
                "04-11-2011",
                "Quarterly Results"
            ],
            [
                "03-08-2011",
                "Quarterly Results"
            ],
            [
                "05-05-2011",
                "Audited Results"
            ],
            [
                "02-02-2011",
                "Quarterly Results"
            ],
            [
                "10-11-2010",
                "Quarterly Results"
            ],
            [
                "11-08-2010",
                "Quarterly Results"
            ],
            [
                "28-04-2010",
                "Audited Results"
            ],
            [
                "22-01-2010",
                "Quarterly Results"
            ],
            [
                "30-10-2009",
                "Quarterly Results"
            ],
            [
                "23-07-2009",
                "Quarterly Results"
            ],
            [
                "29-04-2009",
                "Final Dividend (Revised)"
            ],
            [
                "30-04-2009",
                "Audited Results"
            ],
            [
                "22-01-2009",
                "Quarterly Results"
            ],
            [
                "31-10-2008",
                "Quarterly Results"
            ],
            [
                "24-07-2008",
                "Quarterly Results"
            ],
            [
                "25-04-2008",
                "Audited Results"
            ],
            [
                "30-01-2008",
                "Quarterly Results"
            ],
            [
                "31-10-2007",
                "Half Yearly Results & Quarterly Results"
            ],
            [
                "26-07-2007",
                "Quarterly Results"
            ],
            [
                "27-04-2007",
                "Audited Results"
            ],
            [
                "23-01-2007",
                "Quarterly Results"
            ],
            [
                "27-10-2006",
                "Half Yearly Results & Quarterly Results"
            ],
            [
                "26-07-2006",
                "Quarterly Results"
            ],
            [
                "28-04-2006",
                "Accounts"
            ],
            [
                "24-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "07-08-2024",
                "07-08-2024",
                "160%",
                "Recommendation of Final Dividend for FY 2023-24 The Board has considered and recommended a final dividend of Rs. 8/- per fully paid-up equity share of face value Rs. 5/- each and Rs. 2/- per partly paid-up equity share of face value Rs. 5/- each (paid-up value Rs.1.25/- per share) for the financial year 2023-24. The dividend is in proportion to the amount paid-up on each equity share of face value Rs. 5/- each Pursuant to Regulation 42 of SEBI Listing Regulations, the Company has fixed the ''Record Date'' for payment of dividend as enclosed. (As Per BSE Announcement Dated on: 26/07/2024)"
            ],
            [
                "11-08-2023",
                "11-08-2023",
                "80%",
                "Board has considered and recommended a final dividend of Rs. 4/- per fully paid-up equity share of face value Rs. 5/- each and Re. 1/- per partly paid-up equity share of face value Rs. 5/- each (paid-up Rs. 1.25 per share) for the financial year 2022-23. The dividend is in proportion to the amount paid-up on each equity share of face value Rs. 5/- each."
            ],
            [
                "02-08-2022",
                "01-08-2022",
                "60%",
                "Bharti Airtel Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 17, 2022, inter alia, has considered and recommended a dividend of Rs. 3/- per fully paid-up equity share of face value Rs. 5/- each and Rs. 0.75/- per partly paid-up equity share of face value Rs. 5/- each (paid-up Rs. 1.25 per share) for the financial year 2021-22. The dividend is in proportion to the amount paid-up on each equity share of face value Rs. 5/- each."
            ],
            [
                "07-08-2020",
                "06-08-2020",
                "40%",
                "Further to our intimation dated May 18, 2020 and in terms of Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (''Listing Regulations''), we are pleased to inform you that subject to the approval of the shareholders in the ensuing Annual General Meeting (''AGM''), the Board of Directors (''Board'') of the Company at its meeting held today i.e. May 18, 2020 (commenced at IST 1800 Hrs. and is still in progress), has considered and recommended a final dividend of Rs. 2/- per equity share (face value of Rs. 5/- each) for the financial year 2019-20. The above dividend, if declared by the shareholders at the ensuing AGM, will be credited / dispatched within 30 days from the date of AGM. Kindly take the same on record."
            ],
            [
                "06-11-2018",
                "05-11-2018",
                "50%",
                "Rs.2.5000 per share(50%)Interim Dividend"
            ],
            [
                "04-08-2018",
                "02-08-2018",
                "50%",
                "Rs.2.5000 per share(50%)Final Dividend"
            ],
            [
                "31-01-2018",
                "30-01-2018",
                "56%",
                "Rs.2.8400 per share(56.8%)Interim Dividend"
            ],
            [
                "15-07-2017",
                "13-07-2017",
                "20%",
                "Rs.1.0000 per share(20%)Dividend"
            ],
            [
                "13-08-2016",
                "11-08-2016",
                "27%",
                "Rs.1.3600 per share(27.2%)Final Dividend"
            ],
            [
                "15-08-2015",
                "13-08-2015",
                "44%",
                "Rs.2.2200 per share(44.4%)Final Dividend"
            ],
            [
                "23-08-2014",
                "21-08-2014",
                "32%",
                "Rs.1.6300 per share(32.6%)Interim Dividend"
            ],
            [
                "23-08-2014",
                "21-08-2014",
                "36%",
                "Final Dividend"
            ],
            [
                "25-05-2013",
                "23-05-2013",
                "20%",
                "Rs.1.0000 per share(20%)Final Dividend"
            ],
            [
                "18-08-2012",
                "16-08-2012",
                "20%",
                "Rs.1.00 per share(20%)Final Dividend"
            ],
            [
                "20-08-2011",
                "17-08-2011",
                "20%",
                "Rs.1.00 per share(20%)Final Dividend"
            ],
            [
                "21-08-2010",
                "18-08-2010",
                "20%",
                "Rs.1.00 per share(20%)Final Dividend & A.G.M."
            ],
            [
                "31-07-2009",
                "24-07-2009",
                "20%",
                "20 % Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "31-07-2009",
                "24-07-2009",
                "5:10"
            ]
        ]
    },
    "bonus": {
        "title": "Bonus",
        "msg": "Bharti Airtel has not announced any bonus for the last few years."
    },
    "rights": {
        "msg": "",
        "title": "Rights",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio",
            "Premium"
        ],
        "data": [
            [
                "28-09-2021",
                "27-09-2021",
                "1:14",
                "530"
            ],
            [
                "24-04-2019",
                "23-04-2019",
                "19:67",
                "215"
            ]
        ]
    }
}