{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "22-05-2025",
                "Quarterly Results"
            ],
            [
                "22-05-2025",
                "Sun Pharmaceutical Industries Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/05/2025 inter alia to consider and approve Board Meeting Intimation for approval of audited financial results and Final Dividend if any"
            ],
            [
                "31-01-2025",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2025 inter alia to consider and approve financial results for the quarter and nine months ended December 31 2024 and interim dividend Intimation regarding record date for the purpose of interim dividend, if declared Board approved interim dividend for FY 2024-25 (As Per BSE Announcement Dated on 30/01/2025)"
            ],
            [
                "28-10-2024",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2024 inter alia to consider and approve Financial Results for the quarter and half year ended September 30 2024 Financial results for quarter and half year ended September 30, 2024 (As Per BSE Announcement dated on 28.10.2024)"
            ],
            [
                "01-08-2024",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/08/2024 inter alia to consider and approve Quarterly Financial Results for Q1 of FY 2024-25. Outcome of Board Meeting (As per BSE Announcement Dated on 01/08/2024)"
            ],
            [
                "22-05-2024",
                "Quarterly Results"
            ],
            [
                "22-05-2024",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/05/2024 inter alia to consider and approve 1. Audited Standalone and Consolidated Financial Results of the Company for the quarter and year ended March 31 2024. 2. Recommendation of final dividend if any on the equity shares of the Company for the financial year ended March 31 2024 for approval of the shareholders at the ensuing Annual General Meeting. Recommended Final Dividend of Rs. 5 per share Outcome of Board meeting (As Per BSE Announcement Dated on 22.05.2024)"
            ],
            [
                "31-01-2024",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2024 inter alia to consider and approve This is to inform that the meeting of the Board of Directors of Sun Pharmaceutical Industries Limited is scheduled to be held on Wednesday January 31 2024 inter alia 1. To consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and nine months ended December 31 2023 2. To consider and approve declaration of Interim Dividend for the financial year 2023-24 February 9, 2024, is fixed as Record Date for Interim Dividend for FY 2023-24. An interim dividend of Rs. 8.5/- per equity shares of Rs. 1/- each of the company for the FY 2023-24 is declared. Unaudited Financial Results for the quarter and nine months ended December 31, 2023 (As Per BSE Announcement Dated on 31.01.2024)"
            ],
            [
                "01-11-2023",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2023 inter alia to consider and approve unaudited financial results for the quarter and half year ended September 30 2023. Outcome of the Board meeting The Board has approved a Composite Scheme of Arrangement. Detail are provided in the letter attached. (As Per BSE Announcement Dated on 01/11/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "03-08-2023",
                "Quarterly Results"
            ],
            [
                "03-08-2023",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/08/2023 inter alia to consider and approve Unaudited Standalone and Consolidated financial results of the company. As per the letter attached. (As Per BSE Announcement dated on 03.08.2023)"
            ],
            [
                "26-05-2023",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/05/2023 inter alia to consider and approve 1. To approve Audited Standalone and Consolidated Financial Results of the Company for the fourth quarter and year ended March 31 2023. 2. To consider and recommend final dividend if any on the equity shares of the Company for the financial year ended March 31 2023. With reference to the intimation of Board meeting submitted on May 11, 2023, we wish to inform you that the Meeting of the Board of Directors of the Company was held today i.e. May 26, 2023 which commenced at 10:40 a.m. and ended at 02:35 p.m., wherein the Board has, inter-alia, 1. Approved Financial Results for the fourth quarter and year ended March 31, 2023 2. Recommended Final Dividend for financial year 2022-23 (As Per BSE Announcement dated on 26.05.2023) The Board of Directors at their meeting held on May 26, 2023, inter alia, have approved the following: 1. Appointment of Mr. Rolf Hoffmann as an Independent Director 2. Appointment of Mr. Aalok Shanghvi as a Whole-time Director (As Per BSE Announcement Dated on 27.05.2023)"
            ],
            [
                "31-01-2023",
                "Quarterly Results"
            ],
            [
                "31-01-2023",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2023 inter alia to consider and approve 1. Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and nine months ended December 31 2022 2. Declaration of Interim Dividend for the financial year 2022-23"
            ],
            [
                "01-11-2022",
                "Quarterly Results"
            ],
            [
                "01-11-2022",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2022 inter alia to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30 2022"
            ],
            [
                "29-07-2022",
                "Quarterly Results"
            ],
            [
                "29-07-2022",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/07/2022 inter alia to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter ended June 30 2022 With reference to the intimation of Board meeting submitted on July 12, 2022, we wish to inform you that the Meeting of the Board of Directors of the Company was held today i.e. July 29, 2022 which commenced at 10:00 a.m. IST and ended at 01:25 p.m. IST. The Board has, inter-alia, approved Unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2022. (As per BSE Announcement Dated on 29/07/2022)"
            ],
            [
                "30-05-2022",
                "Quarterly Results"
            ],
            [
                "30-05-2022",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/05/2022 inter alia to consider and approve i. Annual Audited Standalone and Consolidated Financial Results; and ii. Recommendation of final dividend if any. Attached (As Per BSE Announcement dated on 30.05.2022)"
            ],
            [
                "31-01-2022",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2022 inter alia to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Monday January 31 2022 to inter alia consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and nine months ended December 31 2021. Further kindly note that pursuant to the Companys Code of Conduct for Prevention of Insider Trading the window closure for trading by Designated Persons commenced on January 01 2022 and shall end on February 02 2022 i.e. after 48 hours of the declaration of financial results of the Company on January 31 2022. This is for your information and dissemination. This is to inform you that the Board of Directors of the Company, at its meeting scheduled to be held on Monday, January 31, 2022, will inter-alia consider declaration of Interim Dividend on the equity shares of the Company, for the financial year 2021-22. (As Per BSE Announcement dated on 25.01.2022) As per the letter attached (As per BSE Announcement Dated on 31/01/2022) Sun Pharmaceutical Industries Ltd has informed BSE that the Company has fixed February 10, 2022 as the Record Date for the purpose of Payment of Interim Dividend. The payment of the interim dividend would be made to the eligible shareholders on or before February 22, 2022. (As Per BSE Announcement dated on 01.02.2022)"
            ],
            [
                "02-11-2021",
                "Quarterly Results"
            ],
            [
                "02-11-2021",
                "Quarterly Results SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 02/11/2021 ,inter alia, to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Tuesday, November 02, 2021 to inter alia consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30, 2021. Further, kindly note that pursuant to the Company''s Code of Conduct for Prevention of Insider Trading, the window closure for trading by Designated Persons, commenced on October 01, 2021, and shall end on November 04, 2021 i.e. after 48 hours of the declaration of financial results of the Company on November 02, 2021. This is for your information and dissemination. The Board of Directors of the Company at its meeting held today i.e. November 02, 2021 has inter alia considered and approved the Unaudited Standalone and Consolidated Financial Results for the quarter and half year ended September 30, 2021. Pursuant to Regulation 30 and 33 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 (\"Listing Regulations\"), we enclose herewith the following as 'Annexure': a) Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30, 2021. b) Limited Review Report of the Statutory Auditors of the Company on Unaudited Standalone and Consolidated Financial Results for the quarter and half year ended September 30, 2021. The meeting of the Board of Directors of the Company commenced at 10:30 a.m. and concluded at 01:10 p.m. (As Per BSE Announcement Dated 02.11.2021)"
            ],
            [
                "30-07-2021",
                "Quarterly Results"
            ],
            [
                "30-07-2021",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/07/2021 ,inter alia, to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter ended June 30, 2021 The Board of Directors of the Company at its meeting held today i.e. July 30, 2021 has inter alia considered and approved the Unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2021. Pursuant to Regulation 30 and 33 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('Listing Regulations'), we enclose herewith the following as 'Annexure': a) Unaudited (Standalone and Consolidated) Financial Results of the Company for the quarter ended June 30, 2021. b) Limited Review Report of the Statutory Auditors of the Company on Unaudited (Standalone and Consolidated) Financial Results for the quarter ended June 30, 2021. The meeting of the Board of Directors of the Company commenced at 10.15 a.m. and concluded at 1:45 p.m. (As per BSE Announcement Dated on 30/07/2021)"
            ],
            [
                "27-05-2021",
                "Quarterly Results"
            ],
            [
                "27-05-2021",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/05/2021 ,inter alia, to consider and approve (i) Audited Standalone and Consolidated Financial Results of the Company for the fourth quarter and year ended March 31, 2021. (ii) recommendation of final dividend for the year ended March 31, 2021 subject to the approval of the shareholders at the ensuing 29th Annual General Meeting. As per letter attached (As Per BSE Announcement dated on 27.05.2021)"
            ],
            [
                "29-01-2021",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2021 ,inter alia, to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Friday, January 29, 2021 to inter alia consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and nine months ended December 31, 2020. Further, kindly note that pursuant to the Company''s Code of Conduct for Prevention of Insider Trading, the window closure for trading by Designated Persons, commenced on January 01, 2021, and shall end on January 31, 2021 i.e. after 48 hours of the declaration of financial results of the Company on January 29, 2021. This is for your information and record. The Board of Directors of the Company, at its meeting scheduled to be held on Friday, January 29, 2021, will inter-alia consider declaration of Interim Dividend on the equity shares of the Company, for the financial year 2020-21 (AS Per BSE Announcement Dated on 21.01.2021) 1)Approval of Unaudited Financial Statements for the quarter and nine months ended December 31, 2020; 2) Declaration of an Interim Dividend for the financial year ending on March 31, 2021 and fixing of Record Date for the same; and 3) Re-appointment of Mr. Kalyanasundaram Subramanian (DIN: 00179072) as Whole-time Director for further period of two years w.e.f. February 14, 2021. The Board at its meeting held today, declared an interim dividend of Rs. 5.50/- (Rupees Five and paise fifty only) per equity share of Re. 1/- each of the Company for the financial year ending on March 31, 2021. Further, the Board of Directors of the Company has fixed Wednesday, February 10, 2021 as the Record Date to determine the names of the equity shareholders, who shall be entitled to receive payment towards Interim Dividend of the Company for the financial year 2020-21 declared today. The payment of the interim dividend would be made to the eligible shareholders on or before February 19, 2021. 1) Approval of Unaudited Financial Statements for the quarter and nine months ended December 31, 2020; 2) Declaration of an Interim Dividend for the financial year ending on March 31, 2021 and fixing of Record Date for the same; and 3) Re-appointment of Mr. Kalyanasundaram Subramanian (DIN: 00179072) as Whole-time Director for further period of two years w.e.f. February 14, 2021. The Board at its meeting held today, declared an interim dividend of Rs. 5.50/- (Rupees Five and paise fifty only) per equity share of Re. 1/- each of the Company for the financial year ending on March 31, 2021. Further, the Board of Directors of the Company has fixed Wednesday, February 10, 2021 as the Record Date to determine the names of the equity shareholders, who shall be entitled to receive payment towards Interim Dividend of the Company for the financial year 2020-21 declared today. The payment of the interim dividend would be made to the eligible shareholders on or before February 19, 2021. (As Per BSE Announcement Dated on 1/29/2021)"
            ],
            [
                "03-11-2020",
                "Quarterly Results"
            ],
            [
                "03-11-2020",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/11/2020 ,inter alia, to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30, 2020. The Board of Directors of the Company at its meeting held today i.e. November 03, 2020 has inter alia considered and approved the Unaudited Standalone and Consolidated Financial Results for the quarter and half year ended September 30, 2020. Pursuant to Regulation 30 and 33 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('Listing Regulations'), we enclose herewith the following as 'Annexure': a) Unaudited (Standalone and Consolidated) Financial Results of the Company for the quarter and half year ended September 30, 2020. b) Limited Review Report of the Statutory Auditors of the Company on Unaudited (Standalone and Consolidated) Financial Results for the quarter and half year ended September 30, 2020. The meeting of the Board of Directors of the Company commenced at 10:30 a.m. and concluded at 02:40 p.m. (AS Per BSE Announcement Dated on 03.11.2020)"
            ],
            [
                "31-07-2020",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/07/2020 ,inter alia, to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Friday, July 31, 2020, interalia, to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter ended June 30, 2020. Further, kindly note that pursuant to the Company''s Code of Conduct for Prevention of Insider Trading, the window closure for trading by Designated Persons, commenced on July 01, 2020, and shall end on August 02, 2020."
            ],
            [
                "27-05-2020",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/05/2020 ,inter alia, to consider and approve (i) To consider and approve Audited Standalone and Consolidated Financial Results of the Company for the fourth quarter and year ended March 31, 2020. (ii) To consider recommendation of final dividend for the year ended March 31, 2020 subject to the approval of the shareholders at the ensuing Annual General Meeting. As per file attached (As Per BSE Announcement Dated on 27.05.2020)"
            ],
            [
                "17-03-2020",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/03/2020 ,inter alia, to consider and approve inter alia, the proposal for buy-back of fully paid-up equity shares of the Company, which would include maximum amount, maximum number of equity shares, mode of buy-back and other matters incidental thereto in accordance with the provisions of Section 68, 69 and 70 of the Companies Act,2013, read with rules made thereto and Securities and Exchange Board of India (Buy-back of Securities) Regulations, 2018. In this connection, as per the Company''s code of conduct for prevention of insider trading, the trading window for dealing or trading in securities of the Company will remain closed with immediate effect for all directors, designated persons and insiders and shall re-open after the expiry of 48 hours after the conclusion of the aforesaid Board Meeting. As per letter attached Outcome of Board Meeting pursuant to Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, as amended, (\"Listing Regulations\"). (As Per BSE Announcement dated on 17.03.2020)"
            ],
            [
                "06-02-2020",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/02/2020 ,inter alia, to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Thursday, February 06, 2020, to inter alia consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and nine months ended December 31, 2019. This is for your information and record. Sub: Prior intimation under Regulation 29 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 This is to inform you that the Board of Directors of the Company, at its meeting scheduled on Thursday, February 6, 2020, will inter-alia consider declaration of Interim Dividend on the equity shares of the Company, for the Financial Year 2019-2020. (As Per BSE Announcement dated on 03/02/2020) As per letter attached (As Per BSE Announcement Dated on 06.02.2020) Sun Pharmaceutical Industries Ltd has informed BSE that the Company has fixed February 18, 2020 as the Record Date for the purpose of Payment of Interim Dividend. The payment of the interim dividend would be made to the eligible shareholders on or before February 24, 2020. (As Per BSE Announcement Dated on 07/02/2020)"
            ],
            [
                "07-11-2019",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/11/2019 ,inter alia, to consider and approve This is to inform you that the meeting of the Board of Directors of the Company will be held on Thursday, November 07, 2019, to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30,2019. This is for your information and record. Pursuant to Regulation 30 and 33 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors of the Company at its meeting held today i.e. Thursday,November 07, 2019, duly approved the Standalone and Consolidated Unaudited Financial Results for the quarter and six months ended September 30, 2019, which are enclosed herewith a1ongwith the Limited Review Report of the Statutory Auditors of the Company on Standalone and Consolidated Unaudited Financial Results. The meeting of the Board of Directors of the Company commenced at 11: 15 a.m. and concluded at 2:25 p.m. (As Per BSE Announcement Dated on 07.11.2019)"
            ],
            [
                "13-08-2019",
                "Quarterly Results"
            ],
            [
                "28-05-2019",
                "Dividend inter alia, To consider recommendation of dividend for the year ended March 31 , 2019. & Audited Results"
            ],
            [
                "12-02-2019",
                "Quarterly Results"
            ],
            [
                "13-11-2018",
                "SUN PHARMACEUTICAL INDUSTRIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/11/2018 ,inter alia, to consider and approve This is to inform you that a meeting of the Board of Directors of the Company will be held on Tuesday, November 13, 2018, to consider and approve Unaudited Standalone and Consolidated Financial Results of the Company for the quarter and half year ended September 30, 2018. In view of the above, the window closure for trading by designated persons as per Insider Trading Rules of the Company will be from Wednesday, October 31, 2018 to Thursday, November 15, 2018 (both days inclusive). This is for your information and record."
            ],
            [
                "14-08-2018",
                "Quarterly Results"
            ],
            [
                "25-05-2018",
                "Dividend & Audited Results"
            ],
            [
                "14-02-2018",
                "Quarterly Results"
            ],
            [
                "14-11-2017",
                "1. This is to inform you that a meeting of the Board of Directors of the Company will be held on Tuesday, November 14, 2017 to consider and take on record the Unaudited Financial Results of the Company for the quarter and half year ended September 30, 2017. 2. In view of the consideration of above, the window closure for trading by designated persons as per Insider Trading Rules of the Company will be from Friday, November 3, 2017 to Thursday, November 16, 2017 (both days inclusive)."
            ],
            [
                "11-08-2017",
                "Dear Sirs, 1. This is to inform you that a meeting of the Board of Directors of the Company will be held on Friday, August 11, 2017 to consider and take on record the Unaudited Financial Results of the Company for the quarter ended June 30, 2017. 2. In view of the consideration of above, the window closure for trading by designated persons as per Insider Trading Rules of the Company will be from Wednesday, August 2, 2017 to Wednesday, August 16, 2017 (both days inclusive). This is for your information and record."
            ],
            [
                "26-05-2017",
                "Sun Pharmaceutical Industries Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on May 26, 2017, inter alia, to transact the following business: 1. To consider and approve standalone and consolidated Audited Financial Results of the Company for the quarter and year ended March 31, 2017. 2. To consider recommendation of dividend for the year ended March 31, 2017 subject to the approval of the shareholders at the ensuing Annual General Meeting. Further, the window closure for trading by designated persons as per Insider Trading Rules of the Company will be from May 17, 2017 to May 30, 2017 (both days inclusive). & Dividend & Audited Results"
            ],
            [
                "14-02-2017",
                "Quarterly Results"
            ],
            [
                "10-11-2016",
                "Sun Pharmaceutical Industries Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on November 10, 2016, inter alia, to transact the following business: 1. To consider and take on record the Unaudited Financial Results of the Company for the quarter and half year ended September 30, 2016 (Q2). 2. To consider the proposal for the merger/amalgamation of Ranbaxy Drugs Limited, Vidyut Investments Limited, Gufic Pharma Limited and Sun Pharma Medisales Private Limited (formerly known as Solrex Pharmaceutical Company), all four companies being wholly owned subsidiaries of Sun Pharmaceutical Industries Ltd., with Sun Pharmaceutical Industries Ltd subject to receipt of necessary approvals. & Quarterly Results"
            ],
            [
                "12-08-2016",
                "Quarterly Results"
            ],
            [
                "30-05-2016",
                "Audited Results & Dividend"
            ],
            [
                "12-02-2016",
                "Quarterly Results"
            ],
            [
                "07-11-2015",
                "Quarterly Results"
            ],
            [
                "11-08-2015",
                "With reference to earlier announcement regarding Q1 results on August 11, 2015, Company has now informed BSE that the Board of Directors of the Company at its meeting scheduled to be held on August 11, 201 5 would also transact the following business: 1. Consideration of the revised audited annual accounts of the Company for the year ended March 31, 2015 after giving the effect to the Scheme of Amalgamation of SPGI into SPIL and the proposal for payment of dividend. 2. Consideration of the recommendation of payment of dividend on equity shares for the year ended March 31, 2015 subject to the approval of the shareholders at the ensuing Annual General Meeting. & Dividend"
            ],
            [
                "11-08-2015",
                "With reference to earlier announcement regarding Q1 results on August 11, 2015, Company has now informed BSE that the Board of Directors of the Company at its meeting scheduled to be held on August 11, 201 5 would also transact the following business: 1. Consideration of the revised audited annual accounts of the Company for the year ended March 31, 2015 after giving the effect to the Scheme of Amalgamation of SPGI into SPIL and the proposal for payment of dividend. 2. Consideration of the recommendation of payment of dividend on equity shares for the year ended March 31, 2015 subject to the approval of the shareholders at the ensuing Annual General Meeting. & Dividend"
            ],
            [
                "29-05-2015",
                "Audited Results"
            ],
            [
                "14-02-2015",
                "Quarterly Results"
            ],
            [
                "13-11-2014",
                "Quarterly Results"
            ],
            [
                "12-08-2014",
                "Quarterly Results & BSE that the Hon'ble High Court of Gujarat, at Ahmedabad at its hearing held on July 10, 2014 has approved the Scheme of Arrangement and Reconstruction between Sun Pharmaceutical Industries Limited (SPIL) and Bun Pharma Global FZE (SPGFZE) in the nature of demerger and transfer of the specified Undertaking of SPGFZE to SPIL with effect from the appointed date of May 01, 2013. This is to further inform that the certified copy of the High Court order is expected to be received shortly and will be filed with the Registrar of Companies there after as required and the demerger process would get completed on such filing. 2. The Board of Directors of the Company would meet on August 12, 2014 to transact, inter alia, the following business. i) Consider the revised audited annual accounts of the Company for the year ended March 31, 2014 after giving the effect to the above mentioned Scheme of Arrangement and Reconstruction between SPIL and SPGFZE. (ii) To consider the recommendation of payment of dividend on equity shares for the year ended March 31, 2014 subject to the approval of the shareholders at the ensuing Annual General Meeting. (iii) To consider and take on record the un-audited financial results of the Company for the first quarter ended June 30, 2014 (Q1). 3. The window closure for Trading by Designated persons as per Insider Trading Rules of the Company will be from August 01, 2014 to August 14, 2014 (both days inclusive). & Dividend"
            ],
            [
                "29-05-2014",
                "Audited Results"
            ],
            [
                "13-02-2014",
                "Quarterly Results"
            ],
            [
                "13-11-2013",
                "Quarterly Results"
            ],
            [
                "09-08-2013",
                "Quarterly Results"
            ],
            [
                "28-05-2013",
                "Audited Results & Dividend"
            ],
            [
                "08-02-2013",
                "Quarterly Results"
            ],
            [
                "08-11-2012",
                "Quarterly Results"
            ],
            [
                "10-08-2012",
                "Quarterly Results"
            ],
            [
                "29-05-2012",
                "Dividend & Audited Results"
            ],
            [
                "13-02-2012",
                "Quarterly Results"
            ],
            [
                "13-11-2011",
                "Quarterly Results"
            ],
            [
                "28-07-2011",
                "Quarterly Results"
            ],
            [
                "28-05-2011",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2011",
                "Quarterly Results"
            ],
            [
                "30-10-2010",
                "Quarterly Results"
            ],
            [
                "28-07-2010",
                "Quarterly Results"
            ],
            [
                "24-05-2010",
                "Dividend & Audited Results"
            ],
            [
                "29-01-2010",
                "Quarterly Results"
            ],
            [
                "28-10-2009",
                "Quarterly Results"
            ],
            [
                "29-07-2009",
                "Quarterly Results"
            ],
            [
                "30-05-2009",
                "Dividend & Audited Results"
            ],
            [
                "30-01-2009",
                "Quarterly Results"
            ],
            [
                "25-10-2008",
                "Quarterly Results"
            ],
            [
                "28-07-2008",
                "Quarterly Results"
            ],
            [
                "30-05-2008",
                "Dividend & Audited Results"
            ],
            [
                "01-01-1970",
                "Sun Pharmaceutical Industries Ltd has informed BSE that pursuant to the terms and conditions of the Offering Circular dated \r\nNovember 24, 2004, the Committee of Directors (Allotment) of the Company at its meeting held on March 20, 2008, has allotted \r\n25,18,834 (Twenty Five Lacs Eighteen Thousand Eight Hundred Thirty Four) Equity Shares of Rs 5/- each of the Company at a \r\npremium of Rs 724.30 per share upon exercise of option of conversion for 40,813 - Zero Coupon Foreign Currency Convertible \r\nBonds of US $ 1000 each (FCCB) into Equity shares of the Company by FCCB holders.  Consequently, the paid up Equity Share \r\nCapital of the Company has increased from 20,45,97,557 Equity Shares of Rs 5/- each to 20,71,16,391 Equity Shares of Rs 5/- \r\neach, as of date.  Further the Company has informed that, with this, the entire 350,000 ? Zero Coupon Foreign Currency \r\nConvertible Bonds due 2009 of US $ 1000 each (FCCB) aggregating to US$ 350.0 Million issued by the Company have been \r\nconverted into Equity Shares of Rs 5/- each of the Company and hence, there is no ECCB outstanding as on date."
            ],
            [
                "30-01-2008",
                "Quarterly Results"
            ],
            [
                "25-10-2007",
                "Quarterly Results & To consider payment of interim dividend @ 6% p.a. on outstanding 1,37,40,030 Preference Shares of Re 1/- each on prorata basis for the period from April 01, 2007 to November 01, 2007 i.e. the date of compulsory redemption by the Company."
            ],
            [
                "23-07-2007",
                "Quarterly Results"
            ],
            [
                "18-05-2007",
                "Audited Results (Revised)"
            ],
            [
                "15-05-2007",
                "Audited Results"
            ],
            [
                "10-03-2007",
                "Interim Dividend"
            ],
            [
                "29-01-2007",
                "Quarterly Results"
            ],
            [
                "19-10-2006",
                "Quarterly Results"
            ],
            [
                "26-07-2006",
                "Quarterly Results"
            ],
            [
                "06-06-2006",
                "Accounts & Dividend & Recommendation of payment of preference share dividend @ 6% p.a. on outstanding Preference Shares for the year ended March 31, 2006, subject to the approval of the shareholders at the ensuing Annual General Meeting (AGM)"
            ],
            [
                "31-03-2006",
                ""
            ],
            [
                "09-02-2006",
                "inter alia, to consider the proposal for demerger of the Company's Innovative Research & Development (including new drug delivery systems) undertaking to a new company."
            ],
            [
                "30-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "06-02-2025",
                "06-02-2025",
                "1050%",
                "Board approved interim dividend for FY 2024-25"
            ],
            [
                "12-07-2024",
                "12-07-2024",
                "500%",
                "Board of Directors of the Company was held today i.e. May 22, 2024 Final dividend of Rs. 5/- (Rupees Five only) per equity share of Re. l/- (Rupee One only) each is recommended to the shareholders for their approval at the ensuing Annual General Meeting of the Company. Final dividend, once approved by the shareholders, shall be to be paid within the prescribed timeline under the Companies Act, 2013."
            ],
            [
                "09-02-2024",
                "09-02-2024",
                "850%",
                "Meeting of the Board of Directors of the Company (\"Board\") was held today i.e. January 31, 2024 which commenced at 10:20 a.m. and ended at 1:55 p.m., IST. The Board has, inter-alia, approved the following: Declaration of Interim Dividend for the financial year 2023-24 An interim dividend of Rs. 8.5/- (Rupees Eight and fifty paisa only) per equity share of Re. l/- (Rupee one only) each of the Company for the financial year 2023-24 is declared. As intimated on January 15, 2024, the Record Date for entitlement of interim dividend for the financial year 2023-24 is February 09, 2024. The interim dividend shall be paid on or before February 23, 2024."
            ],
            [
                "28-07-2023",
                "28-07-2023",
                "400%",
                "With reference to the intimation of Board meeting submitted on May 11, 2023, we wish to inform you that the Meeting of the Board of Directors of the Company was held today i.e. May 26, 2023 which commenced at 10:40 a.m. and ended at 02:35 p.m., wherein the Board has, inter-alia, Recommended Final Dividend for financial year 2022-23 Final dividend of Rs. 4.00/- (Rupees Four only) per equity share of Re. l/- (Rupee One only) each of the Company is recommended subject to approval of the shareholders at the ensuing 31st Annual General Meeting and which shall be paid within the timelines as required under the Companies Act, 2013."
            ],
            [
                "08-02-2023",
                "08-02-2023",
                "750%",
                "The Board has, inter-alia, Considered and approved declaration of Interim Dividend for the financial year 2022-23 An interim dividend of Rs. 7.50/- (Rupees seven and paise fifty only) per equity share of Re. l/- (Rupee one only) each of the Company for the financial year 2022-23. Further, as already intimated on January 16, 2023, the Record Date for entitlement of interim dividend for the financial year 2022-23 is February 08, 2023. The interim dividend shall be paid on or before February 20, 2023."
            ],
            [
                "22-08-2022",
                "19-08-2022",
                "300%",
                "Attached Final dividend of Rs. 3.00 /- (Rupees Three only) per equity share of face value of Re.1/- each of the Company is recommended subject to the approval of the shareholders at the ensuing Annual General Meeting and which shall be paid within the timelines as required under the Companies Act, 2013."
            ],
            [
                "10-02-2022",
                "09-02-2022",
                "700%",
                "Declared interim dividend of Rs. 7/- (Rupees Seven Only) per equity share of Re. l/- each of the Company for the financial year ending on March 31, 2022. Refer letter attached"
            ],
            [
                "25-08-2021",
                "23-08-2021",
                "200%",
                "Recommended payment of final dividend of Rs. 2/- (Rupees Two Only) per equity share of Re. l/-each of the Company for the year ended March 31, 2021, subject to the approval of the shareholders at the ensuing Annual General Meeting of the Company. The dividend is expected to be paid on or before about September 17, 2021."
            ],
            [
                "10-02-2021",
                "09-02-2021",
                "550%",
                "The Board at its meeting held today, declared an interim dividend of Rs. 5.50/- (Rupees Five and paise fifty only) per equity share of Re. 1/- each of the Company for the financial year ending on March 31, 2021."
            ],
            [
                "21-08-2020",
                "19-08-2020",
                "100%",
                "As per file attached"
            ],
            [
                "18-02-2020",
                "17-02-2020",
                "300%",
                "As per letter attached Sun Pharmaceutical Industries Ltd has informed BSE that the Company has fixed February 18, 2020 as the Record Date for the purpose of Payment of Interim Dividend. The payment of the interim dividend would be made to the eligible shareholders on or before February 24, 2020. (As Per BSE Announcement Dated on 07/02/2020)"
            ],
            [
                "22-08-2019",
                "20-08-2019",
                "275%",
                "Sun Pharmaceutical Industries Ltd has informed BSE that the Board of Directors of the Company at its Meeting held on May 28, 2019, inter alia, has recommended payment of dividend of Rs. 2.75/- (Rupees Two and parse seventy five Only) per equity share of Re. 1/- each of the Company for the year ended March 31, 2019, subject to the approval of the shareholders at the ensuing Annual General Meeting of the Company. The dividend is expected to be paid on or about last week of August, 2019 or first week of September, 2019."
            ],
            [
                "22-08-2019",
                "20-08-2019",
                "275%",
                "Rs.2.7500 per share(275%)Dividend"
            ],
            [
                "19-09-2018",
                "17-09-2018",
                "200%",
                "Rs.2.0000 per share(200%)Dividend"
            ],
            [
                "20-09-2017",
                "18-09-2017",
                "350%",
                "Rs.3.5000 per share(350%)Dividend"
            ],
            [
                "10-09-2016",
                "08-09-2016",
                "100%",
                "Rs.1.0000 per share(100%)Dividend"
            ],
            [
                "24-10-2015",
                "21-10-2015",
                "300%",
                "Rs.3.0000 per share(300%)Dividend"
            ],
            [
                "13-09-2014",
                "11-09-2014",
                "150%",
                "Rs.1.5000 per share(150%)Dividend"
            ],
            [
                "23-09-2013",
                "19-09-2013",
                "250%",
                "Rs.2.5000 per share (250%) Post Bonus Dividend"
            ],
            [
                "16-08-2012",
                "14-08-2012",
                "425%",
                "Rs.4.25 per share(425%)Dividend"
            ],
            [
                "06-09-2011",
                "02-09-2011",
                "350%",
                "Rs.3.50 per share(350%)Dividend"
            ],
            [
                "14-09-2010",
                "09-09-2010",
                "275%",
                "Rs.13.75 per share(275%)Dividend"
            ],
            [
                "25-08-2009",
                "21-08-2009",
                "275%",
                "Rs.13.75 per share(275%)Dividend"
            ],
            [
                "27-08-2008",
                "25-08-2008",
                "210%",
                "210% Dividend"
            ],
            [
                "16-03-2007",
                "15-03-2007",
                "135%",
                "135% Interim Dividend"
            ],
            [
                "08-09-2006",
                "06-09-2006",
                "110%",
                "110% Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "26-11-2010",
                "25-11-2010",
                "1:5"
            ]
        ]
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "30-07-2013",
                "29-07-2013",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "Sun Pharma.Inds. has not announced any rights for the last few years."
    }
}