{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "17-04-2025",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/04/2025 inter alia to consider and approve the financial results for the quarter and year ending March 31 2025 and other matters Please find attached outcome of Board Meeting Recommended final dividend of 2.10 per equity share of face value of 10 each for the financial year 2024-25, subject to approval of the shareholders' at the ensuing Annual General Meeting of the Company. Record date for the purpose of ascertaining the entitlement of the shareholders' for the final dividend shall be Friday, June 20, 2025 Please find enclosed file for further details Please find attached file for further details (As Per BSE Announcement dated on 17.04.2025)"
            ],
            [
                "15-01-2025",
                "Quarterly Results"
            ],
            [
                "15-01-2025",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 15/01/2025 inter alia to consider and approve the financial results for the quarter and nine months ended December 31 2024 Please find attached outcome of the Board Meeting (As per BSE Announcement Dated on 15/01/2025)"
            ],
            [
                "15-10-2024",
                "Quarterly Results"
            ],
            [
                "15-10-2024",
                "Quarterly Results HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 15/10/2024 ,inter alia, to consider and approve the audited standalone and un-audited consolidated financial results for the quarter and half-year ended September 30, 2024. (As Per BSE Announcement Dated on 30-09-2024) Kindly refer the attached file for further details. Please find enclosed outcome of Board Meeting (As per BSE Announcement Dated on 15/10/2024)"
            ],
            [
                "15-07-2024",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 15/07/2024 ,inter alia, to consider and approve financial results for the quarter ended June 30, 2024 and raising of funds by way of NCDs. Please find enclosed outcome of the Board Meeting held on July 15, 2024 (As per BSE Announcement Dated on 15/07/2024)"
            ],
            [
                "18-04-2024",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 18/04/2024 inter alia to consider and approve financial results for the quarter and year ended March 31 2024 HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 18/04/2024 ,inter alia, to consider and approve Update on Board Meeting scheduled to be held on April 18, 2024 (As per BSE Announcement Dated on 15/04/2024) outcome of the Board meeting held on April 18, 2024 1. Financial Results The audited standalone and consolidated financial results for the quarter and year ended March 31, 2024. In terms of Regulation 33 and 52 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (\"SEBI Listing Regulations\"), a copy of the audited financial results together with the reports of the Joint Statutory Auditors thereon is enclosed. Please note that M/s Price Waterhouse Chartered Accountants LLP and M/s G. M. Kapadia & Co., Chartered Accountants, the Joint Statutory Auditors of the Company, have issued audit reports with unmodified opinion on the standalone and consolidated financial statements. 2. Final Dividend Recommended final dividend of ? 2/- per equity share of face value of ?10 each for the financial year 2023-24, subject to approval of the shareholders at the ensuing Annual General Meeting (AGM). Record date for the purpose of ascertaining the entitlement of the shareholders to the final dividend shall be Friday, June 21, 2024. The payment of final dividend will be made on or after July 20, 2024, subject to deduction of tax at source at applicable rate. 3. 24th Annual General Meeting 24th AGM of the Company will be held on Monday, July 15, 2024, through video-conferencing. Other relevant details in this regards would be provided in the AGM notice, which will be issued in due course. 4. Formulation of Employee Stock Option Scheme - 2024 Formulation of Employee Stock Option Scheme viz., `HDFC Life Employee Stock Option Scheme - 2024' with the authority to create and grant from time to time, in one or more tranches, not exceeding 6,10,370 employee stock options exercisable into 6,10,370 equity shares of face value of ? 10 each of the Company, to the eligible employees of the Company in terms of SEBI (Share Based Employee Benefits and Sweat Equity) Regulations, 2021, subject to approval of the shareholders at the ensuing AGM and such other regulatory/ statutory approvals as may be necessary. 5. Alteration of Articles of Association (AOA) of the Company Alteration of AOA, subject to approval of the shareholders in the ensuing AGM, in order to interalia carry out following changes: a) to remove references of erstwhile foreign promoter i.e. Standard Life (Mauritius Holdings) 2006 Limited (presently know as abrdn (Mauritius Holdings) 2006 Limited), pursuant to their reclassification from the promoter to public category in accordance with Regulation 31A of the SEBI Listing Regulations effective from December 13, 2023, on account of sale of their entire stake in the Company; b) to make necessary modifications to incorporate the necessary references to HDFC Bank Limited in place of Housing Development Finance Corporation Limited, erstwhile promoter of the Company; and c) certain other modifications to give effect to the regulatory changes. The Indian Embedded Value (IEV) of the Company has been reviewed by Milliman Advisors LLP, report of the same is enclosed herewith as Annexure. The meeting of the Board commenced at 12:05 p.m. and concluded at 1:55 p.m. (IST) (As Per BSE Announcement Dated on 18.04.2024)"
            ],
            [
                "12-01-2024",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/01/2024 inter alia to consider and approve the audited standalone and un-audited consolidated financial results for the quarter and nine months ended December 31 2023. HDFC LIFE INSURANCE COMPANY LIMITED has informed BSE about Board Meeting to be held on 12 Jan 2024 to consider financial statements for the period ended December 2023. Financial results. Please refer the attached file for the quarterly results Please refer the attached file for further details. (As Per BSE Announcement Dated on 12/01/2024)"
            ],
            [
                "13-10-2023",
                "Quarterly Results"
            ],
            [
                "13-10-2023",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/10/2023 inter alia to consider and approve the audited standalone and consolidated financial results for the quarter and half-year ended September 30 2023 Please find attached Board Meeting Outcome of the Board Meeting held on October 13, 2023 Re-appointment of Ms Bharti Gupta Ramola as an Independent Director Approval of Board for Reclassification of abrdn (Mauritius Holdings) 2006 Ltd. from the \"Promoter\" category to \"Public\" category. (As Per BSE Announcement Dated on 13/10/2023)"
            ],
            [
                "21-07-2023",
                "Quarterly Results"
            ],
            [
                "21-07-2023",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/07/2023 inter alia to consider and approve financial results for the quarter ended June 30 2023."
            ],
            [
                "26-04-2023",
                "Quarterly Results"
            ],
            [
                "26-04-2023",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2023 inter alia to consider and approve the audited standalone and consolidated financial results for the quarter and year ended March 31 2023 Audited Results & Final Dividend (As per BSE Bulletin dated on 21/04/2023) HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2023 ,inter alia, to consider and approve This has reference to our intimation dated March 31, 2023 with regard to the meeting of Board of Directors ('Board) scheduled on Wednesday, April 26, 2023, to consider and approve the audited standalone and consolidated financial results of the Company for the quarter and year ended March 31, 2023. This is to inform that the Board at its above meeting shall also consider the matter pertaining to recommendation of final dividend, if any, for the financial year ending March 31, 2023. (As Per BSE Announcement dated on 21.04.2023) Please find the attach file. (As Per BSE Announcement dated on 26.04.2023)"
            ],
            [
                "20-01-2023",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/01/2023 inter alia to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and nine months ended December 31 2022. Please find attached herewith Board Meeting Outcome dated January 20, 2023 (As Per BSE Announcement dated on 20.01.2023)"
            ],
            [
                "21-10-2022",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/10/2022 inter alia to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and half year ended September 30 2022. Please find attached herewith outcome of Board Meeting held on October 21, 2022 (As per BSE Announcement Dated on 21/10/2022)"
            ],
            [
                "29-07-2022",
                "Preferential Issue of shares & Employees Stock Option Plan inter-alia to consider: i) the matter pertaining to raising of funds by way of issue of equity shares and / or other securities of the Company by way of preferential issue, subject to approvals of shareholders through postal ballot process and regulatory approvals, as may be applicable; and ii) formulation of Employee Stock Option Scheme in terms of SEBI (Share Based Employee Benefits and Sweat Equity) regulations, 2021, subject to approval of shareholders through postal ballot Outcome of Board Meeting held on July 29, 2022 is enclosed (As per BSE Announcement Dated on 29/07/2022)"
            ],
            [
                "19-07-2022",
                "Quarterly Results"
            ],
            [
                "19-07-2022",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/07/2022 inter alia to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter ended June 30 2022. Please find enclosed herewith outcome of the Board Meeting held on July 19, 2022. (As Per BSE Announcement dated on 19.07.2022)"
            ],
            [
                "26-04-2022",
                "Audited Results HDFC Life Insurance Company Ltd has informed BSE that a meeting of the Board of Directors of the Company is scheduled to be held on April 26, 2022, inter alia, to consider the following: 1. To consider and approve the audited standalone and consolidated financial results for the quarter and year ended March 31, 2022, and recommendation of final dividend, if any, to the shareholders for FY 2021-22; 2. To consider raising of funds by way of issuance of Non-Convertible debentures in the nature of subordinated debt as per IRDAI (Other Forms of Capital) Regulations, 2015. These funds are proposed to be raised to further strengthen the cash reserves of the Company post cash payout as part-consideration for acquisition of Exide Life Insurance Company Limited. (As per BSE Announcement Dated on 22/4/2022) This is to inform that Board of Directors of the Company at its meeting held on April 26, 2022 inter alia, recommended final dividend of Rs 1.70/- per equity share of face value ? 10 each for the financial year 2021-22, subject to approval of the Members at the ensuing Annual General Meeting. Please find attached herewith outcome of Board Meeting (As Per BSE Announcement Dated on 26.04.2022) This is to inform that the 22nd AGM of the Company will be held on Monday, June 27, 2022, through video conference. Pursuant to Regulation 42 and other applicable provisions of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, the Record Date for the purpose of ascertaining the entitlement of the shareholders to the final dividend of Rs. 1.70/- per share of face value of Rs. 10/- each for the financial year 2021-22, shall be Wednesday, June 1, 2022. Pursuant to Regulation 42 and other applicable provisions of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, the Record Date for the purpose of ascertaining the entitlement of the shareholders to the final dividend of Rs. 1.70/- per share of face value of Rs. 10/- each for the financial year 2021-22, shall be Wednesday, June 1, 2022. (As per BSE Announcement Dated on 6/5/2022)"
            ],
            [
                "21-01-2022",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/01/2022 inter alia to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and nine months ended December 31 2021. Please find attached outcome of the Board Meeting held on January 21, 2022. (As Per BSE Announcement dated on 21.01.2022)"
            ],
            [
                "22-10-2021",
                "Quarterly Results"
            ],
            [
                "22-10-2021",
                "Quarterly Results Please find attached outcome of the Board Meeting held on October 22, 2021. (As Per BSE Announcement dated on 22.10.2021)"
            ],
            [
                "03-09-2021",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/09/2021 inter alia to consider and approve issue of equity shares and / or other securities of the Company by way of preferential allotment subject to such approvals as may be required under applicable law and to consider convening of a meeting of the shareholders of the Company to obtain approval for such issue if required. Please find attached outcome of the Board Meeting held on September 3, 2021. (As Per BSE Announcement Dated 03.09.2021)"
            ],
            [
                "19-07-2021",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/07/2021 ,inter alia, to consider and approve the audited standalone and un-audited consolidated financial results for the quarter ended June 30, 2021. Please find Board Meeting outcome held on July 19, 2021. (As Per BSE Announcement Dated 19.07.2021)"
            ],
            [
                "26-04-2021",
                "Quarterly Results"
            ],
            [
                "26-04-2021",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2021 ,inter alia, to consider and approve the audited standalone and consolidated financial results of the Company for the quarter and year ended March 31, 2021. HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2021 ,inter alia, to consider and approve In continuation of our letter dated March 31, 2021, regarding intimation of the Board Meeting of the Company to be held on April 26, 2021, for consideration of audited financial results for the quarter and year ended March 31, 2021, we would like to inform you that the Board of Directors of the Company, in its aforesaid meeting, will also consider the matter pertaining to recommendation of final Dividend to the shareholders for FY 2020-21. (AS Per BSE Announcement Dated on 19.04.2021) With reference to the eariler letter dated March 31, 2021, regarding intimation of the Board Meeting of the Company to be held on April 26, 2021, for consideration of audited financial results for the quarter and year ended March 31, 2021, HDFC Life Insurance Company Ltd has now informed BSE that the Board of Directors of the Company, in its aforesaid meeting, will also consider the matter pertaining to recommendation of final Dividend to the shareholders for FY 2020-21. (As Per BSE Announcement Dated 20.04.2021) Please find Board Meeting outcome held on April 26, 2021 HDFC Life Insurance Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on April 26, 2021, inter alia, has recommended final dividend of Rs. 2.02/- per equity share of face value Rs. 10/- each for the financial year 2020-21, subject to approval of the Members at the ensuing Annual General Meeting (\"AGM\") of the Company. The 21st AGM of the Company will be held on Monday, July 19, 2021. The record date for the purpose of final dividend for the financial year 2020-21 is July 1, 2021 (As Per BSE Announcement Dated 26.04.2021)"
            ],
            [
                "22-01-2021",
                "Quarterly Results"
            ],
            [
                "22-01-2021",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/01/2021 ,inter alia, to consider and approve the audited standalone financial results and un-audited consolidated financial results of the Company for the quarter and nine-month ended December 31, 2020. Please find enclosed outcome of the Board Meeting held on January 22, 2021. (As Per BSE Announcement dated on 22.01.2021)"
            ],
            [
                "19-10-2020",
                "Quarterly Results"
            ],
            [
                "19-10-2020",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/10/2020 ,inter alia, to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and half year ended September 30, 2020. Please find enclosed outcome of the Board Meeting held on October 19, 2020. (As Per BSE Announcement Dated on 19.10.2020)"
            ],
            [
                "21-07-2020",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/07/2020 ,inter alia, to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter ended June 30, 2020. Window for trading in the equity shares of the Company shall remain closed from July 1, 2020 up to July 23, 2020 (both days inclusive) for all the Designated Persons including their Immediate Relatives and Promoters of the Company, etc. in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015 and the Company''s Code of Conduct for Prevention of Insider Trading. Pursuant to Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform that the Board of Directors of the Company at their meeting held today i.e. July 21, 2020, have approved the Audited Standalone and Un-audited Consolidated financial results for the quarter ended June 30, 2020. In this regard, please find enclosed herewith the following:- (i) Copy of Audited Standalone financial results along with auditors report (ii) Copy of Un-audited Consolidated financial results with limited review report (iii) Note on Impact of COVID-19 (iv) Press Release. (As Per BSE Announcement Dated 21.07.2020)"
            ],
            [
                "27-04-2020",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/04/2020 ,inter alia, to consider and approve 1) the audited standalone and consolidated financial results for the quarter and year ended March 31, 2020 2) To consider raising of funds by way of issuance of Non-Convertible Debentures in the nature of subordinated debt as per IRDAI (Other Forms of Capital) Regulations, 2015 Pursuant to Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors of the Company at their meeting held today i.e. April 27, 2020 have approved the following :- 1) Financial Results and 2) In principle approval for raising of funds by issuance of Non-Convertible Debentures (NCDs) (As Per BSE Announcement Dated on 27.04.2020) Inter alia, approved the following: 1. In principle approval for raising of funds by issuance of Non-Convertible Debentures (NCDs) Raising of funds through issuance of NCDs in the nature of Subordinated debt instrument up to Rs. 600 Crore (Rupees Six Hundred Crore only) in one or more tranches, on private placement basis subject to receipt of all the Regulatory approvals. The Company has taken cognizance of IRDAI Circular No. IRDA/F&A/CIR/MISC/099/04/2020 dated April 24, 2020, urging the Insurers to take conscious call to refrain from dividend pay-outs from profits pertaining to financial year ending March 31, 2020. (As Per BSE Bulletin Dated on 27.04.2020)"
            ],
            [
                "23-01-2020",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/01/2020 ,inter alia, to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and nine months ended December 31, 2019. The window for trading in the equity shares of the Company shall remain closed from January 01, 2020 to January 25, 2020 (both days inclusive) for all the Designated Persons (viz., Directors, Identified Employees, KMPs) including their immediate relatives and Promoters of the Company, etc. in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015 and the Company's Code of Conduct for Prevention of Insider Trading. This is to inform you that the Board of Directors of the Company at their meeting held today i.e. January 23, 2020, have approved the Audited Standalone and Un-Audited Consolidated Financial results of the Company for quarter and nine months ended December 31, 2019. (As Per BSE Announcement Dated on 23/01/2020)"
            ],
            [
                "23-10-2019",
                "Quarterly Results"
            ],
            [
                "23-10-2019",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2019 ,inter alia, to consider and approve the audited standalone financial results and un-audited consolidated financial results for the quarter and half year ended September 30, 2019. The window for trading in the equity shares of the Company shall remain closed from October 01, 2019 to October 25, 2019 (both days inclusive) for all the Designated Persons of the Company, immediate relatives, etc in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015. This is to inform you that the Board of Directors of the Company at their meeting held today i.e. October 23, 2019, have approved the Audited Standalone and Un-Audited Consolidated Financial results of the Company for quarter and half year ended September 30, 2019 including other matters as per attached file. (As Per BSE Announcement Dated on 23/10/2019)"
            ],
            [
                "23-07-2019",
                "HDFC Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/07/2019 ,inter alia, to consider and approve Audited standalone financial results and un-audited consolidated financial results for the quarter ended June 30, 2019. The window for trading in the equity shares of the Company shall remain closed from June 29, 2019 to July 25, 2019 (both days inclusive) for all the employees, Directors of the Company, immediate relatives, etc in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015."
            ],
            [
                "26-04-2019",
                "Audited Results"
            ],
            [
                "07-03-2019",
                "Interim Dividend"
            ],
            [
                "22-01-2019",
                "HDFC Standard Life Insurance Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/01/2019 ,inter alia, to consider and approve HDFC Standard Life Insurance Company Limited informs that the meeting of Board of Directors is scheduled to be held on Tuesday, January 22, 2019 inter-alia to consider and approve the audited standalone financial results of the Company for the quarter and nine months ended December 31, 2018."
            ],
            [
                "30-09-2018",
                "HDFC STANDARD LIFE INSURANCE COMPANY LTDhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2018 ,inter alia, to consider and approve Standalone Financial Results for half-year ended September 30, 2018."
            ],
            [
                "23-10-2018",
                "Quarterly Results"
            ],
            [
                "20-07-2018",
                "We wish to inform you that a meeting of the Board of Directors of HDFC Standard Life Insurance Company Limited ('the Company') is scheduled to be held on Friday, July 20, 2018 inter-alia to consider and approve the audited standalone financial results of the Company for the quarter ended June 30, 2018. The outcome of board meeting and said results along with audit reports issued by the Statutory Auditors will be submitted to you, in accordance with the Listing Regulations. We also wish to inform that the window for trading in the equity shares of the Company shall remain closed from July 1, 2018 to July 22, 2018 (both days inclusive) for all the employees, directors of the Company, immediate relatives, etc in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015."
            ],
            [
                "18-04-2018",
                "HDFC Standard Life Insurance Company Limited has informed the Exchange regarding updates on Board Meeting held on April 18, 2018."
            ],
            [
                "18-04-2018",
                "Audited Results"
            ],
            [
                "19-01-2018",
                "We wish to inform you that a meeting of the Board of Directors of HDFC Standard Life Insurance Company Limited ('the Company') is scheduled to be held on Friday, January 19, 2018 inter-alia, to consider and approve the audited financial results (standalone) of the Company for the quarter / nine months ending December 31, 2017. The outcome of board meeting and the said results along with audit reports issued by the Statutory Auditors will be submitted to you, in accordance with the Listing Regulations. We also wish to inform that the window for trading in the equity shares of the Company shall remain closed from January 1, 2018 to January 21, 2018 (both days inclusive) for all the employees, directors of the Company, immediate relatives, etc in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015."
            ],
            [
                "08-12-2017",
                "Interim Dividend"
            ],
            [
                "08-12-2017",
                "We wish to inform you that a meeting of the Board of Directors of HDFC Standard Life Insurance Company Limited ('the Company') is scheduled to be held on Friday, December 8, 2017 to consider declaration of interim dividend for the financial year 2017-18, if any. The Record Date of December 18, 2017 has been fixed for the purpose of entitlement of the shareholders to the interim dividend for the financial year 2017-18, if any declared by the Board of Directors of the Company. We also wish to inform that the window for trading in the equity shares of the Company shall remain closed from December 1, 2017 to December 10, 2017 (both days inclusive) for all the employees and directors of the Company and their immediate relatives, in terms of the SEBI (Prohibition of Insider Trading) Regulations, 2015. We request you to kindly take the same on record and arrange to bring this to the notice of all concerned."
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "20-06-2025",
                "20-06-2025",
                "21%",
                "Please find attached outcome of Board Meeting Recommended final dividend of 2.10 per equity share of face value of 10 each for the financial year 2024-25, subject to approval of the shareholders' at the ensuing Annual General Meeting of the Company. Record date for the purpose of ascertaining the entitlement of the shareholders' for the final dividend shall be Friday, June 20, 2025."
            ],
            [
                "21-06-2024",
                "21-06-2024",
                "20%",
                "outcome of the Board meeting held on April 18, 2024 Final Dividend Recommended final dividend of ? 2/- per equity share of face value of ?10 each for the financial year 2023-24, subject to approval of the shareholders at the ensuing Annual General Meeting (AGM). Record date for the purpose of ascertaining the entitlement of the shareholders to the final dividend shall be Friday, June 21, 2024. The payment of final dividend will be made on or after July 20, 2024, subject to deduction of tax at source at applicable rate."
            ],
            [
                "16-06-2023",
                "16-06-2023",
                "19%",
                "Please find the attach file We wish to inform that the Board of Directors of the Company (\"Board\") at their meeting held today i.e. Wednesday, April 26, 2023, has inter-alia approved the following: 1) Final Dividend Recommended final dividend of Rs.1.90/- per equity share of face value Rs.10 each for the financial year 2022-23, subject to the approval of the Shareholders at the ensuing Annual General Meeting (AGM). Record Date for the purpose of ascertaining the entitlement of the shareholders to the final dividend of Rs. 1.90/- per share of face value of Rs. 10/- each for FY 2022-23, shall be Friday, June 16, 2023. (As per BSE Announcement Dated on 08/05/2023)"
            ],
            [
                "01-06-2022",
                "31-05-2022",
                "17%",
                "This is to inform that Board of Directors of the Company at its meeting held on April 26, 2022 inter alia, recommended final dividend of Rs 1.70/- per equity share of face value ? 10 each for the financial year 2021-22, subject to approval of the Members at the ensuing Annual General Meeting."
            ],
            [
                "01-07-2021",
                "30-06-2021",
                "20%",
                "HDFC Life Insurance Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on April 26, 2021, inter alia, has recommended final dividend of Rs. 2.02/- per equity share of face value Rs. 10/- each for the financial year 2020-21, subject to approval of the Members at the ensuing Annual General Meeting (\"AGM\") of the Company."
            ],
            [
                "15-03-2019",
                "14-03-2019",
                "16%",
                "Interim Dividend"
            ],
            [
                "18-12-2017",
                "15-12-2017",
                "13%",
                "Interim Dividend"
            ]
        ]
    },
    "splits": {
        "title": "Split",
        "msg": "HDFC Life Insur. has not announced any stock split for the last few years."
    },
    "bonus": {
        "title": "Bonus",
        "msg": "HDFC Life Insur. has not announced any bonus for the last few years."
    },
    "rights": {
        "title": "Rights",
        "msg": "HDFC Life Insur. has not announced any rights for the last few years."
    }
}