[
    {
        "title": "Announcement under Regulation 30 (LODR)-Change in Management 1 Jun - Appointment of Mr. Prabhakaran Balakrishnan Nair as Global Chief Manufacturing Officer from July 1, 2025.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=88c27250-1ee8-416c-8fa5-f2480e921d60.pdf",
        "date": "1 Jun - Appointment of Mr. Prabhakaran Balakrishnan Nair as Global Chief Manufacturing Officer from July 1, 2025."
    },
    {
        "title": "USFDA Inspection At Company'S Manufacturing Facility In Bommasandra, Bengaluru, India 30 May - USFDA inspection at Bommasandra facility resulted in one Form 483 observation, company to address it.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=28f3447f-db09-416e-8b61-656ca88efb82.pdf",
        "date": "30 May - USFDA inspection at Bommasandra facility resulted in one Form 483 observation, company to address it."
    },
    {
        "title": "Compliances-Reg.24(A)-Annual Secretarial Compliance 29 May - Cipla's FY25 Annual Secretarial Compliance Report confirms full regulatory compliance, no violations.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=cafc2c0d-a410-41c9-8a6e-6e92002df16c.pdf",
        "date": "29 May - Cipla's FY25 Annual Secretarial Compliance Report confirms full regulatory compliance, no violations."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Updates on Acquisition 29 May - Cipla subsidiary acquired 26% stake in AMPIN Energy C&I Eighteen Pvt Ltd on 28 May 2025.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=242091fd-39c3-4550-88f4-077fa98bf09e.pdf",
        "date": "29 May - Cipla subsidiary acquired 26% stake in AMPIN Energy C&I Eighteen Pvt Ltd on 28 May 2025."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Acquisition 29 May - Cipla forms CiplaRna GmbH in Germany for mRNA drug development, wholly owned by Cipla (EU) Ltd.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=1a5f148e-b55d-43b9-bd79-d7c086a5520c.pdf",
        "date": "29 May - Cipla forms CiplaRna GmbH in Germany for mRNA drug development, wholly owned by Cipla (EU) Ltd."
    }
]