{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "24-04-2025",
                "Quarterly Results"
            ],
            [
                "24-04-2025",
                "Nestle India Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/04/2025 inter alia to consider and approve Schedule for consideration of Financial Results (Standalone and Consolidated) of the Company by the Board of Directors during the financial year 2025-26 and Trading Window Closure Periods during the financial year 2025-26 Outcome of Board Meeting Recommended final dividend of Rs. 10/- (Rupees ten only) per equity share of the face value of Re. 1/- (Rupee one only) each for the financial year 2024-25 on the entire issued, subscribed and paid-up share capital of the Company of 964,157,160 equity shares of face value of Re. 1/- (Rupee one only) each. (As Per BSE Announcement dated on 24.04.2025)"
            ],
            [
                "31-01-2025",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2025 inter alia to consider and approve Consideration of unaudited financial results (standalone and consolidated) for the third quarter and nine months ending 31st December 2024 and closure of trading window from 1st January 2025 to 2nd February 2025 (both days inclusive). NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2025 ,inter alia, to consider and approve Update on board meeting: Further to our letter dated PKR:SG:JK: 100:24 dated 20th December 2024, intimating that the unaudited financial results (standalone and consolidated) of the Company for the third quarter and nine months ended 31st December 2024 shall be considered by the Board of Directors of the Company at its meeting scheduled on Friday, 31st January 2025. At the said Meeting, the Board of Directors will also consider declaration of second interim dividend for the Financial Year 2024-25, if any. (As Per BSE Announcement dated on 24.01.2025) Unaudited Financial Results (Standalone and Consolidated) for the third quarter and nine months ended 31st December 2024; and Second Interim Dividend for the Financial Year 2024-25 (As Per BSE Announcement dated on 31.01.2025)"
            ],
            [
                "17-10-2024",
                "Quarterly Results"
            ],
            [
                "17-10-2024",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/10/2024 inter alia to consider and approve Further to our letter dated PKR:SG: 88:23 dated 19th December 2023 the unaudited financial results of the Company for the second quarter and half year ending 30th September 2024 shall be considered by the Board of Directors of the Company at its meeting scheduled to be held on Thursday 17th October 2024. In view of the above event the Trading Window in respect of the equity shares of the Company shall remain closed from 1st October 2024 to 19th October 2024 (both days inclusive). Outcome of Board Meeting (As per BSE Announcement Dated on 17/10/2024)"
            ],
            [
                "08-07-2024",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/07/2024 inter alia to consider and approve This is to inform you that declaration of an interim dividend for the Financial Year 2024-25 if any shall be considered by the Board of Directors of the Company at its meeting proposed to be held on Monday 8th July 2024. Please note that the Record Date of 16th July 2024 fixed for the purpose of final dividend for the fifteen months financial year ended 31st March 2024 as intimated vide our letter PKR:SG: 58:24 dated 12th June 2024 shall also determine the entitlement of members to the interim dividend for the Financial Year 2024-25 that may be declared by the Board of Directors on 8th July 2024. Intimation of the Record Date in this regard is enclosed with this letter. Interim dividend for the Financial Year 2024-25 in case declared shall be paid on and from 6th August 2024 along with the final dividend for the fifteen months financial year ended 31st March 2024 if approved by the shareholders at the 65th Annual General Meeting scheduled to be held on 8th July 2024. This is to inform you that the Board of Directors at its meeting held today declared an Interim Dividend of Rs. 2.75/- (Rupees two and paisa seventy-five only) per equity share of face value of Re. 1/- (Rupee one only) each for the financial year 2024-25 on the entire issued, subscribed and paid-up share capital of the Company comprises of 96,41,57,160 equity shares of the nominal value of Re. 1/- (Rupee one only) each. (As Per BSE Announcement PDF Dated on 08.07.2024)"
            ],
            [
                "25-07-2024",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2024 inter alia to consider and approve Further to our letter PKR:SG: 88:23 dated 19th December 2023 the un-audited financial results of the Company for the first quarter ending 30th June 2024 shall be considered by the Board of Directors of the Company at its meeting proposed to be held on Thursday 25th July 2024. Unaudited Financial Results for the quarter ended 30.06.2024 Unaudited Financial Results for the first quarter ended 30th June 2024 (As per BSE Announcement Dated on 25/07/2024)"
            ],
            [
                "12-06-2024",
                "1. Approved appointment of Mr Sidharth Kumar Birla (DIN: 00004213) as an Additional Director and Independent Non-Executive Director of the Company and recommended to the members of the Company for their approval. 2. Approved continuation of payment of general licence fees (royalty) at the existing rate of 4.5% to Société des Produits Nestlé S.A. ('Licensor') and recommended to the members of the Company for their approval. 3. Revised date of the 65th AGM to Monday, 8th July 2024 through VC/ OAVM."
            ],
            [
                "05-04-2024",
                "a. Approved appointment of Ms Suneeta Reddy (DIN: 00001873) as an Additional Director and Independent Non-Executive Director of the Company for a term of five consecutive years with effect from 5th April 2024, and recommended to the Members of the Company for their approval; b. Approved payment of general licence fees (royalty) by the Company to Société des Produits Nestlé S.A. (Licensor), and recommended to the Members of the Company for their approval"
            ],
            [
                "25-04-2024",
                "Quarterly Results"
            ],
            [
                "25-04-2024",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/04/2024 inter alia to consider and approve Further to our letter dated PKR:SG: 88:23 dated 19th December 2023 the audited financial results of the Company for the three months period from 1st January 2024 to 31st March 2024 (fifth quarter) and extended financial year ending 31st March 2024 [covering a period of 15 months (comprising five quarters) commencing from 1st January 2023 to 31st March 2024] shall be considered by the Board of Directors of the Company at their meeting scheduled on Thursday 25th April 2024 and the Trading Window in respect of the equity shares of the Company shall remain closed from 1st April 2024 to 27th April 2024 (both days inclusive) in view of the above event. NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/04/2024 ,inter alia, to consider and approve Update on board meeting scheduled on 25th April 2024 - Board of Directors to also consider recommendation of final dividend for the financial year 2023-24, if any, for the approval of the members at the ensuing Annual General Meeting (As Per BSE Announcement Dated on 11/04/2024) Outcome of Board Meeting 1. Audited Financial Results for the fifteen months financial year ended 31st March 2024: 2. Recommended Final Dividend of Rs. 8.50/- (Eight Rupees and Fifty Paisa only) per equity shares of Re. 1/- each for the fifteen months financial year ended 31st March 2024 on the entire issued, subscribed and paid-up share capital of the Company of 964,157,160 equity shares of nominal value of Re. 1/- (Rupee one only) each. 3. Approved execution of a definitive agreement to form a joint venture between the Company and Dr. Reddy's Laboratories Limited (\"Dr. Reddy's\") to bring together the well-known global range of nutritional health solutions as well as vitamins, minerals and health supplements of Nestlé Health Science with the nutraceuticals portfolios, strong and established commercial strengths of Dr. Reddy's in India and other geographies as may be agreed by the Parties. The joint venture is expected to become operational in the second quarter of the financial year 2024-25, subject to customary closing conditions. 4. Approved launch of Nespresso in India wherein the Company will engage in the sale and distribution of Nespresso products (machines and capsules) through its distribution network, online channels, and boutiques under commercial arrangements with Nespresso and third parties. The Company expects to launch Nespresso in India by the end of 2024. Enclosed is the Press Release relating to the results and other business items as mentioned above. 5. Approved convening of the 65 th AGM of the Company on Friday, 5th July 2024 through Video Conferencing/ Other Audio-Visual Means (VC/ OAVM) and fixed Monday, 15 th July 2024 as Record Date for the purpose of determining entitlement of the Members to the Final Dividend for the fifteen months financial year ended 31st March 2024. The Final Dividend for the fifteen months financial year ended 31st March 2024, if approved by the Members at 65 th AGM, shall be paid on and from 2nd August 2024. Enclosed is the intimation of the Record Date. Soft copy of the Annual Report and Notice of the 65 th AGM shall be sent in due course. The same shall also be uploaded on the Company's website at www.nestle.in. (As Per BSE Announcement Dated on 25.04.2024)"
            ],
            [
                "07-02-2024",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2024 inter alia to consider and approve Schedule for consideration of the Financial Results of the Company by the Board of Directors during 2024 and corresponding Trading Window Closure Period. Please refer our communication no. PKR:SG: 49:23 dated 27th July 2023 intimating that the Board of Directors at its meeting held on 27th July 2023 approved change in the Financial Year of the Company from 1st January - 31st December to 1st April - 31st March and accordingly extended the current Financial Year of the Company upto 31st March 2024 covering a period of 15 months (comprising five quarters) commencing from 1st January 2023 to 31st March 2024. All subsequent Financial Years of the Company would begin from 1st April every year and end with 31st March of the following year. Declaration of Third Interim Dividend of Rs. 7/- per Equity Share of the face value of Re. 1/- each for the Financial Year 2023-24 1. Unaudited Financial Results for the fourth quarter and tweleve months ended 31st December 2023; 2. declaration of third interim dividend for the Financial Year 2023-24; and 3. sale of Nestle Business Services Division of the Company to a related party. I. Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('Listing Regulations'): Unaudited Financial Results for the fourth quarter and twelve months ended 31st December 2023; II. Regulation 30 read with Schedule-III to the Listing Regulations: a. declaration of Third Interim Dividend for the Financial Year 2023-24; and b. sale of Nestlé Business Services ('NBS') Division of the Company to a related party. (As Per BSE Announcement Dated on 07.02.2024)"
            ],
            [
                "19-10-2023",
                "Quarterly Results"
            ],
            [
                "19-10-2023",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/10/2023 inter alia to consider and approve Further to our letter dated PKR:GA:54:22 dated 22nd December 2022 the un-audited financial results of the Company for the third quarter and nine months ending 30th September 2023 shall be considered by the Board of Directors of the Company at their meeting scheduled on Thursday 19th October 2023 and the Trading Window in respect of the equity shares of the Company shall remain closed from 1st October 2023 to 21st October 2023 (both days inclusive) in view of the above event. Declaration of Second Interim Dividend of 2023 Sub-division/split of existing equity shares of face value 10/- each (Rs. Ten only) fully paid up, by alteration of capital clause of the MOA of the Company Unaudited Financial Results for the quarter ended 30th September 2023 Sub-division/split of existing equity shares of face value 10/- each, fully paid up by alteration of the Capital Clause of MOA of the Compnay Record Date for Second Interim Dividend is 1st November 2023 Outcome of the Board Meeting of Q3 results, dividend and split of shares (As Per BSE Announcement Dated on 19/10/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "27-07-2023",
                "Quarterly Results"
            ],
            [
                "27-07-2023",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/07/2023 inter alia to consider and approve Further to our letter PKR:GA:54:22 dated 22nd December 2022 the un-audited financial results of the Company for the second quarter and half year ending 30th June 2023 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Thursday 27th July 2023 and the Trading Window in respect of the equity shares of the Company shall remain closed from 1st July 2023 to 29th July 2023 (both days inclusive) in view of the above event. 1. Unaudited Financial Results for the second quarter and half year ended 30th June 2023; 2. Intimation to change the Financial Year of the Company to the Fiscal Year i.e., April to March cycle. The meeting of the Board of Directors commenced at 09:00 hours and the above agenda items concluded at 10:20 hours. Unaudited Financial Results for the second quarter and half year ended 30.06.2023 Regulation 30: Intimation to change the Financial Year of the Company to the Fiscal Year i.e. April to March cycle, subject to approvals (As Per BSE Announcement Dated on 27.07.2023)"
            ],
            [
                "25-04-2023",
                "Quarterly Results"
            ],
            [
                "25-04-2023",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/04/2023 inter alia to consider and approve Meeting of the Board of Directors of the Company is scheduled on 25/04/2023 inter alia to consider and approve un-audited financial results for the first quarter ending 31st March 2023 Outcome of the Board Meeting: I. Regulation 33 of Listing Regulations: Unaudited Financial Results for the first quarter ended 31st March 2023 II. Mr. Matthias Christoph Lohner, Executive Director - Technical (DIN: 08934420) to demit office with effect from the close of business hours on 30th June 2023; Nomination of Mr. Satish Srinivasan in place of Mr. Matthias Christoph Lohner w.e.f. 1st July 2023, subject to approvals Outcome of the Board Meeting: I. Regulation 33 of Listing Regulations: Unaudited Financial Results for the first quarter ended 31st March 2023 II. Mr. Matthias Christoph Lohner, Executive Director - Technical (DIN: 08934420) to demit office with effect from the close of business hours on 30th June 2023; Nomination of Mr. Satish Srinivasan in place of Mr. Matthias Christoph Lohner w.e.f. 1st July 2023, subject to approvals (As Per BSE Announcement Dated on 25.04.2023)"
            ],
            [
                "12-04-2023",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/04/2023 inter alia to consider and approve This is to inform you that declaration of an interim dividend for the year 2023 if any shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Wednesday 12th April 2023. Please note that the Record Date of 21st April 2023 fixed for the purpose of final dividend for the year 2022 as intimated vide our letter PKR:GA:10:23 dated 16th February 2023 shall also determine the entitlement of the members to an interim dividend for the year 2023 that may be declared by the Board of Directors on 12th April 2023. Intimation of the Record Date in this regard is enclosed with this letter. Interim dividend for the year 2023 in case declared shall be paid on and from 8th May 2023 along with the final dividend for the year 2022 if approved by the members at the 64th Annual General Meeting scheduled to be held on 12th April 2023. Record Date - 21st April 2023 for determining the entitlement of an interim dividend for the year 2023, if any, and date of payment of interim dividend for the year 2023, if any, on and from 8th May 2023. This is to inform you that declaration of an interim dividend for the year 2023, if any, shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Wednesday, 12th April 2023. Please note that the Record Date of 21st April 2023 fixed for the purpose of final dividend for the year 2022, as intimated vide our letter PKR:GA:10:23 dated 16th February 2023, shall also determine the entitlement of the members to an interim dividend for the year 2023 that may be declared by the Board of Directors on 12th April 2023. Intimation of the Record Date in this regard is enclosed with this letter. Interim dividend for the year 2023, in case declared, shall be paid on and from 8th May 2023 along with the final dividend for the year 2022, if approved by the members at the 64th Annual General Meeting scheduled to be held on 12th April 2023. This is to inform you that the Board of Directors at their meeting held today declared an Interim Dividend of Rs. 27/- (Rupees Twenty-Seven Only) per equity share of Rs. 10/- each for the year 2023 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Interim Dividend for the year 2023 will be paid on and from 8th May 2023 along-with the final dividend for the year 2022, if approved by the members at the 64th Annual General Meeting scheduled to be held on 12th April 2023, to those members whose names appear in the Register of Members of the Company and as beneficial owner in the records of the depository, as on the Record Date fixed for the aforesaid purpose i.e. 21st April 2023, as intimated vide our letter PKR:GA:22:23 dated 27th March 2023. This is to inform you that the Board of Directors at their meeting held today declared an Interim Dividend of Rs. 27/- (Rupees Twenty-Seven Only) per equity share of Rs. 10/- each for the year 2023 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Interim Dividend for the year 2023 will be paid on and from 8th May 2023 along-with the final dividend for the year 2022, if approved by the members at the 64th Annual General Meeting scheduled to be held on 12th April 2023, to those members whose names appear in the Register of Members of the Company and as beneficial owner in the records of the depository, as on the Record Date fixed for the aforesaid purpose i.e. 21st April 2023, as intimated vide our letter PKR:GA:22:23 dated 27th March 2023. (As Per BSE Announcement Dated on 12.04.2023)"
            ],
            [
                "16-02-2023",
                "Quarterly Results"
            ],
            [
                "16-02-2023",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 16/02/2023 inter alia to consider and approve Schedule for consideration of the Financial Results of the Company by the Board of Directors during the year 2023 and corresponding Trading Window Closure Period. NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 16/02/2023 ,inter alia, to consider and approve Further to our earlier letters no. PKR:GA:54:22 and PKR:GA:06:23 dated 22nd December 2022 and 28th January 2023, respectively; intimating that the audited financial results of the Company for the year 2022 shall be considered by the Board of Directors of the Company at their meeting scheduled on 16th February 2023, this is to inform you that at its meeting to be held on that date, the Board of Directors would also consider recommendation of final dividend for the year 2022, if any, for the approval of the shareholders at the ensuing Annual General Meeting. (As per BSE Announcement Dated on 08/02/2023)"
            ],
            [
                "19-10-2022",
                "Quarterly Results"
            ],
            [
                "19-10-2022",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/10/2022 inter alia to consider and approve This is to inform that the un-audited financial results of the Company for the third quarter and nine months ending 30th September 2022 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Wednesday 19th October 2022. In view of the above the Trading Window in respect of the equity shares of the Company shall remain closed from 1st October 2022 to 21st October 2022 (both days inclusive). Record Date for determining entitlement of the members to the second interim dividend for the year 2022, if any. (As Per BSE Announcement Dated on 10-10-2022) The Board of Directors, at their meeting held today, declared Second Interim Dividend of Rs. 120/- (Rupees One Hundred Twenty Only) per equity share of Rs. 10/- each for the year 2022 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Second Interim Dividend for the year 2022 will be paid on and from 16th November 2022 to those Members whose names appear in the Register of Members of the Company and as beneficial owners in the Depositories, as on the Record Date fixed for the purpose i.e., 1st November 2022, as intimated vide our letter PKR:GA 48:22 and 49:22 dated 10th October 2022. 1. Unaudited Financial Results for the third quarter and nine months ended 30th September 2022 2. Declaration of Second Interim Dividend for the year 2022 (As Per BSE Announcement Dated on 19.10.2022)"
            ],
            [
                "28-07-2022",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/07/2022 inter alia to consider and approve This is to inform that the un-audited financial results of the Company for the quarter and half year ending 30th June 2022 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Thursday 28th July 2022. In view of the above the Trading Window in respect of the equity shares of the Company shall remain closed from 1st July 2022 to 30th July 2022 (both days inclusive). This is for your information and further dissemination. 1. Unaudited Financial Results for the second quarter and half year ended 30th June 2022 1. Unaudited Financial Results for the second quarter and half year ended 30th June 2022 2. Acquisition of Pet Foods Business from Purina PetCare India Private Limited including the valuation and the date of transfer 3. Change in the Company Secretary & Compliance Officer of the Company effective from 1st October 2022. The meeting of the Board of Directors commenced at 9:00 hours and the above agenda items concluded at 10:30 hours. Please take the same on record. Change in the Company Secretary & Compliance Officer of the Company effective from 1st October 2022. The Board of Directors, at their meeting held today noted that Mr. B. Murli, Company Secretary & Compliance Officer of the Company, would be retiring on 30th September 2022 (close of business hours). On the recommendation of the Nomination and Remuneration Committee, the Board of Directors approved the appointment of Mr. Pramod Kumar Rai (FCS 4676) as the Company Secretary and Compliance Officer (Key Managerial Personnel) of the Company effective from 1st October 2022. Acquisition of Pet Foods Business from Purina PetCare India Private Limited including the valuation and the date of transfer The Board of Directors, at their meeting held today based on the approval of the Audit Committee, approved acquisition of Pet Foods Business from Purina PetCare India Private Limited through business transfer, proposed with effect from 1st October 2022. Only the Independent Directors voted on the agenda item with the Executive Directors recusing themselves. We enclose the details as required under Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements), 2015 read with SEBI Circular No. CIR/CFD/CMD/4/2015 dated 9th September 2015. (As Per BSE Announcement dated on 28.07.2022)"
            ],
            [
                "21-04-2022",
                "Quarterly Results"
            ],
            [
                "21-04-2022",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/04/2022 inter alia to consider and approve un-audited financial results for the first quarter ending 31st March 2022 As annexed The Board of Directors, at their meeting held today on the recommendation of the Nomination and Remuneration Committee, has recommended the appointment of Ms Alpana Parida (DIN: 06796621), as an Independent Non-Executive Director of the Company for a term of five consecutive years effective from 1st June 2022, for approval of the members of the Company by way of Special Resolution through Postal Ballot by electronic means. In terms of the Companies Act, 2013 read with relevant Circulars issued by the Ministry of Corporate Affairs and Regulation 44 of the Listing Regulations, the Company shall provide remote e-voting facility for the said purpose. The cut-off date of 22nd April 2022 has been fixed to determine the eligibility of the Members to cast their vote through Postal Ballot by remote e-voting facility. (As Per BSE Announcement dated on 21.04.2022)"
            ],
            [
                "11-04-2022",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 11/04/2022 inter alia to consider and approve Intimation regarding declaration of an interim dividend for the year 2022 if any on 11th April 2022 This is to inform you that the Board of Directors at their meeting held today declared an Interim Dividend of Rs. 25/- (Rupees twenty-five only) per equity share of Rs. 10/- each for the year 2022 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Interim Dividend for the year 2022 will be paid on and from 6th May 2022 alongwith the final dividend for 2021, if approved by the shareholders at the 63rd Annual General Meeting scheduled to be held on 12th April 2022, to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, as on the Record Date fixed for the purpose i.e., 22nd April 2022, as intimated vide our letter BM:PKR:17:22 dated 31st March 2022. The meeting of the Board of Directors commenced at 15:30 hours and the meeting concluded at 15:55 hours. (As Per BSE Announcement Dated on 11.04.2022)"
            ],
            [
                "17-02-2022",
                "Quarterly Results"
            ],
            [
                "17-02-2022",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/02/2022 inter alia to consider and approve the audited financial results of the Company for the year ending 31st December 2021 shall be considered by the Board of Directors of the Company at its meeting scheduled to be held on 17th February 2022. Further to earlier letter no. BM:PKR:45:21 dated 29th December 2021 intimating that the audited financial results of the Company for the year 2021 shall be considered by the Board of Directors of the Company at their meeting proposed on 17th February 2022, this is to inform you that at its meeting to be held on that date, the Board of Directors would also consider recommendation of final dividend for the year 2021, if any, for the approval of the shareholders at the ensuing Annual General Meeting. As intimated under letter dated 29th December 2021, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st January 2022 to 19th February 2022 (both days inclusive). (As Per BSE Announcement Dated on 07-02-2022) Regulation 33 of Listing Regulations : Audited Annual Financial Results for the year 2021 Regulation 30 of Listing Regulations : a) Recommended Final Dividend for the year 2021; b) Recommended to the members for appointment of Ms Anjali Bansal as an Independent Non-Executive Director for a term of five consecutive years effective 1st May 2022; c) Noted retirement of Ms Rama Bijapurkar as an Independent Non-Executive Director on completion of her term on 30th April 2022; and d) 63rd Annual General Meeting on Wednesday, 30th March 2022 through Video Conferencing / Other Audio-Visual Means (VC/OAVM). Regulation 42 of Listing Regulations : 63rd Annual General Meeting ('63rd AGM') and Record Date. The Board of Directors at their meeting held today recommended final dividend for the year 2021 of Rs. 65/- (Rupees Sixty Five only) per equity shares of Rs. 10/- each. (As Per BSE Announcement Dated 17.02.2022)"
            ],
            [
                "11-11-2021",
                "In term of Regulation 30 read with Schedule III to the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 and SEBI Circular CIR/CFD/CMD/4/2015 dated September 09, 2015 - Nestle India Limited has intimated about the appointment of M/s S.R. Batliboi & Co. LLP, Chartered Accountants, as Statutory Auditor for a term of five years from the conclusion of 63rd AGM to be held in 2022"
            ],
            [
                "19-10-2021",
                "Quarterly Results"
            ],
            [
                "19-10-2021",
                "Quarterly Results NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/10/2021 ,inter alia, to consider and approve Further to our letter BM:PKR:33:21 dated 30th September 2021 intimating consideration of unaudited financial results of the Company for the third quarter and nine months ended 30th September 2021 by the Board of Directors of the Company on Tuesday, 19th October 2021, the Board of Directors shall also consider declaration of second interim dividend for the year 2021, if any, on 19th October 2021. The Record Date of 27th October 2021 has been fixed for the purpose of entitlement of the shareholders to the second interim dividend for the year 2021, if any, to be declared by the Board of Directors of the Company. This is to inform that the second interim dividend for the year 2021, if any declared, would be paid on and from 16th November 2021. (As Per BSE Announcement Dated on 07.10.2021) Nestle Indian Limited has intimated that the Board of Directors at their meeting held today declared Second Interim Dividend of Rs. 110/- (Rupees One Hundred Ten only) per equity share of Rs. 10/- each for the year 2021 on the entire issued subscribed and paid up share capital of the Company of 96415716 equity shares of the nominal value of Rs. 10/- each. The Second Interim Dividend for the year 2021 will be paid on and from 16th November 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories determined with reference to the Record Date of 27th October 2021 already announced for the purpose vide letter no. BM: PKR: 35:21 dated 7th October 2021. (As Per BSE Announcement Dated on 10/19/2021 4:53:24 AM) Dividend(Cancelled) (As per BSE Bulletin Dated on 19/10/2021) Nestle Indian Limited has intimated that the Board of Directors at their meeting held today declared Second Interim Dividend of Rs. 110/- (Rupees One Hundred Ten only) per equity share of Rs. 10/- each for the year 2021 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The Second Interim Dividend for the year 2021 will be paid on and from 16th November 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 27th October 2021, already announced for the purpose vide letter no. BM: PKR: 35:21 dated 7th October 2021. (As Per BSE Announcement Dated on 19.10.2021)"
            ],
            [
                "28-07-2021",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/07/2021 ,inter alia, to consider and approve un-audited financial results for the quarter and half year ending 30th June 2021. In view of the above, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st July 2021 to 30th July 2021 (both days inclusive). Nestle India Limited has informed BSE that the Board of Directors of the Company at its meeting held on 28th July 2021, has approved: a) Unaudited Financial Results of the Company for the quarter and half year ended 30th June 2021 b) Scheme of Arrangement for the transfer of balance of General Reserve to the Retained Earnings under Section 230 of the Companies Act 2013 as amended read with other applicable provisions of the Act and Rules thereunder c) In-principle approval to disinvest Company's entire minority stake in Sahyadri Agro and Dairy Private Limited. (As Per BSE Announcement Dated on 28.07.2021)"
            ],
            [
                "20-04-2021",
                "Quarterly Results"
            ],
            [
                "20-04-2021",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/04/2021 ,inter alia, to consider and approve Nestle India:- Un-audited financial results of the Company for the first quarter ending 31st March 2021 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Tuesday, 20th April 2021. Nestle India-The Book Closure from 1st May 2021 to 7th May 2021 (both days inclusive) for the purpose of Annual Closing and final dividend, 2020, as intimated vide our letter BM:PKR:05:21 dated 16th February 2021, shall also determine the entitlement of the shareholders to the interim dividend for the year 2021, if any, that may be declared by the Board of Directors on 20th April 2021. Intimation of the Book Closure dates for the purpose of interim dividend for the year 2021, if any, is enclosed Nestle India-Further to our earlier letter no. BM:PKR:11:21 dated 25th March 2021, intimating that the un-audited financial results of the Company for the first quarter ended 31st March 2021 shall be considered by the Board of Directors of the Company at their meeting proposed on 20th April 2021, this is to inform you that at its meeting to be held on that date, the Board of Directors would also consider declaration of interim dividend for the year 2021, if any. (As Per BSE Announcement dated on 06.04.2021) As per letter attached The Board of Directors at their meeting held today declared Interim Dividend of Rs. 25/- (Rupees Twenty Five only) per equity share of Rs. 10/- each for the year 2021 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The Interim Dividend for the year 2021 will be paid on and from 19th May 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Book Closure from 1st May 2021 to 7th May 2021 (both days inclusive), as intimated vide our letter BM:PKR:12:21 dated 6th April 2021. The Interim Dividend for the year 2021 shall be paid on and from 19th May 2021 along with the Final Dividend 2020, as approved by the shareholders at the 62nd Annual General Meeting. (As Per BSE Announcement dated on 20.04.2021)"
            ],
            [
                "16-02-2021",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 16/02/2021 ,inter alia, to consider and approve the audited financial results of the Company for the year ending 31st December 2020. Also submitted draft Public Notice pertaining to the above to be published. Consequently, the Company will not be publishing the un-audited financial results for the fourth quarter ending 31st December 2020. In view of the above, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st January 2021 to 18th February 2021 (both days inclusive). With reference to the earlier letter dated December 21, 2020 intimating that the audited financial results of the Company for the year 2020 shall be considered by the Board of Directors of the Company at their meeting proposed on February 16, 2021, Nestle India Ltd has now informed BSE that at its meeting to be held on that date, the Board of Directors would also consider recommendation of final dividend for the year 2020, if any, for the approval of the shareholders at the ensuing Annual General Meeting. As intimated under Company's letter dated December 21, 2020, the Trading Window in respect of the equity shares of the Company shall remain closed from January 01, 2021 to February 18, 2021 (both days inclusive). (AS Per BSE Announcement Dated on 09.02.2021) Board approved a) approved the audited financial results for the year ended 31st December 2020. Enclosed are the audited financial results along with the Report of the Auditors thereon and the declaration in respect of Audit Reports with unmodified opinion for the Financial Year ended 31st December 2020. The audited financial results shall be published in newspapers as required. Also, find enclosed Press Release relating to the results. The above are being uploaded on the Company's website ; b) approved the Financial Statements of the Company for the year 2020 including Balance Sheet as at 31st December 2020 and Statement of Profit and Loss and the Cash Flow Statement for the year ended on that date. Nestle India-The Board of Directors recommended final dividend for the year 2020 of Rs. 65/- (Rupees sixty five only) per equity shares of Rs. 10/- each. The Register of Members and Share Transfer Books of the Company shall remain closed from 1st May 2021 to 7th May 2021 (both days inclusive) for the purpose of Annual Closing and determining entitlement of the members to the final dividend for 2020. The final dividend, if approved by the shareholders at 62nd AGM, shall be paid on and from 20th May 2021. (As Per BSE Announcement Dated 16.02.2021) Nestle India Ltd has informed BSE that the Register of Members & Share Transfer Books of the Company will remain closed from May 01, 2021 to May 07, 2021 (both days inclusive) for the purpose of Payment of Final Dividend & 62nd Annual General Meeting (AGM) of the Company to be held on May 07, 2021. (As Per BSE Announcement dated on 17.02.2021)"
            ],
            [
                "23-10-2020",
                "Quarterly Results"
            ],
            [
                "23-10-2020",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2020 ,inter alia, to consider and approve un-audited financial results for the third quarter and nine months ending 30th September 2020. Nestle India - The Board of Directors at their meeting held today declared interim dividend of Rs. 135/- (Rupees One Hundred Thirty Five only) per equity share of Rs. 10/- each for the year 2020 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The interim dividend for the year 2020 will be paid on and from 20th November 2020 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 2nd November 2020. Nestle India-The Board of Director today approved unaudited financial results of the Company for the quarter and nine months ended 30th September 2020 along with the Limited Review Report of M/s. B S R & Co. LLP, Chartered Accountants, Statutory Auditors (AS Per BSE Announcement Dated on 23.10.2020)"
            ],
            [
                "28-07-2020",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/07/2020 ,inter alia, to consider and approve un-audited financial results for the quarter and half year ending 30th June 2020. In view of the above, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st July 2020 to 30th July 2020 (both days inclusive). Please find enclosed following: a) the unaudited financial results of the Company for the quarter and six months ended 30th June 2020 approved by the Board of Directors at their meeting held today alongwith the Limited Review Report of M/s. B S R & Co. LLP, Chartered Accountants, the Statutory Auditors of the Company; and b) Press Release relating to the unaudited financial results for the quarter and six months ended 30th June 2020. The unaudited financial results shall be published in newspapers. The same is also being uploaded on the Company's website. The meeting of the Board of Directors commenced at 14:30 hours and above agenda item concluded at 16:30 hours (As Per BSE Announcement Dated on 28/07/2020)"
            ],
            [
                "12-05-2020",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/05/2020 ,inter alia, to consider and approve un-audited financial results for the first quarter ended 31st March 2020. Also, the Trading Window will remain closed till 14th May 2020. Nestlé India Limited has submitted a) the Unaudited Financial Results of the Company for the first quarter ended 31st March 2020 approved by the Board of Directors at their meeting held today alongwith the Limited Review Report of M/s. B S R & Co. LLP, Chartered Accountants, the Statutory Auditors of the Company; and b)Press Release relating to the Unaudited Financial Results for the first quarter ended 31st March 2020. Also, the Board of Directors at their meeting held today on the recommendation of the Nomination and Remuneration Committee, appointed Mr. Ramesh Prathivadibhayankara Rajgopalan (DIN 01915274)('Mr. P R Ramesh') as an Independent Non-Executive Director of the Company with effect from 1st July 2020 for a term of five years. (As Per BSE Announcement dated on 12.05.2020)"
            ],
            [
                "13-02-2020",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/02/2020 ,inter alia, to consider and approve Audited financial results for the year ending 31st December, 2019. Nestle India-Further to our earlier letter no. BM:PKR:79:19 dated 20th December, 2019 intimating that the audited financial results of the Company for the year 2019 shall be considered by the Board of Directors of the Company at their meeting proposed on 13th February, 2020, this is to inform you that at its meeting to be held on that date, the Board of Directors would also consider recommendation of final dividend for the year 2019, if any, for the approval of the shareholders at the ensuing Annual General Meeting. (As Per BSE Announcement Dated on 06.02.2020) Nestle India- The Board of Directors recommended final dividend for the year 2019 of Rs. 61/- (Rupees Sixty One only) per equity shares of Rs. 10/- each and also approved the convening of 61st Annual General Meeting of the Company on Friday, 8th May, 2020 ('61st AGM'). e) The Register of Members and Share Transfer Books of the Company shall remain closed from 18d May 2020 to 19th May, 2020 (both days inclusive) for the purpose of Annual Closing and determining entitlement of the members to the final dividend for 2019. The final dividend, if approved by the shareholders at 61st AGM, shall be paid on and from 28th May 2020. The Board of Directors at their meeting today:- a)approved the audited financial results for the year ended 31st December, 2019. b)approved the Financial Statements of the Company for the year 2019 including Balance Sheet as at 31st December, 2019 and Statement of Profit and Loss and the Cash Flow Statement for the year ended on that date. The Board of Directors recommended final dividend for the year 2019 of Rs. 61/- (Rupees Sixty One only) per equity shares of Rs. 10/- each. At the Board Meeting today, the Board of Directors also approved the convening of 61st Annual General Meeting of the Company on Friday, 8th May, 2020 ('61st AGM'). The meeting of the Board of Directors commenced at 15:30 hours and concluded at 17.45 hours. The Board of Directors at their meeting today:- a) Recommended final dividend for the year 2019 of Rs. 61/- (Rupees Sixty One only) per equity shares of Rs. 10/- each. b) The Board of Directors also approved the convening of 61st Annual General Meeting of the Company on Friday, 8th May, 2020 ('61st AGM'). The Register of Members and Share Transfer Books of the Company shall remain closed from 18th May 2020 to 19th May, 2020 (both days inclusive) for the purpose of Annual Closing and determining entitlement of the members to the final dividend for 2019. The final dividend, if approved by the shareholders at 61st AGM, shall be paid on and from 28th May 2020. Nestle India Ltd has informed BSE that the Register of Members & Share Transfer Books of the Company will remain closed from May 18, 2020 to May 19, 2020 (both days inclusive) for the purpose of Payment of Final Dividend & 61st Annual General Meeting (AGM) of the Company to be held on May 08, 2020. The final dividend, if approved by the shareholders at 61st AGM, shall be paid on and from May 28, 2020. (As Per BSE Announcement Dated on 13.02.2020)"
            ],
            [
                "03-12-2019",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/12/2019 ,inter alia, to consider and approve Nestle India- Board of Directors will consider declaration of third interim dividend for the year 2019, if any, on 3rd December, 2019. The Record Date of 11th December, 2019 has been fixed for the purpose of entitlement of the shareholders to the third interim dividend for 2019, if any. The third interim dividend for 2019, if any declared, would be paid on and from 20th December 2019. Nestle India-outcome of the Board Meeting: The Board of Directors at their meeting held today declared third interim dividend of Rs. 55/- (Rupees fifty five only) per equity share for the year 2019 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The third interim dividend for 2019 will be paid on and from 20th December, 2019 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 11th December, 2019, already announced for the purpose vide our letter no. BM:PKR:74:19 dated 22nd November, 2019. (As Per BSE Announcement Dated on 03.12.2019)"
            ],
            [
                "08-11-2019",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/11/2019 ,inter alia, to consider and approve Nestle India- Unaudited financial results of the Company for the third quarter and nine months ending 30th September, 2019 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Friday, 8th November, 2019 Nestle India - The Board of Directors of the Company at its meeting held on 8th November, 2019, inter alia, has approved a) Unaudited financial results of the Company for the quarter and nine months ended 30th September, 2019; and b) On the recommendation of the Nomination and Remuneration Committee, appointed Mr. David McDaniel, as Whole-time Director, designated as 'Executive Director - Finance & Control and Chief Financial Officer' with effect from 1st March, 2020, for a term of five years, subject to requisite approvals, in place of Mr. Shobinder Duggal, whose term as Whole-time Director of the Company ends on 31st December, 2019. Further, the Board of Directors approved continuation of Mr. Shobinder Duggal as the Chief Financial Officer of the Company upto 29th February, 2020. (As Per BSE Announcement Dated on 08/11/2019)"
            ],
            [
                "02-08-2019",
                "Second Interim Dividend"
            ],
            [
                "14-05-2019",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/05/2019 ,inter alia, to consider and approve Nestle India-The un-audited financial results of the Company for the first quarter ended 31st March, 2019 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Tuesday, 14th May, 2019."
            ],
            [
                "25-04-2019",
                "Interim Dividend"
            ],
            [
                "14-02-2019",
                "Final Dividend & Audited Results"
            ],
            [
                "05-12-2018",
                "Interim Dividend"
            ],
            [
                "26-10-2018",
                "NESTLE INDIA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/10/2018 ,inter alia, to consider and approve un-audited financial results for the third quarter and nine months ending 30th September, 2018"
            ],
            [
                "03-08-2018",
                "Second Interim Dividend"
            ],
            [
                "03-08-2018",
                "Second Interim Dividend"
            ],
            [
                "10-05-2018",
                "Interim Dividend"
            ],
            [
                "14-02-2018",
                "Final Dividend"
            ],
            [
                "04-12-2017",
                "Third Interim Dividend"
            ],
            [
                "10-11-2017",
                "Nestle India Limited has intimated the Stock Exchange that the un-audited financial results of the Company for the third quarter and nine months ending 30th September, 2017 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Friday, 10th November, 2017. In view of the above, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st October, 2017 to 12th November, 2017 (both days inclusive)."
            ],
            [
                "26-07-2017",
                "Interim Dividend Second Interim Dividend"
            ],
            [
                "12-05-2017",
                "Interim Dividend"
            ],
            [
                "12-03-2017",
                "This is to inform that the un-audited financial results of the Company for the first quarter ending 31st March, 2017 shall be considered by the Board of Directors of the Company at their meeting proposed to be held on Friday, 12th May, 2017. Public Notice enclosed. In view of the above, the Trading Window in respect of the equity shares of the Company shall remain closed from 1st April, 2017 to 14th May, 2017 (both days inclusive)."
            ],
            [
                "27-03-2017",
                ""
            ],
            [
                "15-02-2017",
                "Final Dividend"
            ],
            [
                "05-12-2016",
                "Interim Dividend"
            ],
            [
                "28-10-2016",
                "Quarterly Results"
            ],
            [
                "29-07-2016",
                "Interim Dividend second interim dividend"
            ],
            [
                "12-05-2016",
                "Interim Dividend"
            ],
            [
                "12-05-2016",
                "Quarterly Results"
            ],
            [
                "12-02-2016",
                "Final Dividend"
            ],
            [
                "04-12-2015",
                "Second Interim Dividend"
            ],
            [
                "29-10-2015",
                "Quarterly Results"
            ],
            [
                "29-07-2015",
                "Quarterly Results"
            ],
            [
                "15-05-2015",
                "Interim Dividend & Quarterly Results"
            ],
            [
                "13-02-2015",
                "Final Dividend & Audited Results"
            ],
            [
                "03-12-2014",
                "Third Interim Dividend"
            ],
            [
                "28-10-2014",
                "Quarterly Results"
            ],
            [
                "10-09-2014",
                "Second Interim Dividend"
            ],
            [
                "07-08-2014",
                "Quarterly Results"
            ],
            [
                "13-05-2014",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "14-02-2014",
                "Final Dividend & Audited Results"
            ],
            [
                "30-10-2013",
                "Quarterly Results & Second Interim Dividend"
            ],
            [
                "26-07-2013",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "13-05-2013",
                "Quarterly Results"
            ],
            [
                "20-02-2013",
                "Final Dividend & Audited Results"
            ],
            [
                "07-12-2012",
                "Second Interim Dividend"
            ],
            [
                "12-11-2012",
                "Quarterly Results"
            ],
            [
                "27-07-2012",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "25-04-2012",
                "Quarterly Results"
            ],
            [
                "14-02-2012",
                "Final Dividend & Audited Results"
            ],
            [
                "07-12-2011",
                "Interim Dividend Second Interim Dividend"
            ],
            [
                "04-11-2011",
                "Quarterly Results"
            ],
            [
                "30-07-2011",
                "Quarterly Results"
            ],
            [
                "19-04-2011",
                "Interim Dividend"
            ],
            [
                "21-04-2011",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "18-02-2011",
                "Final Dividend & Audited Results"
            ],
            [
                "29-10-2010",
                "Quarterly Results & Interim Dividend Second Interim Dividend"
            ],
            [
                "02-08-2010",
                "Quarterly Results"
            ],
            [
                "21-04-2010",
                "Interim Dividend"
            ],
            [
                "22-04-2010",
                "Quarterly Results"
            ],
            [
                "19-02-2010",
                "Final Dividend & Audited Results"
            ],
            [
                "07-12-2009",
                "inter-alia, to consider the proposal of Speciality Foods India Pvt. Ltd. for a possible acquisition of its Healthcare Nutrition Business (revenue for the year ended March 31, 2009 - Rs. 28.8 Crores) by Nestle India Ltd., on terms and conditions as may be mutually agreed.  The product portfolio under the Healthcare Nutrition Business is meant to satisfy the needs of consumers with special nutritional requirements and sold in India under brands like RESOURCE, OPTIFAST, SPERT."
            ],
            [
                "30-10-2009",
                "Quarterly Results & Interim Dividend Second Interim Dividend"
            ],
            [
                "30-07-2009",
                "Quarterly Results"
            ],
            [
                "30-04-2009",
                "Quarterly Results"
            ],
            [
                "29-04-2009",
                "Interim Dividend"
            ],
            [
                "06-03-2009",
                "Final Dividend & Audited Results"
            ],
            [
                "31-10-2008",
                "Nestle India Ltd has informed BSE that the Company has received certified copy of the Order of Hon'ble High Court sanctioning the Scheme of Arrangement between the Company and its Shareholders and Creditors (\"the Scheme). The Scheme shall become effective on its filing with the Registrar of Companies.  Further the Company has informed that a meeting of the Board of Directors of the Company will be held on October 31, 2008, on the Scheme becoming effective, the Directors shall consider fixation of Record Date for the purpose of determining the list of the shareholders, who shall be entitled to receive payment pursuant to the Scheme of Arrangement; and determine amount to be paid per share, taking into account the applicable taxes and the round off of payments to the nearest half Rupee."
            ],
            [
                "31-07-2008",
                "Quarterly Results"
            ],
            [
                "29-04-2008",
                "Quarterly Results"
            ],
            [
                "17-04-2008",
                "Interim Dividend"
            ],
            [
                "04-03-2008",
                "Audited Results & Final Dividend"
            ],
            [
                "08-12-2007",
                "Interim Dividend"
            ],
            [
                "30-10-2007",
                "Quarterly Results"
            ],
            [
                "31-07-2007",
                "Quarterly Results & shall also consider the appointment of Mr. Pradip Baijal as a Non-Executive Independent Director of the Company."
            ],
            [
                "30-04-2007",
                "Quarterly Results"
            ],
            [
                "15-03-2007",
                "Interim Dividend 3rd  Interim dividend for 2006 & Interim Dividend for  year 2007 inter alia, to consider declaration of Interim Dividend for the year 2007, if any, and the Third Interim Dividend for the year 2006, if any. The Interim Dividend for the year 2007, if any, and the Third Interim Dividend for the year 2006, if any."
            ],
            [
                "20-03-2007",
                "Accounts To consider the Audited Financial Results for the year ended December 31, 2006 & Dividend Recommendation of final dividend for the year ended December 31, 2006"
            ],
            [
                "15-01-2007",
                "inter alia, to consider a Scheme formulated under Sections 391 to 394 of the Companies Act, 1956 read with Sections 100 to 102 of the Companies Act, 1956 for enabling utilisation of part of the General Reserve and the Share Premium Account of the Company, for consequent distribution thereof to the shareholders of the Company. The proposed Scheme shall be subject to approval of the shareholders / creditors of the Company and the Hon'ble High Court.  The final decision on the proposed Scheme would be taken by the Board at its meeting on January 15, 2007 and is subject to such modifications as may be proposed by the Board."
            ],
            [
                "04-12-2006",
                "Interim Dividend Second Interim"
            ],
            [
                "28-10-2006",
                "Quarterly Results"
            ],
            [
                "29-07-2006",
                "Quarterly Results"
            ],
            [
                "27-04-2006",
                "Quarterly Results"
            ],
            [
                "15-04-2006",
                "Interim Dividend for 2006"
            ],
            [
                "06-03-2006",
                "Final Dividend & Accounts"
            ],
            [
                "06-12-2005",
                "Interim Dividend"
            ],
            [
                "28-10-2005",
                "Quarterly Results"
            ],
            [
                "29-07-2005",
                "Quarterly Results"
            ],
            [
                "19-04-2005",
                "Interim Dividend"
            ],
            [
                "14-03-2005",
                "Accounts & Dividend"
            ],
            [
                "07-12-2004",
                "Second Interim Dividend"
            ],
            [
                "28-10-2004",
                "Quarterly Results"
            ],
            [
                "28-07-2004",
                "Quarterly Results"
            ],
            [
                "16-07-2004",
                "Interim Dividend"
            ],
            [
                "30-04-2004",
                "Quarterly Results"
            ],
            [
                "15-03-2004",
                "Accounts"
            ],
            [
                "05-12-2003",
                "Interim Dividend"
            ],
            [
                "31-10-2003",
                "Quarterly Results"
            ],
            [
                "31-07-2003",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "10-07-2003",
                "Interim Dividend"
            ],
            [
                "30-04-2003",
                "Quarterly Results"
            ],
            [
                "07-03-2003",
                "Accounts"
            ],
            [
                "05-12-2002",
                "Interim Dividend"
            ],
            [
                "31-10-2002",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "07-02-2025",
                "07-02-2025",
                "1425%",
                "Unaudited Financial Results (Standalone and Consolidated) for the third quarter and nine months ended 31st December 2024; and Second Interim Dividend for the Financial Year 2024-25 Second Interim Dividend of Rs. 14.25/- (Rupees fourteen and paisa twenty-five only) per equity share of the face value of Re. 1/- (Rupee one only) each for the Financial Year 2024-25 on the entire issued, subscribed and paid-up share capital of the Company of 964,157,160 equity shares, which will be paid on and from 27th February 2025 to those members whose names appear in the Register of Members of the Company or in the Register of Beneficial Owners maintained by the Depositories, as on the Record Date fixed for the purpose i.e. 7th February 2025, as already intimated to the Stock Exchanges vide our letter reference no. PKR:SG:JK: 107:2024-25 & PKR:SG:JK: 108:2024-25 both dated 24th January 2025."
            ],
            [
                "16-07-2024",
                "16-07-2024",
                "275%",
                "This is to inform you that the Board of Directors at its meeting held today declared an Interim Dividend of Rs. 2.75/- (Rupees two and paisa seventy-five only) per equity share of face value of Re. 1/- (Rupee one only) each for the financial year 2024-25 on the entire issued, subscribed and paid-up share capital of the Company comprises of 96,41,57,160 equity shares of the nominal value of Re. 1/- (Rupee one only) each."
            ],
            [
                "16-07-2024",
                "16-07-2024",
                "850%",
                "Outcome of Board Meeting Recommended Final Dividend of Rs. 8.50/- (Eight Rupees and Fifty Paisa only) per equity shares of Re. 1/- each for the fifteen months financial year ended 31st March 2024 on the entire issued, subscribed and paid-up share capital of the Company of 964,157,160 equity shares of nominal value of Re. 1/- (Rupee one only) each."
            ],
            [
                "15-02-2024",
                "15-02-2024",
                "700%",
                "Declaration of Third Interim Dividend of Rs. 7/- per Equity Share of the face value of Re. 1/- each for the Financial Year 2023-24"
            ],
            [
                "01-11-2023",
                "01-11-2023",
                "1400%",
                "Declaration of Second Interim Dividend of 2023"
            ],
            [
                "21-04-2023",
                "21-04-2023",
                "270%",
                "This is to inform you that the Board of Directors at their meeting held today declared an Interim Dividend of Rs. 27/- (Rupees Twenty-Seven Only) per equity share of Rs. 10/- each for the year 2023 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Interim Dividend for the year 2023 will be paid on and from 8th May 2023 along-with the final dividend for the year 2022, if approved by the members at the 64th Annual General Meeting scheduled to be held on 12th April 2023, to those members whose names appear in the Register of Members of the Company and as beneficial owner in the records of the depository, as on the Record Date fixed for the aforesaid purpose i.e. 21st April 2023, as intimated vide our letter PKR:GA:22:23 dated 27th March 2023."
            ],
            [
                "21-04-2023",
                "21-04-2023",
                "750%",
                "The Board of Directors recommended final dividend for the year 2022 of Rs. 75/- (Rupees Seventy-Five only) per equity shares of Rs. 10/- each."
            ],
            [
                "01-11-2022",
                "31-10-2022",
                "1200%",
                "The Board of Directors, at their meeting held today, declared Second Interim Dividend of Rs. 120/- (Rupees One Hundred Twenty Only) per equity share of Rs. 10/- each for the year 2022 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Second Interim Dividend for the year 2022 will be paid on and from 16th November 2022 to those Members whose names appear in the Register of Members of the Company and as beneficial owners in the Depositories, as on the Record Date fixed for the purpose i.e., 1st November 2022, as intimated vide our letter PKR:GA 48:22 and 49:22 dated 10th October 2022."
            ],
            [
                "22-04-2022",
                "21-04-2022",
                "250%",
                "This is to inform you that the Board of Directors at their meeting held today declared an Interim Dividend of Rs. 25/- (Rupees twenty-five only) per equity share of Rs. 10/- each for the year 2022 on the entire issued, subscribed and paid-up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. Interim Dividend for the year 2022 will be paid on and from 6th May 2022 alongwith the final dividend for 2021, if approved by the shareholders at the 63rd Annual General Meeting scheduled to be held on 12th April 2022, to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, as on the Record Date fixed for the purpose i.e., 22nd April 2022, as intimated vide our letter BM:PKR:17:22 dated 31st March 2022. The meeting of the Board of Directors commenced at 15:30 hours and the meeting concluded at 15:55 hours."
            ],
            [
                "22-04-2022",
                "21-04-2022",
                "650%",
                "The Board of Directors at their meeting held today recommended final dividend for the year 2021 of Rs. 65/- (Rupees Sixty Five only) per equity shares of Rs. 10/- each. Rs.65.0000 per share(650%)Final Dividend Record Date (Revised) (As Per BSE Bulletin dated on 04.03.2022)"
            ],
            [
                "27-10-2021",
                "26-10-2021",
                "1100%",
                "Nestle Indian Limited has intimated that the Board of Directors at their meeting held today declared Second Interim Dividend of Rs. 110/- (Rupees One Hundred Ten only) per equity share of Rs. 10/- each for the year 2021 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The Second Interim Dividend for the year 2021 will be paid on and from 16th November 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 27th October 2021, already announced for the purpose vide letter no. BM: PKR: 35:21 dated 7th October 2021."
            ],
            [
                "01-05-2021",
                "29-04-2021",
                "250%",
                "As per letter attached The Board of Directors at their meeting held today declared Interim Dividend of Rs. 25/- (Rupees Twenty Five only) per equity share of Rs. 10/- each for the year 2021 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The Interim Dividend for the year 2021 will be paid on and from 19th May 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Book Closure from 1st May 2021 to 7th May 2021 (both days inclusive), as intimated vide our letter BM:PKR:12:21 dated 6th April 2021. The Interim Dividend for the year 2021 shall be paid on and from 19th May 2021 along with the Final Dividend 2020, as approved by the shareholders at the 62nd Annual General Meeting."
            ],
            [
                "01-05-2021",
                "29-04-2021",
                "650%",
                "Nestle India-The Board of Directors recommended final dividend for the year 2020 of Rs. 65/- (Rupees sixty five only) per equity shares of Rs. 10/- each. The Register of Members and Share Transfer Books of the Company shall remain closed from 1st May 2021 to 7th May 2021 (both days inclusive) for the purpose of Annual Closing and determining entitlement of the members to the final dividend for 2020. The final dividend, if approved by the shareholders at 62nd AGM, shall be paid on and from 20th May 2021."
            ],
            [
                "02-11-2020",
                "29-10-2020",
                "1350%",
                "Nestle India - The Board of Directors at their meeting held today declared interim dividend of Rs. 135/- (Rupees One Hundred Thirty Five only) per equity share of Rs. 10/- each for the year 2020 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The interim dividend for the year 2020 will be paid on and from 20th November 2020 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 2nd November 2020."
            ],
            [
                "13-06-2020",
                "11-06-2020",
                "610%",
                "Board approves Dividend Recommended final dividend for the year 2019 of Rs. 61/- (Rupees Sixty One only) per equity shares of Rs. 10/- each."
            ],
            [
                "11-12-2019",
                "10-12-2019",
                "550%",
                "Nestle India-outcome of the Board Meeting: The Board of Directors at their meeting held today declared third interim dividend of Rs. 55/- (Rupees fifty five only) per equity share for the year 2019 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The third interim dividend for 2019 will be paid on and from 20th December, 2019 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 11th December, 2019, already announced for the purpose vide our letter no. BM:PKR:74:19 dated 22nd November, 2019."
            ],
            [
                "13-08-2019",
                "09-08-2019",
                "1800%",
                "The Board of Directors declared interim dividend comprising of Rs. 23/- per equity share for 2019 out of current year profit and a special interim dividend of Rs. 180/- per equity share out of accumulated profits of previous years (surplus in the profit & loss account) on the entire issued, subscribed and paid up share capital of the Company of 96,415,716 equity shares of the nominal value of Rs. 10/- each. The total interim dividend of Rs. 203/- per equity share of Rs. 10/- each will be paid on and from 23rd August, 2019 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 13th August, 2019, already announced for the purpose."
            ],
            [
                "13-08-2019",
                "09-08-2019",
                "230%",
                "The Board of Directors declared interim dividend comprising of Rs. 23/- per equity share for 2019 out of current year profit and a special interim dividend of Rs. 180/- per equity share out of accumulated profits of previous years (surplus in the profit & loss account) on the entire issued, subscribed and paid up share capital of the Company of 96,415,716 equity shares of the nominal value of Rs. 10/- each. The total interim dividend of Rs. 203/- per equity share of Rs. 10/- each will be paid on and from 23rd August, 2019 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 13th August, 2019, already announced for the purpose."
            ],
            [
                "13-08-2019",
                "09-08-2019",
                "1800%",
                "Total Interim Dividend of Rs.203/- (Second Interim Dividend of Rs.23/- and Special Interim Dividend of Rs.180/-)"
            ],
            [
                "13-08-2019",
                "09-08-2019",
                "230%",
                "Second Interim Dividend"
            ],
            [
                "07-05-2019",
                "06-05-2019",
                "230%",
                "Nestle India Ltd has informed BSE that the Board of Directors of the Company at their meeting held on April 25, 2019, inter alia, has declared interim dividend of Rs. 23/- (Rupees Twenty Three only) per equity share for the year 2019 on the entire issued, subscribed and paid up share capital of the Company of 96,415,716 equity shares of the nominal value of Rs. 10/- each. The interim dividend for the year 2019 will be paid on and from May 15, 2019."
            ],
            [
                "07-05-2019",
                "06-05-2019",
                "230%",
                "Interim Dividend"
            ],
            [
                "03-05-2019",
                "30-04-2019",
                "250%",
                "Nestle India-The Board of Directors recommended final dividend for the year 2018 of Rs. 25.00 (Rupees twenty five only) per equity shares of Rs. 10/- each.The Register of Members and Share Transfer Books of the Company shall remain closed from 3rd May, 2019 to 4th May, 2019 (both days inclusive) for the purpose of Annual Closing and determining entitlement of the members to the final dividend for 2018. The final dividend, if approved by the shareholders at 60th AGM, shall be paid on and from 15th May, 2019. Intimation of Annual Book Closure is enclosed."
            ],
            [
                "03-05-2019",
                "30-04-2019",
                "250%",
                "Rs.25.0000 per share(250%)Final Dividend"
            ],
            [
                "13-12-2018",
                "12-12-2018",
                "500%",
                "Nestle India Limited-The Board of Directors at their meeting held today declared third interim dividend of Rs. 50/- (Rupees fifty only) per equity share for the year 2018 on the entire issued, subscribed and paid up share capital of the Company of 9,64,15,716 equity shares of the nominal value of Rs. 10/- each. The third interim dividend for 2018 will be paid on and from 21st December, 2018 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 13th December, 2018."
            ],
            [
                "13-12-2018",
                "12-12-2018",
                "500%",
                "Third Interim Dividend"
            ],
            [
                "13-08-2018",
                "10-08-2018",
                "200%",
                "Nestle India-The Board of Directors at their meeting held today declared second interim dividend of Rs. 20/- (Rupees Twenty only) per equity share of Rs. 10/- each for the year 2018 on the entire issued, subscribed and paid up share capital of the Company of 96,415,716 equity shares of the nominal value of Rs. 10/- each. The second interim dividend for 2018 will be paid on and from 24th August, 2018 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of 13th August, 2018, already announced for the purpose."
            ],
            [
                "13-08-2018",
                "10-08-2018",
                "0%",
                "Second Interim Dividend"
            ],
            [
                "18-05-2018",
                "16-05-2018",
                "200%",
                "Nestle India Ltd has informed BSE that the Board of Directors at their meeting held on May 10, 2018, inter alia, has declared interim dividend of Rs. 20/- (Rupees Twenty only) per equity share for the year 2018 on the entire issued, subscribed and paid up share capital of the Company of 96,415,716 equity shares of the nominal value of Rs. 10/- each. The interim dividend for 2018 will be paid on and from June 01, 2018."
            ],
            [
                "18-05-2018",
                "16-05-2018",
                "0%",
                "Interim Dividend"
            ],
            [
                "18-05-2018",
                "16-05-2018",
                "230%",
                "Rs.23.0000 per share(230%)Final Dividend"
            ],
            [
                "12-12-2017",
                "11-12-2017",
                "330%",
                "Third Interim Dividend"
            ],
            [
                "03-08-2017",
                "02-08-2017",
                "150%",
                "Second Interim Dividend"
            ],
            [
                "23-05-2017",
                "19-05-2017",
                "150%",
                "Rs.15.0000 per share(150%)Interim Dividend"
            ],
            [
                "23-05-2017",
                "19-05-2017",
                "230%",
                "Rs.23.0000 per share(230%)Final Dividend & A.G.M."
            ],
            [
                "13-12-2016",
                "09-12-2016",
                "160%",
                "Third Interim Dividend"
            ],
            [
                "08-08-2016",
                "05-08-2016",
                "120%",
                "Second Interim Dividend"
            ],
            [
                "20-05-2016",
                "18-05-2016",
                "120%",
                "Rs.12.0000 per share(120%)Interim Dividend"
            ],
            [
                "20-05-2016",
                "18-05-2016",
                "185%",
                "Rs.18.5000 per share(185%)Final Dividend"
            ],
            [
                "14-12-2015",
                "11-12-2015",
                "160%",
                "Second Interim Dividend"
            ],
            [
                "21-05-2015",
                "19-05-2015",
                "140%",
                "Interim Dividend"
            ],
            [
                "21-05-2015",
                "19-05-2015",
                "125%",
                ""
            ],
            [
                "09-12-2014",
                "08-12-2014",
                "80%",
                ""
            ],
            [
                "16-09-2014",
                "15-09-2014",
                "300%",
                "Second Interim Dividend"
            ],
            [
                "19-05-2014",
                "15-05-2014",
                "125%",
                "Interim Dividend"
            ],
            [
                "19-05-2014",
                "15-05-2014",
                "125%",
                "Rs.12.5000 per share(125%)Final Dividend"
            ],
            [
                "05-11-2013",
                "01-11-2013",
                "180%",
                "Second Interim Dividend"
            ],
            [
                "01-08-2013",
                "31-07-2013",
                "180%",
                "Interim Dividend"
            ],
            [
                "26-02-2013",
                "25-02-2013",
                "125%",
                "Interim Dividend"
            ],
            [
                "13-12-2012",
                "12-12-2012",
                "180%",
                "Rs.18.0000 per share (180%) Second Interim Dividend"
            ],
            [
                "02-08-2012",
                "01-08-2012",
                "180%",
                "Rs.18.00 per share(180%)Interim Dividend"
            ],
            [
                "23-03-2012",
                "21-03-2012",
                "125%",
                "Rs.12.50 per share(125%)Final Dividend"
            ],
            [
                "13-12-2011",
                "12-12-2011",
                "270%",
                "Second Interim Dividend"
            ],
            [
                "26-04-2011",
                "21-04-2011",
                "90%",
                "06/05/2011 Equity Interim Dividend & Rs.12.50 per share(125%)Final Dividend"
            ],
            [
                "26-04-2011",
                "21-04-2011",
                "125%",
                "Rs.12.50 per share(125%)Final Dividend"
            ],
            [
                "04-11-2010",
                "03-11-2010",
                "270%",
                "Second Interim Dividend"
            ],
            [
                "27-04-2010",
                "23-04-2010",
                "125%",
                "Rs.12.50 per share(125%)Final Dividend & Annual Book Closure"
            ],
            [
                "05-11-2009",
                "04-11-2009",
                "270%",
                "Second Interim Dividend"
            ],
            [
                "05-05-2009",
                "29-04-2009",
                "90%",
                ""
            ],
            [
                "05-05-2009",
                "29-04-2009",
                "120%",
                "210% Dividend(120% Final Div. & 90% Interim Div.)& A.G.M."
            ],
            [
                "17-11-2008",
                "14-11-2008",
                "220%",
                "220% Dividend(2nd Int.Div.145% &"
            ],
            [
                "25-04-2008",
                "23-04-2008",
                "110%",
                "110% Dividend & A.G.M."
            ],
            [
                "14-12-2007",
                "13-12-2007",
                "240%",
                "240% Second Interim Dividend"
            ],
            [
                "21-03-2007",
                "20-03-2007",
                "80%",
                ""
            ],
            [
                "11-12-2006",
                "08-12-2006",
                "180%",
                "180% Second Interim Dividend"
            ],
            [
                "21-04-2006",
                "19-04-2006",
                "80%",
                "A.G.M.& 80% Dividend {interim dividend of"
            ],
            [
                "12-12-2005",
                "09-12-2005",
                "180%",
                "180% Second Interim Dividend"
            ],
            [
                "25-04-2005",
                "20-04-2005",
                "95%",
                "A.G.M. & 95% Dividend"
            ],
            [
                "13-12-2004",
                "10-12-2004",
                "100%",
                "Shares Second Interim Dividend"
            ],
            [
                "21-07-2004",
                "20-07-2004",
                "100%",
                "Shares 100% Interim Dividend"
            ],
            [
                "11-12-2003",
                "10-12-2003",
                "100%",
                "Shares 100% Second Interim Dividend"
            ],
            [
                "06-08-2003",
                "05-08-2003",
                "100%",
                "Shares 100% Interim Dividend"
            ],
            [
                "11-12-2002",
                "09-12-2002",
                "180%",
                "Shares 180% Interim Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "05-01-2024",
                "05-01-2024",
                "1:10"
            ]
        ]
    },
    "bonus": {
        "title": "Bonus",
        "msg": "Nestle India has not announced any bonus for the last few years."
    },
    "rights": {
        "title": "Rights",
        "msg": "Nestle India has not announced any rights for the last few years."
    }
}