{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "08-05-2025",
                "Larsen & Toubro Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/05/2025 inter alia to consider and approve the audited consolidated and standalone financial results of the Company for the year ended 31st March 2025 and to recommend dividend if any. Outcome of Board Meeting of Larsen & Toubro Limited ('the Company') held on May 8, 2025 (As Per BSE Announcement Dated on: 08/05/2025)"
            ],
            [
                "21-03-2025",
                "Larsen & Toubro Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/03/2025 inter alia to consider and approve fund raising by way of debt issue Outcome of Board Meeting held on March 21, 2025 (As Per Bse Announcement Dated on 21.03.2025)"
            ],
            [
                "30-01-2025",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2025 inter alia to consider and approve the unaudited consolidated and standalone financial results of the Company for the quarter and nine months ended 31st December 2024. Outcome of Board Meeting held on January 30 , 2025 (As Per BSE Announcement Dated on: 30/01/2025)"
            ],
            [
                "30-10-2024",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/10/2024 inter alia to consider and approve unaudited financial results for the quarter and half year ended 30th September 2024. Outcome of Board Meeting held on October 30,2024 (As Per BSE Announcement dated on 30.10.2024)"
            ],
            [
                "24-07-2024",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/07/2024 inter alia to consider and approve the unaudited consolidated and standalone financial results of the Company for the quarter ended 30th June 2024 Outcome of Board Meeting held on July 24, 2024 (As Per BSE Announcement dated on 24.07.2024)"
            ],
            [
                "08-05-2024",
                "Quarterly Results"
            ],
            [
                "08-05-2024",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/05/2024 inter alia to consider and approve Audited Financial Results for the year ended 31st March 2024 Final Dividend & Audited Results (As per BSE Bulletin dated on 24/04/2024) Outcome of Board Meeting held on May 8, 2024 The Board of Directors has recommended a Final Dividend of Rs.28/- per share of the face value Rs. 2/- each. The Company has fixed Thursday, 20th June 2024 as the Record Date for determining the entitlement of Members for the proposed Final Dividend. Please refer attached intimation (As Per BSE Announcement Dated on 08/05/2024)"
            ],
            [
                "26-03-2024",
                "Outcome of Board Meeting held on March 26, 2024"
            ],
            [
                "27-03-2024",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/03/2024 inter alia to consider and approve fund raising including by way of debt issue"
            ],
            [
                "30-01-2024",
                "Quarterly Results"
            ],
            [
                "30-01-2024",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2024 inter alia to consider and approve unaudited financial results for the quarter and nine months period ended 31st December 2023 Investment in L&T Metro Rail (Hyderabad) Limited, existing subsidiary of the Company Merger of L&T Energy Hydrocarbon Engineering Limited and L&T Sapura Offshore Private Limited, wholly owned subsidiaries, with the Company. Outcome of Board Meeting held on January 30 , 2024 (As per BSE Announcement Dated on 30/01/2024)"
            ],
            [
                "31-10-2023",
                "Quarterly Results"
            ],
            [
                "31-10-2023",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/10/2023 inter alia to consider and approve Board meeting intimation for consideration of unaudited financial results for the quarter ended 30th September 2023 Outcome of Baard Meeting held on October 31, 2023 (As per BSE Announcement Dated on 31/10/2023) Intimation to Stock Exchanges regarding publication of Financial Results in Newspapers (As Per BSE Announcement Dated on 01/11/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "25-07-2023",
                "Quarterly Results"
            ],
            [
                "25-07-2023",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2023 inter alia to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Tuesday 25th July 2023 inter-alia to consider and approve the unaudited consolidated and standalone financial results of the Company for the quarter ended 30th June 2023. Kindly take note of the same. Update on Board Meeting - Board to consider Proposal for Buyback of equity shares of the Company and payment of Special Dividend (As Per BSE Announcement dated on 20.07.2023) Outcome of Board Meeting held on July 25, 2023 Consolidated and Standalone Unaudited Financial Results of the Company, for the Quarter ended 30th June 2023. We enclose a copy of Consolidated and Standalone Unaudited Financial Results of the Company, for the Quarter ended 30th June 2023, along with the Press Release related to the same. We also enclose a copy of the \"Limited Review Report for the Quarter ended 30th June 2023\" issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. 2. Buyback of 3,33,33,333 of its fully paid-up equity shares of face value of Rs. 2/- (Rupees Two only) each (\"Equity Shares\"), from the members of the Company at a Maximum price of up to Rs. 3,000 per Equity Share (\"Buyback Offer Price\"), subject to any increase to the Buyback Offer Price as may be approved by the Board or the Committee thereof, payable in cash for an aggregate consideration of up to Rs. 10,000 crore (Rupees Ten Thousand Crore only) (\"Buyback Size\") ( excluding tax on buyback), through the tender offer route through stock exchange mechanism. The specific price at which the Buyback will be made may be determined by the Board/Committee, at an appropriate time. Please refer to Annexure A for additional details with respect to the Buyback. 3. Special Dividend of Rs. 6/- (Rupees Six only) per equity share i.e. 300% on face value of Rs. 2/- each, for the Financial Year 2023-24. As informed earlier, the record date for the purpose of payment of dividend is Wednesday, August 2, 2023. This will be paid on or before August 14,2023. 4. Additional Investment of an amount upto Rs. 506 crore (Rupees Five Hundred and Six Crore only) in L&T Energy Green Tech Limited, existing subsidiary of the Company. Please refer to Annexure B for additional details. 5. Incorporation of a Joint Venture Company for green energy business with an initial subscribed capital of Rs. 1 crore (Rupees One Crore Only). Additional details as per SEBI Circular No. SEBI/HO/CFD/CFD-PoD-1/P/CIR/2023/123 dated July 13, 2023, will be intimated in due course. 6. Acquisition of entire Shareholding of Sapura Nautical Power Pte Ltd (JV partner) in L& T Sapura Offshore Private Limited (\"L TSO PL\"). Post completion of the acquisition, L TSOPL will become a wholly owned subsidiary of the Company. Please refer to Annexure C for additional details. The Board meeting commenced at 1 :30 p.m. and concluded at 4:30 p.m. Outcome of Board Meeting held on July 25, 2023 The Board of Directors at its meeting held today has approved buyback of equity shares Acquisition of JV Partner''s stake in L&T Sapura Offshore Pvt. Ltd. Additional investment in L&T Energy Green Tech Limited, existing subsidiary of the Company (As Per BSE Announcement PDF Dated on 25.07.2023)"
            ],
            [
                "10-05-2023",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/05/2023 inter alia to consider and approve Audited Financial Results for the year ended 31st March 2023 and to recommend dividend if any Final Dividend Consolidated & Standalone Audited Financial Results for the Quarter and Year ended 31st March 2023. Change in Chairman of the Company Appointment of Independent Directors (As Per BSE Announcement dated on 10.05.2023)"
            ],
            [
                "30-01-2023",
                "Quarterly Results"
            ],
            [
                "30-01-2023",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2023 inter alia to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a meeting of the Board of Directors of the Company will be held on Monday 30th January 2023 inter-alia to consider and approve the unaudited financial results of the Company for the quarter and nine months period ended 31st December 2022. Kindly take note of the same. Consolidated & Standalone Unaudited Financial Results for the Quarter and Nine months period ended 31st December 2022 (As Per BSE Announcement dated on 30.01.2023)"
            ],
            [
                "31-10-2022",
                "Quarterly Results"
            ],
            [
                "31-10-2022",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/10/2022 inter alia to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Monday 31st October 2022 inter-alia to consider and approve the unaudited financial results of the Company for the quarter and half year ended 30th September 2022."
            ],
            [
                "26-07-2022",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/07/2022 inter alia to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Tuesday 26th July 2022 inter-alia to consider and approve the unaudited financial results of the Company for the quarter ended 30th June 2022. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Unaudited Financial Results of the Company, for the Quarter ended 30th June 2022, which has been approved at the Meeting of the Board of Directors held today along with the Press Release related to the same. The Board Meeting commenced at 2.30 p.m. and concluded at 5.10 p.m. We also enclose a copy of the 'Limited Review Report for the Quarter ended 30th June 2022' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. (As Per BSE Announcement dated on 26.07.2022) Intimation under Regulation 30 of SEBI(Listing Obligations and Disclosure Requirements) Regulations, 2015 (LODR Regulations) (As Per BSE Announcement Dated on 27.07.2022)"
            ],
            [
                "12-05-2022",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/05/2022 inter alia to consider and approve Pursuant to Regulation 29(1) and Regulation 50(1) (c) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Thursday12th May 2022 inter-alia to consider and approve the audited consolidated and standalone financial results of the Company for the year ended 31st March 2022 to recommend dividend if any and to approve notice of Annual General Meeting which includes resolution for renewing approvals for raising funds. Pursuant to Regulation 33 and Regulation 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Audited Financial Results of the Company, for the Quarter and Year ended 31st March 2022, which has been approved at the Meeting of the Board of Directors, held today along with Press Release related to the same. The Board Meeting commenced at 2.00 p.m. and concluded at 4.35 p.m. We also enclose a copy of Audit Report signed by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai along with a declaration signed by our Company Secretary (for Audit Report with Un-modified opinion). The Board of Directors have recommended a Final Dividend of Rs.22/- per share of the face value Rs.2/- each (previous year final dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. Pursuant to Regulation 33 and Regulation 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Audited Financial Results of the Company, for the quarter and year ended 31st March, 2022, which has been approved at the Meeting of the Board of Directors, held today. The Board Meeting commenced at 2.00 p.m. and concluded at 4.35 p.m. We also enclose a copy of Audit Report signed by our Statutory Auditors, M/s.Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai along with a declaration signed by our Company Secretary (for Audit Report with Un-modified opinion). Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 12, 2022, inter alia, have recommended a Final Dividend of Rs. 22/- per share of the face value Rs. 2/- each (previous year final dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. Sub: Re-appointment of Mr. S. N. Subrahmanyan as Chief Executive Officer & Managing Director. Pursuant to Regulation 30 read with Schedule III Part A Para A (7) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors at its meeting held today i.e. May 12, 2022, based on the recommendation of the Nomination and Remuneration Committee and subject to necessary approvals of the Shareholders of the Company, has approved re-appointment of Mr. S. N. Subrahmanyan (DIN: 02255382) as Chief Executive Officer & Managing Director of the Company with effect from July 1, 2022 to June 30, 2027. A brief profile of Mr. S. N. Subrahmanyan is enclosed. We confirm that Mr. S. N. Subrahmanyan is not debarred from holding the office of Director by virtue of any order of SEBI or other such authority. We also confirm that he is not related to any Directors of the Company. Pursuant to Regulation 33 and Regulation 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Audited Financial Results of the Company, for the Quarter and Year ended 31st March 2022, which has been approved at the Meeting of the Board of Directors, held today along with Press Release related to the same. The Board Meeting commenced at 2.00 p.m. and concluded at 4.35 p.m. We also enclose a copy of Audit Report signed by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai along with a declaration signed by our Company Secretary (for Audit Report with Un-modified opinion). The Board of Directors have recommended a Final Dividend of Rs.22/- per share of the face value Rs.2/- each (previous year final dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. Pursuant to Regulation 33 and Regulation 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Audited Financial Results of the Company, for the quarter and year ended 31st March, 2022, which has been approved at the Meeting of the Board of Directors, held today. The Board Meeting commenced at 2.00 p.m. and concluded at 4.35 p.m. We also enclose a copy of Audit Report signed by our Statutory Auditors, M/s.Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai along with a declaration signed by our Company Secretary (for Audit Report with Un-modified opinion). Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 12, 2022, inter alia, have recommended a Final Dividend of Rs. 22/- per share of the face value Rs. 2/- each (previous year final dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. Sub: Re-appointment of Mr. S. N. Subrahmanyan as Chief Executive Officer & Managing Director. Pursuant to Regulation 30 read with Schedule III Part A Para A (7) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors at its meeting held today i.e. May 12, 2022, based on the recommendation of the Nomination and Remuneration Committee and subject to necessary approvals of the Shareholders of the Company, has approved re-appointment of Mr. S. N. Subrahmanyan (DIN: 02255382) as Chief Executive Officer & Managing Director of the Company with effect from July 1, 2022 to June 30, 2027. A brief profile of Mr. S. N. Subrahmanyan is enclosed. We confirm that Mr. S. N. Subrahmanyan is not debarred from holding the office of Director by virtue of any order of SEBI or other such authority. We also confirm that he is not related to any Directors of the Company. (As Per BSE Announcement dated on 12.05.2022)"
            ],
            [
                "24-03-2022",
                "Inter-alia to seek approval for raising funds including through issue of debt securities as part of Company's refinancing program. We refer to our intimation to the stock exchanges dated March 21, 2022. The Board of Directors at its meeting held today approved long term borrowings upto Rs.10,000 crore, including refinancing, through external commercial borrowings, term loans, non-convertible debentures or any other instrument as may be appropriate. The meeting of the Board of Directors of the Company commenced at 9.30 a.m and concluded at 1.45 p.m. Thanking you, (As per BSE Announcement Dated on 24/3/2022)"
            ],
            [
                "28-01-2022",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/01/2022 inter alia to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations 2015 we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Friday 28th January 2022 inter-alia to consider and approve the unaudited financial results of the Company for the quarter and nine months period ended 31st December 2021. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Unaudited Financial Results of the Company, for the quarter and nine months period ended 31st December 2021, which was approved at the Meeting of the Board of Directors held today. We also enclose the Press Release related to the same. The Board Meeting commenced at 2.30 p.m. and concluded at 4.15 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and nine months period ended 31st December 2021' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Unaudited Financial Results of the Company, for the quarter and nine months period ended 31st December 2021, which was approved at the Meeting of the Board of Directors held today. The Board Meeting commenced at 2.30 p.m. and concluded at 4.15 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and nine months period ended 31st December 2021' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. Thanking you, (As Per BSE Announcement Dated on 28.01.2022)"
            ],
            [
                "27-10-2021",
                "Quarterly Results"
            ],
            [
                "27-10-2021",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/10/2021 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(a) and Regulation 50(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 27th October 2021 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and half year ended 30th September 2021. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Unaudited Financial Results of the Company, for the quarter and half year ended 30th September 2021, which has been approved at the Meeting of the Board of Directors held today along with the Press Release related to the same. The Board Meeting commenced at 2.30 p.m. and concluded at 5.05 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and half year ended 30th September 2021' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. (As Per BSE announcement Dated on 27.10.2021)"
            ],
            [
                "26-07-2021",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/07/2021 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Monday, 26th July 2021 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter ended 30th June 2021. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Unaudited Financial Results of the Company, for the Quarter ended 30th June 2021, which has been approved at the Meeting of the Board of Directors held today along with the Press Release related to the same. The Board Meeting commenced at 2.30 p.m. and concluded at 5.25 p.m. We also enclose a copy of the 'Limited Review Report for the Quarter ended 30th June 2021' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. Intimation under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('SEBI LODR') - Scheme of Amalgamation (As per BSE Announcement Dated on 26/7/2021)"
            ],
            [
                "14-05-2021",
                "Larsen & Toubro Ltd has informed BSE that a Meeting of the Board of Directors of the Company will be held on May 14, 2021, inter alia, to consider and approve the audited consolidated and standalone financial results of the Company for the year ended March 31, 2021, to recommend dividend, if any, and to approve notice of Annual General Meeting which includesresolution for renewing approvals for raising funds. Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 14, 2021, inter alia, has recommended a Final Dividend of Rs.18/- per share of the face value Rs. 2/- each (previous year total dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. During the year, the Company had declared a special dividend of Rs.18 per equity share as an interim dividend, post the divestment of the Electrical & Automation business. Sub: Re-appointment of Director Pursuant to Regulation 30 read with Schedule III Part A Para A (7) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors at its meeting held on May 14, 2021, based on the recommendation of the Nomination and Remuneration Committee and subject to necessary approvals of the shareholders of the Company, has approved the re-appointment of Mr. R Shankar Raman (DIN: 00019798) as a Whole-time Director & Chief Financial Officer of the Company with effect from October 1, 2021 to September 30, 2026. A Brief profile of Mr. R Shankar Raman is enclosed. We confirm that Mr. R Shankar Raman is not debarred from holding the office of Director by virtue of any order of SEBI or other such authority. We also confirm that they he is not related to any Directors of the Company. Re-appointment of Director (As Per BSE Announcement Dated on 5/14/2021 5:56:36 PM)"
            ],
            [
                "25-01-2021",
                "Quarterly Results"
            ],
            [
                "25-01-2021",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/01/2021 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Monday, 25th January 2021 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and nine months period ended 31st December 2020. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Unaudited Financial Results of the Company, for the quarter and nine months period ended 31st December 2020, which was approved at the Meeting of the Board of Directors held today. The Board Meeting commenced at 2.30 p.m. and concluded at 5.00 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and nine months period ended 31st December 2020' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. Sub: Intimation under Regulation 30 of SEBI(Listing Obligations and Disclosure Requirements) Regulations, 2015 ('LODR Regulations') Pursuant to Regulation 30 read with Schedule III Part A Para A (7) of the LODR Regulations, kindly note that Ms. Naina Lal Kidwai (DIN: 00017806) will cease to be an Independent Director of the Company on completion of her tenure on February 28, 2021. This was noted by the Board in today's meeting. The Board also approved the appointment of Ms. Preetha Reddy (DIN: 00001871) as an Independent Director of the Company for a period of five years with effect from March 1, 2021. We further confirm that Ms. Reddy is not debarred from holding office of Director by virtue of any SEBI order or any other such authority and she is not inter-se related with any of the other Directors of the Company. We enclose her brief profile for your information. Kindly take the same on record and acknowledge receipt (As Per BSE Announcement dated on 25.01.2021)"
            ],
            [
                "28-10-2020",
                "Quarterly Results"
            ],
            [
                "28-10-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 28th October 2020 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and half year ended 30th September 2020. we wish to inform you that the Board of Directors of the Company has approved Special Dividend of Rs.18/- (Rupees Eighteen only) per equity share i.e. 900% on face value of Rs.2/- each, for the Financial Year 2020-21. As informed earlier, the record date for the purpose of payment of dividend is Thursday, November 5, 2020. This will be paid within stipulated timelines as prescribed under law. Sub: Re-appointment of Director Pursuant to Regulation 30 read with Schedule III Part A Para A (7) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that the Board of Directors at its meeting held on October 28, 2020, based on the recommendation of the Nomination and Remuneration Committee and subject to necessary approvals of the shareholders of the Company, has approved the re-appointment of Mr. M.V Satish (DIN: 06393156) as a Whole-time Director of the Company with effect from January 29, 2021 upto April 7, 2024. A Brief profile of Mr. M.V Satish is enclosed. We confirm that Mr. M.V Satish is not debarred from holding the office of Director by virtue of any order of SEBI or other such authority. We also confirm that they he is not related to any Directors of the Company. (As Per BSE announcement Dated on 28.10.2020)"
            ],
            [
                "22-07-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/07/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 22nd July 2020 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter ended 30th June 2020. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Unaudited Financial Results of the Company, for the quarter ended 30th June, 2020, which has been approved at the Meeting of the Board of Directors, held today. The Board Meeting commenced at 2.30 p.m. and concluded at 4.45 p.m. We also enclose a copy of the 'Limited Review Report for the quarter ended 30th June 2020' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accountants, Mumbai. Please inform your members accordingly and display this on your Notice Boards. (As Per BSE Announcement dated on 22.07.2020)"
            ],
            [
                "11-07-2020",
                "Sub: Intimation under Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015('LODR Regulations')"
            ],
            [
                "05-06-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/06/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Friday,5th June 2020 inter-alia, to consider and approve the audited consolidated and standalone financial results of the Company for the year ended 31st March 2020, to recommend dividend, if any, and to approve notice of Annual General Meeting which includes resolution for renewing approvals for raising funds. Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on June 06, 2020, inter alia, have recommended a Final Dividend of Rs. 8/- per share of the face value of Rs.2/- each. Interim dividend @ Rs.10/- per share has been paid on March 30, 2020. Hence, the total dividend for the year FY2019-20 works out to Rs.18/- per share(previous year Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. (As Per BSE Announcement Dated on 6/5/2020 6:40:09 PM) Re-appointment of Directors Intimation under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements), Regulations - 2015 ('SEBI LODR') Re-appointment of M/s. Deloitte Haskins & Sells LLP as Statutory Auditors (As Per BSE Announcement Dated on 06.06.2020)"
            ],
            [
                "09-04-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/04/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1)(d) and Regulation 50(2) of the Listing Regulations and other applicable provisions thereof, Notice is hereby given that a meeting of the Board of Directors of the Company is scheduled on Thursday, April 9, 2020 inter-alia to seek approval for raising funds including through issue of debt securities."
            ],
            [
                "18-03-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 18/03/2020 ,inter alia, to consider and approve Pursuant to Regulation 29 of Listing Regulations, Notice is hereby given that the Board of Directors of the Company (the \"Board\") on Wednesday, March 18, 2020, proposes to consider and approve First Interim Dividend on equity shares, if any, for the Financial Year 2019-20. Please note that the record date for the purpose of determining the entitlement of the equity shareholders for the said dividend, if declared, is being fixed as Thursday, March 26, 2020. Further, pursuant to the provisions of the Securities and Exchange Board of India (Prohibition of Insider Trading) Regulations, 2015 and Securities Dealing Code (Code) of the Company, the Trading Window is closed for dealing in securities of the Company for select insiders upto Friday, March 20, 2020. This is for your information and records. Larsen & Toubro Ltd has informed BSE that the Company has fixed March 26, 2020 as the Record Date for the purpose of Payment of First Interim Dividend, if declared. (As Per BSE Announcement Dated on 16/03/2020) Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company through resolution passed by circulation on March 18, 2020 has approved First Interim Dividend of Rs. 10/- (Rupees Ten Only) per equity share i.e. 500% on facevalue of Rs. 2/- each, for the Financial Year 2019-20.The interim dividend will be paid within stipulated timelines as prescribed under law. In continuation to our Letter No. SEC/PAM/1/2020 dated March 13, 2020 and pursuant to Regulation 30 of Listing Regulations, we wish to inform you that the Board of Directors of the Company through resolution passed by circulation today i.e. Wednesday, March 18, 2020 has approved First Interim Dividend of Rs.10/- (Rupees Ten Only) per equity share i.e. 500% on face value of Rs.2/- each, for the Financial Year 2019-20. As informed earlier, the record date for the purpose of payment of dividend is Thursday, March 26, 2020. The interim dividend will be paid within stipulated timelines as prescribed under law. (As Per BSE Announcement Dated on 3/18/2020 2:34:10 PM)"
            ],
            [
                "22-01-2020",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/01/2020 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 22nd January 2020 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and nine months period ended 31st December 2019. Further the Company confirms that as per the Company''s internal Code for Prevention of Insider Trading, the trading window for dealing in the securities of the Company is closed for the Company''s Directors/Officers and designated employees of the Company from January 1, 2020 till 48 hours after the announcement of financials results, i.e. upto January 24, 2020. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Consolidated Unaudited Financial Results of the Company, for the quarter and nine month period ended 31st December 2019, which has been approved at the Meeting of the Board of Directors, held today and Press Release related to the same. The Board Meeting commenced at 11.15 a.m. and concluded at 5.10 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and nine month period ended 31st December 2019' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accounts, Mumbai. Please inform your members accordingly and display this on your Notice Boards. Pursuant to Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we enclose a copy of the statement containing the Standalone Unaudited Financial Results of the Company, for the quarter and nine month period ended 31st December 2019, which has been approved at the Meeting of the Board of Directors, held today. The Board Meeting commenced at 11.15 a.m. and concluded at 5.10 p.m. We also enclose a copy of the 'Limited Review Report for the quarter and nine month period ended 31st December 2019' issued by our Statutory Auditors, M/s. Deloitte Haskins & Sells LLP, Chartered Accounts, Mumbai. Please inform your members accordingly and display this on your Notice Boards. (As Per BSE Announcement Dated 22.01.2020)"
            ],
            [
                "23-10-2019",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 23rd October 2019 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and half year ended 30th September 2019. Further the Company confirms that as per the Company''s internal Code for Prevention of Insider Trading, the trading window for dealing in the securities of the Company is closed for the Company''s Directors/Officers and designated employees of the Company from October 1, 2019 till 48 hours after the announcement of financials results, i.e. upto October 25, 2019. Sub.: Appointment of Company Secretary and Compliance Officer We would like to inform you that the Board of Directors at its meeting held today, has approved appointment of Mr. Sivaram Nair A, (Membership No. F3939), as the Company Secretary and Compliance Officer of the Company with effect from January 2, 2020 in place of Mr. N. Hariharan, Executive Vice-President & Company Secretary who will be superannuating from the services of the Company with effect from January 1, 2020. A brief profile of Mr. Sivaram Nair A is enclosed for reference. (As Per BSE Announcement Dated on 23/10/2019)"
            ],
            [
                "23-07-2019",
                "LARSEN & TOUBRO LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/07/2019 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Tuesday, 23rd July 2019 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and three month period ended 30th June 2019. Further the Company confirms that as per the Company''s internal Code for Prevention of Insider Trading, the trading window for dealing in the securities of the Company is closed for the Company''s Directors/Officers and designated employees from July 1, 2019 till 48 hours after the announcement of financials results, i.e. upto July 25, 2019."
            ],
            [
                "10-05-2019",
                "Audited Results & Dividend"
            ],
            [
                "25-01-2019",
                "Quarterly Results"
            ],
            [
                "31-10-2018",
                "LARSEN has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/10/2018 ,inter alia, to consider and approve Pursuant to Regulation 29(1) (a) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a Meeting of the Board of Directors of the Company will be held on Wednesday, 31st October 2018 inter-alia, to consider and approve the unaudited financial results of the Company for the quarter and half year ended 30th September 2018. Further the Company confirms that as per the Company''s internal Code for Prevention of Insider Trading, the trading window for dealing in the securities of the Company will be closed for the Company''s Directors/Officers and designated employees of the Company from October 24, 2018 till 48 hours after the announcement of financials results, i.e. upto November 2, 2018."
            ],
            [
                "25-07-2018",
                "Quarterly Results"
            ],
            [
                "28-05-2018",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2018",
                "Quarterly Results"
            ],
            [
                "24-01-2018",
                "Quarterly Results"
            ],
            [
                "11-11-2017",
                "Quarterly Results"
            ],
            [
                "28-07-2017",
                "Quarterly Results"
            ],
            [
                "29-05-2017",
                "Bonus issue"
            ],
            [
                "29-05-2017",
                "Audited Results & Dividend"
            ],
            [
                "28-01-2017",
                "Quarterly Results"
            ],
            [
                "22-11-2016",
                "Quarterly Results"
            ],
            [
                "29-07-2016",
                "Quarterly Results"
            ],
            [
                "25-05-2016",
                "Dividend & Audited Results"
            ],
            [
                "29-01-2016",
                "Quarterly Results"
            ],
            [
                "30-10-2015",
                "Quarterly Results"
            ],
            [
                "31-07-2015",
                "Quarterly Results"
            ],
            [
                "30-05-2015",
                "Audited Results & Dividend"
            ],
            [
                "09-02-2015",
                "Quarterly Results"
            ],
            [
                "07-11-2014",
                "Quarterly Results"
            ],
            [
                "28-07-2014",
                "Quarterly Results"
            ],
            [
                "30-05-2014",
                "Dividend & Audited Results"
            ],
            [
                "22-01-2014",
                "Quarterly Results"
            ],
            [
                "18-10-2013",
                "Quarterly Results"
            ],
            [
                "22-07-2013",
                "Quarterly Results"
            ],
            [
                "22-05-2013",
                "Dividend & Audited Results"
            ],
            [
                "24-01-2013",
                "Quarterly Results"
            ],
            [
                "22-10-2012",
                "Quarterly Results"
            ],
            [
                "23-07-2012",
                "Quarterly Results"
            ],
            [
                "14-05-2012",
                "Dividend & Audited Results"
            ],
            [
                "23-01-2012",
                "Quarterly Results"
            ],
            [
                "21-10-2011",
                "Quarterly Results"
            ],
            [
                "08-08-2011",
                "Quarterly Results"
            ],
            [
                "19-05-2011",
                "Dividend & Audited Results"
            ],
            [
                "17-01-2011",
                "Quarterly Results"
            ],
            [
                "18-10-2010",
                "Quarterly Results"
            ],
            [
                "27-07-2010",
                "Quarterly Results"
            ],
            [
                "17-05-2010",
                "Dividend & Audited Results"
            ],
            [
                "21-01-2010",
                "Quarterly Results"
            ],
            [
                "22-10-2009",
                "Quarterly Results"
            ],
            [
                "16-07-2009",
                "Quarterly Results"
            ],
            [
                "28-05-2009",
                "Dividend & Audited Results"
            ],
            [
                "30-01-2009",
                "Quarterly Results"
            ],
            [
                "15-10-2008",
                "Quarterly Results"
            ],
            [
                "28-07-2008",
                "Quarterly Results"
            ],
            [
                "29-05-2008",
                "Dividend & Audited Results"
            ],
            [
                "28-01-2008",
                "Quarterly Results"
            ],
            [
                "26-10-2007",
                "Quarterly Results"
            ],
            [
                "19-07-2007",
                "Quarterly Results"
            ],
            [
                "03-07-2007",
                "Dividend (Special Dividend)"
            ],
            [
                "29-05-2007",
                "Audited Results & Dividend"
            ],
            [
                "13-03-2007",
                "Interim Dividend"
            ],
            [
                "29-01-2007",
                "Quarterly Results"
            ],
            [
                "19-10-2006",
                "Quarterly Results"
            ],
            [
                "21-07-2006",
                "Quarterly Results"
            ],
            [
                "07-06-2006",
                "Bonus issue"
            ],
            [
                "25-05-2006",
                "Dividend & Accounts"
            ],
            [
                "21-03-2006",
                "inter alia, proposed to consider the financing plan for 2006-07, including options such as debt, foreign currency convertible bonds and depositary receipts, subject to necessary approvals."
            ],
            [
                "19-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "03-06-2025",
                "03-06-2025",
                "1700%",
                "The Board of Directors has recommended a Final Dividend of Rs.34/- per share of the face value Rs. 2/- each for the financial year ended March 31, 2025 (previous year final dividend Rs. 28/- per share). The Company will arrange to pay the proposed Final Dividend after approval of the shareholders in the ensuing Annual General Meeting."
            ],
            [
                "20-06-2024",
                "20-06-2024",
                "1400%",
                "The Board of Directors has recommended a Final Dividend of Rs.28/- per share of the face value Rs. 2/- each (in addition to the special dividend of Rs. 6 per share paid in August 2023) for the financial year ended March 31, 2024 (previous year final dividend Rs. 24/- per share). The Company will arrange to pay the proposed Final Dividend after approval of the shareholders in the ensuing Annual General Meeting."
            ],
            [
                "02-08-2023",
                "02-08-2023",
                "300%",
                "Outcome of Board Meeting held on July 25, 2023 Special Dividend of Rs. 6/- (Rupees Six only) per equity share i.e. 300% on face value of Rs. 2/- each, for the Financial Year 2023-24. As informed earlier, the record date for the purpose of payment of dividend is Wednesday, August 2, 2023. This will be paid on or before August 14,2023."
            ],
            [
                "02-08-2023",
                "02-08-2023",
                "1200%",
                "Final Dividend The Board of Directors has recommended a Final Dividend of Rs. 24/- per share of the face value Rs.2/- each (previous year final dividend Rs.22/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting."
            ],
            [
                "22-07-2022",
                "21-07-2022",
                "1100%",
                "Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 12, 2022, inter alia, have recommended a Final Dividend of Rs. 22/- per share of the face value Rs. 2/- each (previous year final dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting."
            ],
            [
                "30-07-2021",
                "28-07-2021",
                "900%",
                "Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 14, 2021, inter alia, has recommended a Final Dividend of Rs.18/- per share of the face value Rs. 2/- each (previous year total dividend Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting. During the year, the Company had declared a special dividend of Rs.18 per equity share as an interim dividend, post the divestment of the Electrical & Automation business."
            ],
            [
                "05-11-2020",
                "04-11-2020",
                "900%",
                "we wish to inform you that the Board of Directors of the Company has approved Special Dividend of Rs.18/- (Rupees Eighteen only) per equity share i.e. 900% on face value of Rs.2/- each, for the Financial Year 2020-21. As informed earlier, the record date for the purpose of payment of dividend is Thursday, November 5, 2020. This will be paid within stipulated timelines as prescribed under law."
            ],
            [
                "07-08-2020",
                "05-08-2020",
                "400%",
                "Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on June 06, 2020, inter alia, have recommended a Final Dividend of Rs. 8/- per share of the face value of Rs.2/- each. Interim dividend @ Rs.10/- per share has been paid on March 30, 2020. Hence, the total dividend for the year FY2019-20 works out to Rs.18/- per share (previous year Rs.18/- per share) and the Company will arrange to pay the same after approval of the shareholders in the ensuing Annual General Meeting."
            ],
            [
                "26-03-2020",
                "24-03-2020",
                "500%",
                "Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company through resolution passed by circulation on March 18, 2020 has approved First Interim Dividend of Rs. 10/- (Rupees Ten Only) per equity share i.e. 500% on face value of Rs. 2/- each, for the Financial Year 2019-20. The interim dividend will be paid within stipulated timelines as prescribed under law. In continuation to our Letter No. SEC/PAM/1/2020 dated March 13, 2020 and pursuant to Regulation 30 of Listing Regulations, we wish to inform you that the Board of Directors of the Company through resolution passed by circulation today i.e. Wednesday, March 18, 2020 has approved First Interim Dividend of Rs.10/- (Rupees Ten Only) per equity share i.e. 500% on face value of Rs.2/- each, for the Financial Year 2019-20. As informed earlier, the record date for the purpose of payment of dividend is Thursday, March 26, 2020. The interim dividend will be paid within stipulated timelines as prescribed under law."
            ],
            [
                "26-07-2019",
                "24-07-2019",
                "900%",
                "Larsen & Toubro Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 10, 2019, inter alia, have recommended a Final Dividend of Rs. 18/- per share (previous year Rs. 16/- per share) and the Company will arrange to pay the same on August 05, 2019, if approved by the members in Annual General Meeting scheduled to be held on August 01, 2019."
            ],
            [
                "26-07-2019",
                "24-07-2019",
                "900%",
                "Rs.18.0000 per share(900%)Dividend"
            ],
            [
                "17-08-2018",
                "14-08-2018",
                "800%",
                "Rs.16.0000 per share(800%)Dividend"
            ],
            [
                "16-08-2017",
                "11-08-2017",
                "700%",
                "Rs.21.0000 per share(1050%)Dividend"
            ],
            [
                "20-08-2016",
                "18-08-2016",
                "912%",
                "Rs.18.2500 per share(912.5%)Dividend"
            ],
            [
                "03-09-2015",
                "01-09-2015",
                "812%",
                "Rs.16.2500 per share(812.5%)Dividend"
            ],
            [
                "16-08-2014",
                "13-08-2014",
                "712%",
                "Rs.14.2500 per share(712.5%)Dividend"
            ],
            [
                "16-08-2013",
                "13-08-2013",
                "616%",
                "Rs.12.3300 per share(616.5%)Dividend"
            ],
            [
                "17-08-2012",
                "14-08-2012",
                "825%",
                "Rs.16.50 per share(825%)Dividend"
            ],
            [
                "19-08-2011",
                "17-08-2011",
                "725%",
                "Rs.14.50 per share(725%)Dividend"
            ],
            [
                "19-08-2010",
                "17-08-2010",
                "625%",
                "Rs.12.50 per share(625%)Dividend"
            ],
            [
                "21-08-2009",
                "18-08-2009",
                "525%",
                "Rs.10.50 per share(525%)Dividend"
            ],
            [
                "22-08-2008",
                "20-08-2008",
                "750%",
                "750% Final Dividend & A.G.M."
            ],
            [
                "18-07-2007",
                "17-07-2007",
                "100%",
                "100% Dividend"
            ],
            [
                "17-08-2007",
                "14-08-2007",
                "100%",
                ""
            ],
            [
                "29-03-2007",
                "28-03-2007",
                "550%",
                "550% Interim Dividend"
            ],
            [
                "17-08-2006",
                "14-08-2006",
                "1100%",
                "1100% Dividend"
            ]
        ]
    },
    "splits": {
        "title": "Split",
        "msg": "Larsen & Toubro has not announced any stock split for the last few years."
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "14-07-2017",
                "13-07-2017",
                "1:2"
            ],
            [
                "13-07-2013",
                "11-07-2013",
                "1:2"
            ],
            [
                "03-10-2008",
                "01-10-2008",
                "1:1"
            ],
            [
                "29-09-2006",
                "28-09-2006",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "Larsen & Toubro has not announced any rights for the last few years."
    }
}