{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "09-05-2025",
                "Audited Results & Dividend Dr Reddys Laboratories Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/05/2025 ,inter alia, to consider and approve audited Standalone and Consolidated Financial Results of the Company for the quarter and financial year ending March 31, 2025 and to recommend final dividend, if any, for the financial year 2024-25"
            ],
            [
                "23-01-2025",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/01/2025 inter alia to consider and approve The Unaudited Financial Results of the Company for the quarter and nine months ending on December 31 2024. Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company, at its meeting held on January 23, 2025, has inter alia approved the Unaudited Financial Results of the Company for the quarter and nine months ended December 31, 2024. (As Per BSE Announcement Dated on: 23/01/2025)"
            ],
            [
                "05-11-2024",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/11/2024 inter alia to consider and approve the Unaudited Financial Results of the Company for the quarter and half year ending on September 30 2024 Board of Directors of the Company at its meeting held on November 5, 2024, has inter alia approved the following: 1. Financial results a. Unaudited Consolidated Financial Results of the Company and its subsidiaries for the quarter and halfyear ended September 30, 2024, prepared in compliance with International Financial Reporting Standards (IFRS) as issued by International Accounting Standards Board (IASB); b. Press Release on Unaudited Financial Results of the Company for the above period. c. Unaudited Consolidated Financial Results of the Company and its subsidiaries for the quarter and halfyear ended September 30, 2024, as per Indian Accounting Standards. d. Unaudited Standalone Financial Results of the Company for the quarter and half-year ended September 30, 2024, as per Indian Accounting Standards. Pursuant to Regulation 33 of the SEBI Listing Regulations, the Limited Review Reports of the Statutory Auditors on the Unaudited Standalone and Consolidated Financial Results as mentioned at serial nos. (c) & (d) are also enclosed. 2. Investment in step-down wholly owned subsidiary company Approval of the fund infusion by way of investment in equity shares of Dr. Reddy's Laboratories LLC, Russia, a step-down wholly-owned subsidiary, upto an amount of Rs.600 Crores. The fund will be used for working capital requirements. The requisite details as required under SEBI Listing Regulations, read with the SEBI Circular No. SEBI/HO/CFD/CFD-PoD-1/P/CIR/2023/123 dated July 13, 2023, will be disclosed to the stock exchange(s) after approval of the Board of the said step-down wholly-owned subsidiary. (As Per BSE Announcement Dated on 05.11.2024)"
            ],
            [
                "27-07-2024",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/07/2024 inter alia to consider and approve the Unaudited Financial Results of the Company for the quarter ending on June 30 2024 Outcome of Board Meeting (As Per BSE Announcement dated on 27.07.2024)"
            ],
            [
                "07-05-2024",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/05/2024 inter alia to consider and approve Audited Standalone and Consolidated Financial Results of the Company for the quarter and financial year ending on March 31 2024 and to recommend dividend If any for the financial year 2023-24. Audited Financial results for the quarter and year ended March 31, 2024 Outcome of Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2024 Dividend updates Change in Key Managerial Personnel 40th Annual General Meeting (AGM) of the Company is scheduled to be held on Monday, July 29, 2024 The Register of members and the Share Transfer books of the Company shall remain closed from Wednesday, July 17, 2024 to Friday, July 19, 2024 (both days inclusive) for the purpose of the Dividend and Annual General Meeting of the Company (As Per BSE Announcement Dated on 07.05.2024)"
            ],
            [
                "30-01-2024",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2024 inter alia to consider and approve The unaudited financial results for the Company for the quarter and nine months ending December 31 2023 Outcome of Board meeting - Unaudited Financial Results for the Quarter and Nine Months ended December 31, 2023. Announcement under Regulation 30 of SEBI (Listing Obligations & Disclosure Requirements) Regulations, 2015 Unaudited Financial results for the Quarter and Nine Months ended December 31, 2023 (As Per BSE Announcement Dated on 30/01/2024)"
            ],
            [
                "27-10-2023",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/10/2023 inter alia to consider and approve The Unaudited Financial Results of the Company for the quarter and half year ending on September 30 2023. Outcome of Board Meeting - Unaudited Financial Results for the quarter and half-year ended September 30, 2023 Unaudited Financial results for the quarter and half-year ended September 30, 2023 (As per BSE Announcement Dated on 27/10/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "26-07-2023",
                "Quarterly Results"
            ],
            [
                "26-07-2023",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/07/2023 inter alia to consider and approve Consideration and approval of the Unaudited Financial Results of the Company for the quarter ending on June 30 2023. Outcome of Board Meeting - Unaudited Financial Results for the quarter ended June 30, 2023 Announcement under Regulation 30 of the SEBI (Listing Obligations and Disclosure requirements) Regulations, 2015 (SEBI Listing Regulations) Unaudited Financial results for quarter ended June 30, 2023 Retirement of Mr. Sridar Iyengar (DIN:00278512), Independent Director of the Company (As Per BSE Announcement dated on 26.07.2023)"
            ],
            [
                "10-05-2023",
                "Quarterly Results"
            ],
            [
                "23-03-2023",
                "Disclosure pursuant to Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015"
            ],
            [
                "10-05-2023",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/05/2023 inter alia to consider and approve Audited Standalone and Consolidated Financial Results of the Company for the quarter and financial year ending on March 31 2023 and to recommend dividend if any for the financial year 2022-23. Outcome of Board Meeting held on May 10, 2023 - Audited Financial Results and recommendation of Dividend for FY23 39th Annual General Meeting (AGM) of the members of the Company scheduled to be held on Thursday, July 27, 2023. The Register of Members and the Share Transfer Books of the Company shall remain closed from Wednesday, July 12, 2023, to Friday, July 14, 2023 (both days inclusive) for the purpose of the Dividend and Annual General Meeting of the Company. Audited Financial Results for FY23 (As per BSE Announcement Dated on 10/05/2023)"
            ],
            [
                "25-01-2023",
                "Quarterly Results"
            ],
            [
                "25-01-2023",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/01/2023 inter alia to consider and approve A meeting of the Board of Directors of the Company will be held on Wednesday January 25 2023 inter alia to consider and approve the Unaudited Financial Results of the Company for the quarter and nine months ending on December 31 2022. Outcome of Board Meeting - Unaudited Financial Results for the quarter and nine months ended December 31, 2022 Unaudited Financial Results for the quarter and nine months ended December 31, 2022 (As per BSE Announcement Dated on 25/01/2023)"
            ],
            [
                "28-10-2022",
                "Quarterly Results"
            ],
            [
                "28-10-2022",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2022 inter alia to consider and approve the Unaudited Financial Results of the Company for the quarter and half year ending on September 30 2022. Outcome of Board Meeting - Unaudited Financial Results for the quarter and half-year ended September 30, 2022 (As Per BSE Announcement Dated on 28.10.2022)"
            ],
            [
                "28-07-2022",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/07/2022 inter alia to consider and approve To consider and approve the Unaudited Financial Results of the Company for the quarter ending on June 30 2022. Sale of investment in wholly-owned subsidiary - Imperial Credit Private Limited Unaudited Financial Results for the quarter ended June 30, 2022 Appointment of Mr. Arun Madhavan Kumar (DIN: 09665138) as an Additional Director, categorized as Independent, on the Board of the Company. (As Per BSE Announcement dated on 28.07.2022) Newspaper publication for unaudited financial results for Q1 FY23 (As Per BSE Announcement Dated on 30/07/2022)"
            ],
            [
                "22-04-2022",
                "Intimation of allotment, pursuant to merger"
            ],
            [
                "19-05-2022",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/05/2022 inter alia to consider and approve to consider and approve the Audited Standalone and Consolidated Financial Results of the Company for the quarter and year ending on March 31 2022 and to recommend dividend if any for the financial year 2021-22. Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 19, 2022, inter alia, has recommended a final dividend of Rs. 30/- (600%) per equity share of Rs. 5/- each for the financial year 2021-22. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the 38th Annual General Meeting (AGM). Outcome of Board Meeting held on May 19, 2022 Results - Audited Financial Results for the year ended March 31, 2022. The Board recommended a final dividend of Rs.30/- (600%) per equity share of Rs. 5/- each for the financial year 2021-22. (As Per BSE Announcement Dated on 19.05.2022) The Register of Members and the Share Transfer Books of the Company shall remain closed from Wednesday, July 13, 2022 to Friday, July 15, 2022 (both days inclusive) for the purpose of the AGM and Dividend. Grant of Employee Stock Options (As Per BSE Announcement Dated on 20.05.2022)"
            ],
            [
                "28-01-2022",
                "Quarterly Results"
            ],
            [
                "28-01-2022",
                "DR.REDDYs LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/01/2022 inter alia to consider and approve Unaudited Financial Results of the Company for the quarter and nine months ending on December 31 2021 among other things Outcome of Board Meeting - Unaudited Financial Results for the quarter and nine months ended December 31, 2021. (As Per BSE Announcement dated on 28.01.2022) Intimation regarding filing of Form 6k (As per BSE Announcement Dated on 29/01/2022)"
            ],
            [
                "29-10-2021",
                "Quarterly Results Outcome of Board meeting and results of Q2FY22 Intimation (As Per BSE Announcement dated on 29.10.2021)"
            ],
            [
                "27-07-2021",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/07/2021 ,inter alia, to consider and approve the unaudited Financial Results of the Company for the quarter ending on June 30, 2021. Unaudited Financial Results for the quarter ended June 30, 2021 (As Per BSE Announcement Dated on 27.07.2021)"
            ],
            [
                "14-05-2021",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/05/2021 ,inter alia, to consider and approve Dr. Reddy''s Laboratories Limited has informed BSE that the meeting of the Board of Directors of the Company is scheduled on May 14, 2021, inter alia, to consider and approve the Audited Financial Results of the Company for the financial year ended March 31, 2021, and recommend dividend, if any, for the financial year 2020-21. Dr Reddys Laboratories Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on May 14, 2021, inter alia, to consider and approve the Audited Financial Results of the Company for the financial year ended March 31, 2021, and recommend dividend, if any, for the financial year 2020-21. Further, under the provisions of SEBI (Prohibition of Insider Trading) Regulations, 2015, the trading window for dealing in securities of the Company will be closed from April 01, 2021 to May 16, 2021 (both days inclusive). (As Per BSE Announcement dated on 29.03.2021) Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 14, 2021, inter alia, have recommended a final dividend of Rs. 25/- (500%) per equity share of Rs. 5/- face value for the financial year 2020-21. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the 37th Annual General Meeting (AGM). The AGM date and book closure date for the purpose of the payment of final dividend will be announced in due course. Outcome of Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2021. (As Per BSE Announcement Dated on 5/14/2021 1:20:10 PM)"
            ],
            [
                "29-01-2021",
                "Quarterly Results"
            ],
            [
                "29-01-2021",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2021 ,inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter and nine months ended December 31, 2020. Unaudited Financial Results for the quarter and nine months ended December 31, 2020. (AS Per BSE Announcement Dated on 29.01.2021)"
            ],
            [
                "28-10-2020",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2020 ,inter alia, to consider and approve Unaudited Financial Results of the Company for the quarter and half year ended September 30, 2020. Q2 and H1 FY21 financial results (As Per BSE Announcement dated on 28.10.2020)"
            ],
            [
                "29-07-2020",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/07/2020 ,inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter ended June 30, 2020. Outcome of Board Meeting- Unaudited Financial Results for the quarter ended June 30, 2020 (AS Per BSE Announcement Dated on 29.07.2020)"
            ],
            [
                "27-03-2020",
                "Outcome of Board meeting"
            ],
            [
                "20-05-2020",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/05/2020 ,inter alia, to consider and approve Audited Financial Results of the Company for the financial year ended March 31, 2020 and recommend dividend, if any, for the financial year 2019-20. Further, under the provisions of SEBI (Prohibition of Insider Trading) Regulations, 2015, the trading window for dealing in securities of the Company will be closed from April 01, 2020 and ending on May 15, 2020 (both days inclusive). DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/05/2020 ,inter alia, to consider and approve the Audited Financial Results of the Company for the financial year ended March 31, 2020 and recommend dividend, if any, for the financial year 2019-20 In this regard, please note that in view of COVID-19 situation, the meeting of the Board of Directors is now re-scheduled to Wednesday, May 20, 2020. Further, kindly also note that, under the provisions of SEBI (Prohibition of Insider Trading) Regulations, 2015, the trading window for dealing in securities of the Company has been closed from April 1, 2020 and will remain closed till May 22, 2020 (both days inclusive). Final Dividend (Revised) & Audited Results (As per BSE Bulletin Dated on 29/04/2020) Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 20, 2020, inter alia, have recommended a final dividend of Rs. 25/- (500%) per equity share of Rs. 5/- face value for the financial year 2019-20. The dividend will be paid on or after 5 days from the date of declaration of the final dividend by the shareholders at the 36th Annual General Meeting (AGM). Outcome of Board Meeting - - Audited Financial Results for the quarter and year ended March 31, 2020. Outcome of Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2020. Board meeting outcome (As Per BSE Announcement Dated on 5/20/2020 3:43:30 PM)"
            ],
            [
                "27-03-2020",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/03/2020 ,inter alia, to consider and approve Raising of funds through issuance of Commercial Papers"
            ],
            [
                "27-01-2020",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/01/2020 ,inter alia, to consider and approve Board Meeting scheduled on Monday, January 27, 2020, inter alia, for Unaudited Financial Results of the Company for the quarter and nine months ended December 31, 2019 Intimation regarding closure of trading window Newspaper publication for Board meeting (As Per BSE Announcement Dated 27.12.2019) Outcome of Board Meeting - Unaudited Financial Results for the quarter and nine months ended December 31, 2019. (As Per BSE Announcement Dated on 27/01/2020)"
            ],
            [
                "01-11-2019",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2019 ,inter alia, to consider and approve A meeting of the Board of Directors of the Company will be held on Friday, November 1, 2019, inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter and half-year ended September 30, 2019. Unaudited financial Results for quarter and half-year ended September 30, 2019 (As Per BSE Announcement Dated 1.11.2019) Newspaper publication for unaudited financial results for the quarter and half-year ended September 30, 2019. (As Per BSE Announcement Dated 4.11.2019)"
            ],
            [
                "01-11-2019",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2019 ,inter alia, to consider and approve A meeting of the Board of Directors of the Company will be held on Friday, November 1, 2019, inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter and half-year ended September 30, 2019."
            ],
            [
                "29-07-2019",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/07/2019 ,inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter ended June 30, 2019."
            ],
            [
                "17-05-2019",
                "Final Dividend & Audited Results"
            ],
            [
                "01-02-2019",
                "DR.REDDY''s LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/02/2019 ,inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter and nine months ended December 31, 2018. Further, kindly note that the Company''s trading window for dealing in securities by the ''Insiders'' is closed from Monday, January 7, 2019 and ending on Sunday, February 3, 2019 (both days inclusive)."
            ],
            [
                "26-10-2018",
                "DR.REDDYS LABORATORIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/10/2018 ,inter alia, to consider and approve the Unaudited Financial Results of the Company for the quarter and half-year ended September 30, 2018."
            ],
            [
                "26-07-2018",
                "Quarterly Results"
            ],
            [
                "22-05-2018",
                "Board Meeting Notice"
            ],
            [
                "25-01-2018",
                "Intimation of Board Meeting to be held on January 25, 2018."
            ],
            [
                "31-10-2017",
                "Quarterly Results"
            ],
            [
                "27-07-2017",
                "Quarterly Results"
            ],
            [
                "12-05-2017",
                "Pursuant to Regulation 29 of Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we hereby intimate you that a meeting of the Board of Directors of the Company will be held on Friday, May 12, 2017, inter alia, to consider and approve the Audited Financial Results of the Company for the financial year ended March 31, 2017 and recommend dividend, if any, for the financial year 2016-17. Further, kindly note that the Company's trading window for dealing in securities by the ?Insiders' is closed from Wednesday, April 26, 2017 and ending on Sunday, May 14, 2017 (both days inclusive)."
            ],
            [
                "04-02-2017",
                "Quarterly Results"
            ],
            [
                "25-10-2016",
                "Quarterly Results"
            ],
            [
                "26-07-2016",
                "Quarterly Results"
            ],
            [
                "12-05-2016",
                "Dividend & Audited Results"
            ],
            [
                "17-02-2016",
                "Buy Back of Shares"
            ],
            [
                "09-02-2016",
                "Quarterly Results"
            ],
            [
                "29-10-2015",
                "Quarterly Results"
            ],
            [
                "30-07-2015",
                "Quarterly Results"
            ],
            [
                "12-05-2015",
                "Final Dividend"
            ],
            [
                "12-05-2015",
                "Final Dividend"
            ],
            [
                "29-01-2015",
                "Quarterly Results"
            ],
            [
                "29-10-2014",
                "Quarterly Results"
            ],
            [
                "30-07-2014",
                "Quarterly Results"
            ],
            [
                "13-05-2014",
                "Audited Results & Dividend"
            ],
            [
                "11-02-2014",
                "Quarterly Results"
            ],
            [
                "31-10-2013",
                "Quarterly Results"
            ],
            [
                "30-07-2013",
                "Quarterly Results"
            ],
            [
                "14-05-2013",
                "Dividend & Audited Results"
            ],
            [
                "30-10-2012",
                "Quarterly Results"
            ],
            [
                "19-07-2012",
                "Quarterly Results"
            ],
            [
                "11-05-2012",
                "Audited Results & Dividend"
            ],
            [
                "03-02-2012",
                "Quarterly Results"
            ],
            [
                "25-10-2011",
                "Quarterly Results"
            ],
            [
                "20-07-2011",
                "Quarterly Results"
            ],
            [
                "13-05-2011",
                "Audited Results & Dividend"
            ],
            [
                "25-01-2011",
                "Quarterly Results"
            ],
            [
                "23-10-2010",
                "Quarterly Results"
            ],
            [
                "22-07-2010",
                "Quarterly Results"
            ],
            [
                "06-05-2010",
                "Audited Results & Dividend"
            ],
            [
                "31-03-2010",
                "Inter alia, to consider a proposal for the issuance of bonus debentures by the Company to its shareholders."
            ],
            [
                "20-01-2010",
                "Quarterly Results"
            ],
            [
                "23-10-2009",
                "Quarterly Results"
            ],
            [
                "21-07-2009",
                "Quarterly Results"
            ],
            [
                "18-05-2009",
                "Dividend & Audited Results"
            ],
            [
                "20-01-2009",
                "Quarterly Results"
            ],
            [
                "23-10-2008",
                "Board will consider a Scheme of Amalgamation in terms of which Periecan Pharma Pvt. Ltd, a wholly owned subsidiary of the Company will be amalgamated with Dr. Reddy's Laboratories Ltd.  & Quarterly Results"
            ],
            [
                "21-07-2008",
                "Quarterly Results"
            ],
            [
                "20-05-2008",
                "Audited Results & Dividend"
            ],
            [
                "25-01-2008",
                "Quarterly Results"
            ],
            [
                "24-10-2007",
                "Quarterly Results"
            ],
            [
                "23-07-2007",
                "Quarterly Results"
            ],
            [
                "18-05-2007",
                "Dividend & Audited Results"
            ],
            [
                "22-01-2007",
                "Quarterly Results"
            ],
            [
                "27-10-2006",
                "Quarterly Results"
            ],
            [
                "27-07-2006",
                "Quarterly Results"
            ],
            [
                "31-05-2006",
                "Dividend & Accounts"
            ],
            [
                "24-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "17-07-2024",
                "16-07-2024",
                "800%",
                "Recommended a final dividend of Rs. 40/- (800%) per equity share of Rs. 5/- each for the financial year 2023-24. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the ensuing 40th Annual General Meeting (AGM) of the Company."
            ],
            [
                "12-07-2023",
                "11-07-2023",
                "800%",
                "Outcome of Board Meeting held on May 10, 2023 - Audited Financial Results and recommendation of Dividend for FY23 Recommended a final dividend of Rs. 40/- (800%) per equity share of Rs. 5/- each for the financial year 2022-23. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the 39th Annual General Meeting (AGM). 39th Annual General Meeting (AGM) of the members of the Company scheduled to be held on Thursday, July 27, 2023. The Register of Members and the Share Transfer Books of the Company shall remain closed from Wednesday, July 12, 2023, to Friday, July 14, 2023 (both days inclusive) for the purpose of the Dividend and Annual General Meeting of the Company."
            ],
            [
                "13-07-2022",
                "11-07-2022",
                "600%",
                "Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 19, 2022, inter alia, has recommended a final dividend of Rs. 30/- (600%) per equity share of Rs. 5/- each for the financial year 2021-22. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the 38th Annual General Meeting (AGM)."
            ],
            [
                "13-07-2021",
                "09-07-2021",
                "500%",
                "Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 14, 2021, inter alia, have recommended a final dividend of Rs. 25/- (500%) per equity share of Rs. 5/- face value for the financial year 2020-21. The dividend will be paid on or after five days from the date of declaration of the final dividend by the shareholders at the 37th Annual General Meeting (AGM). The AGM date and book closure date for the purpose of the payment of final dividend will be announced in due course."
            ],
            [
                "15-07-2020",
                "13-07-2020",
                "500%",
                "Dr Reddys Laboratories Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 20, 2020, inter alia, have recommended a final dividend of Rs. 25/- (500%) per equity share of Rs. 5/- face value for the financial year 2019-20. The dividend will be paid on or after 5 days from the date of declaration of the final dividend by the shareholders at the 36th Annual General Meeting (AGM)."
            ],
            [
                "17-07-2019",
                "15-07-2019",
                "400%",
                "Outcome of Board Meeting - Dividend"
            ],
            [
                "17-07-2019",
                "15-07-2019",
                "400%",
                "Rs.20.0000 per share(400%)Final Dividend"
            ],
            [
                "18-07-2018",
                "16-07-2018",
                "400%",
                "Rs.20.0000 per share(400%)Final Dividend"
            ],
            [
                "19-07-2017",
                "17-07-2017",
                "400%",
                "Rs.20.0000 per share(400%)Dividend"
            ],
            [
                "20-07-2016",
                "18-07-2016",
                "400%",
                "Rs.20.0000 per share(400%)Dividend"
            ],
            [
                "14-07-2015",
                "10-07-2015",
                "400%",
                "Rs.20.0000 per share(400%)Final Dividend"
            ],
            [
                "15-07-2014",
                "11-07-2014",
                "360%",
                "Rs.18.0000 per share(360%)Final Dividend"
            ],
            [
                "16-07-2013",
                "12-07-2013",
                "300%",
                "Rs.15.0000 per share(300%)Final Dividend"
            ],
            [
                "03-07-2012",
                "28-06-2012",
                "275%",
                "Rs.13.75 per share(275%)Final Dividend"
            ],
            [
                "05-07-2011",
                "30-06-2011",
                "225%",
                "Rs.11.25 per share(225%)Final Dividend"
            ],
            [
                "06-07-2010",
                "02-07-2010",
                "225%",
                "Rs.11.25 per share(225%) Final Dividend"
            ],
            [
                "07-07-2009",
                "03-07-2009",
                "125%",
                "A.G.M. & Rs.6.25 per share(125%)Dividend"
            ],
            [
                "08-07-2008",
                "04-07-2008",
                "75%",
                "75% Dividend & A.G.M."
            ],
            [
                "10-07-2007",
                "06-07-2007",
                "75%",
                ""
            ],
            [
                "11-07-2006",
                "07-07-2006",
                "100%",
                "100% Final Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "28-10-2024",
                "28-10-2024",
                "1:5"
            ]
        ]
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "29-08-2006",
                "28-08-2006",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "Dr Reddy's Labs has not announced any rights for the last few years."
    }
}