{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "12-05-2025",
                "Quarterly Results"
            ],
            [
                "12-05-2025",
                "Tata Steel Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/05/2025 inter alia to consider and approve audited Standalone / Consolidated financial statements and results for the quarter / year ended 31.03.2025; recommendation of dividend if any for the financial year ended 31.03.2025; any other business matters. Outcome of Board Meeting of Tata Steel Limited (As Per BSE Announcement Dated on: 12/05/2025)"
            ],
            [
                "14-02-2025",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/02/2025 ,inter alia, to consider and approve issuance of unsecured Non-Convertible Debentures on private placement basis, within the limits approved by the Board of Directors of Tata Steel Limited at its meeting held on May 29, 2024. Outcome of the Meeting of Committee of Directors - Issue of Non-Convertible Debentures ('NCDs') aggregating to ?3,000 crore (As Per BSE Announcement Dated on 14.02.2025)"
            ],
            [
                "27-01-2025",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/01/2025 inter alia to consider and approve the audited Standalone and unaudited Consolidated Financial Results of the Company for the quarter and nine months ended December 31 2024 Outcome of Board Meeting of Tata Steel Limited The Board of Directors of Tata Steel Limited inter alia approved the Financial Results of the Company for the quarter and nine months ended December 31, 2024. (As per BSE Announcement Dated on 27/01/2025)"
            ],
            [
                "06-11-2024",
                "Quarterly Results"
            ],
            [
                "06-11-2024",
                "Quarterly Results Outcome of Board Meeting (As Per BSE Announcement dated on 06.11.2024)"
            ],
            [
                "31-07-2024",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/07/2024 inter alia to consider and approve the audited Standalone and unaudited Consolidated financial results of the Company for the quarter ended June 30 2024."
            ],
            [
                "29-05-2024",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/05/2024 inter alia to consider and approve and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31 2024 to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31 2024 and recommend dividend if any for the financial year ended March 31 2024 TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/05/2024 ,inter alia, to consider and approve We wish to inform that, the Board .... Read More.. (As Per BSE Announcement Dated on 26.05.2024) Outcome of Board Meeting (As Per BSE Announcement Dated on 29.05.2024)"
            ],
            [
                "19-03-2024",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/03/2024 inter alia to consider and approve This is to inform you that a meeting of the Committee of Directors of Tata Steel Limited (the Company) will be held on Tuesday March 19 2024 inter-alia to consider and approve the issuance of unsecured Non-Convertible Debentures on private placement basis."
            ],
            [
                "08-02-2024",
                "Allotment of 9,97,01,239 fully paid-up Ordinary Equity Shares of Tata Steel Limited to the eligible shareholders of Tata Metaliks Limited (''TML'') as on the record date of February 6, 2024, in terms of the Scheme of Amalgamation amongst Tata Steel Limited and TML and their respective shareholders"
            ],
            [
                "24-01-2024",
                "Quarterly Results"
            ],
            [
                "24-01-2024",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/01/2024 inter alia to consider and approve the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and nine months ended December 31 2023 Tata Steel Board inter alia approved the Financials for quarter and nine months ended December 31, 2023 and approved issuance of equity shares pursuant to the Scheme of Amalgamation of Tata Metaliks Limited into and with Tata Steel Limited. (As Per BSE Announcement Dated on 24/01/2024)"
            ],
            [
                "01-11-2023",
                "Quarterly Results"
            ],
            [
                "01-11-2023",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2023 inter alia to consider and approve the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and half year ended September 30 2023. Outcome of Board Meeting of Tata Steel Limited Issuance of equity shares pursuant to the Scheme of Amalgamation amongst Tata Steel Long Products Limited and Tata Steel Limited and their respective shareholders (As per BSE Announcement Dated on 01/11/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "24-07-2023",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/07/2023 inter alia to consider and approve and take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter ended June 30 2023 The Board inter alia approved the Audited Standalone and Unaudited Consolidated Financial Results of the Company for the quarter ended June 30, 2023. The financial information as required to be provided in terms of Regulation 52 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 forms part of the Financial Results. (As per BSE Announcement Dated on 24/07/2023)"
            ],
            [
                "02-05-2023",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 02/05/2023 ,inter alia, to consider and approve to consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2023; to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2023; recommend dividend, if any, for the financial year ended March 31, 2023 Final Dividend & Audited Results (As per BSE Bulletin dated on 17/04/2023) Board approved:- Recommended a dividend of Rs.3.60 per Ordinary (Equity) Share of Re.1/- each (360%) to the shareholders of the Company for the FY2022-23. The dividend recommended by the Board of Directors of the Company is subject to the approval of the shareholders at the ensuing Annual General Meeting (AGM) of the Company scheduled to be held on Wednesday, July 5, 2023. The dividend, if approved by the shareholders at the AGM, will be paid, subject to deduction of tax at source, on and from Monday, July 10, 2023. (As Per BSE Bulletin Dated on 02.05.2023) Outcome of Board Meeting held on May 2, 2023 (As Per BSE Announcement Dated on 02.05.2023)"
            ],
            [
                "27-03-2023",
                "Outcome of Board Meeting"
            ],
            [
                "20-02-2023",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/02/2023 inter alia to consider and approve This is to inform you that a meeting of the Committee of Directors of Tata Steel Limited (the Company) will be held on Monday February 20 2023 inter-alia to consider and approve the issuance of unsecured Non-Convertible Debentures on private placement basis within the limits approved by the Board of Directors of the Company at its meetings held on August 13 2018 and April 24 2020. Outcome of the Meeting of Committee of Directors - Issue of Non-Convertible Debentures aggregating to ?2,150 crore (As per BSE Announcement Dated on 20/02/2023)"
            ],
            [
                "06-02-2023",
                "Quarterly Results"
            ],
            [
                "06-02-2023",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/02/2023 inter alia to consider and approve the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and nine months ended December 31 2022. The Board of Tata Steel Limited at its meeting held today, inter alia, approved the Financial Results for quarter and nine months ended December 31, 2022, and approved the Scheme of Amalgamation of Angul Energy Limited, subsidiary company, into and with Tata Steel Limited Results - Financial Results for quarter and nine months ended December 31, 2022 (As Per BSE Announcement Dated on 06.02.2023)"
            ],
            [
                "23-11-2022",
                "Appointment of Ms. Bharti Gupta Ramola (DIN: 00356188) as an Additional Director (Non-Executive, Independent) effective November 25, 2022"
            ],
            [
                "31-10-2022",
                "Quarterly Results"
            ],
            [
                "31-10-2022",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/10/2022 inter alia to consider and approve The audited Standalone and unaudited Consolidated Financial Results of the Company for the quarter and half year ended September 30 2022 The Board of Directors of Tata Steel Limited at its Meeting held today i.e., Monday, October 31, 2022, inter alia, approved the financial results of the Company for quarter and half year ended September 30, 2022 and approved the re-appointment of Mr. Koushik Chatterjee as the Whole-time Director Results - Financial Results for quarter and half year ended September 30, 2022 The Board, based on the recommendation of the NRC, has approved the re-appointment of Mr. Koushik Chatterjee as the WTD (As Per BSE Announcement Dated on 31.10.2022)"
            ],
            [
                "22-09-2022",
                "Intimation of the schemes of amalgamation involving Tata Steel Limited, the identified transferor companies and their respective shareholders"
            ],
            [
                "14-09-2022",
                "Inter-alia, to consider and approve the issuance of unsecured Non-Convertible Debentures on private placement basis, within the limits approved by the Board of Directors at their meetings held on August 13, 2018 and April 24, 2020."
            ],
            [
                "25-07-2022",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2022 inter alia to consider and approve The audited Standalone and unaudited Consolidated financial results of the Company for the quarter ended June 30 2022 Outcome of Board Meeting Results - Financial Results - Q1FY23 (As per BSE Announcement Dated on 25/07/2022)"
            ],
            [
                "03-05-2022",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/05/2022 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited ('the Company') will be held on Tuesday, May 3, 2022, inter alia: 1. to consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2022; 2. to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2022; 3. recommend dividend, if any, for the financial year ended March 31, 2022; and 4. to consider a proposal for sub-division of the Equity shares of the Company having a face value of Rs.10/- each, in such manner as may be determined by the Board of Directors, subject to regulatory/statutory approvals as may be required and the approval of the shareholders of the Company. The Board at its meeting held today approved, inter alia, the audited financial results of the Company for quarter and year ended March 31, 2022 Board at its meeting held today, inter alia, approved the audited financial results of the Company for quarter and year ended March 31, 2022, dividend, sub-division of equity shares, AGM date, fixing book closure date and re-appointment of statutory auditors, subject to shareholder approval. Investor Presentation on on the Financial Results of Tata Steel Limited for the quarter and financial year ended March 31, 2022 The Board, based on the recommendation of the Audit Committee, has re-appointed Price Waterhouse & Co Chartered Accountants LLP, Chartered Accountants, as the statutory auditors of the Company for a second term of 5 years to hold office from the conclusion of the 115th AGM to be held on June 28, 2022 through the conclusion of the 120th AGM of the Company to be held in the year 2027, subject to approval of shareholders of the Company. (As Per BSE Announcement Dated on 03.05.2022) Tata Steel Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 03, 2022, inter alia, has considered the proposal for sub-division of 1 equity share of the Company having face value of Rs. 10/- each into 10 (Ten) equity shares having face value of Rs. 1/- each, subject to regulatory/statutory approvals as may be required and the approval of the shareholders of the Company. Further, the Board recommended consequential amendments in the Capital Clause of the Memorandum of Association of the Company and Articles of Association of the Company, subject to approval of the Shareholders of the Company. The record date for the sub-division of equity shares shall be decided by the Board and will be intimated to the exchanges. (As Per BSE Announcement dated on 04.05.2022)"
            ],
            [
                "04-02-2022",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2022 inter alia to consider and approve TATA STEEL LTD. has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2022 to consider and approve inter alia and to take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and nine months ended December 31 2021. Outcome of Board Meeting held on February 4, 2022 (As Per BSE Announcement Dated on 04.02.2022)"
            ],
            [
                "11-11-2021",
                "Quarterly Results"
            ],
            [
                "11-11-2021",
                "Quarterly Results Audited Standalone and Unaudited Consolidated Financial Statements (As Per BSE Announcement Dated 11.11.2021)"
            ],
            [
                "12-08-2021",
                "Quarterly Results"
            ],
            [
                "12-08-2021",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/08/2021 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited will be held on Thursday, August 12, 2021, inter alia, to consider and take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter ended June 30, 2021. Outcome of Board Meeting held on August 12, 2021 Financial Results for quarter ended June 30, 2021 Appointment of Ms. Farida Khambata as an Additional Director (Non-Executive, Independent) (As per BSE Announcement Dated on 12/8/2021)"
            ],
            [
                "05-05-2021",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/05/2021 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited ('the Company') will be held on Wednesday, May 5, 2021, inter alia: 1. to consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2021; 2. to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2021; and 3. recommend dividend, if any, for the financial year ended March 31, 2021. Newspaper Advertisement - Notice of Board Meeting to be held on Wednesday, May 5, 2021 (As Per BSE Announcement Dated on 30/04/2021) Outcome of Board Meeting Tata Steel Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 05, 2021, inter alia, has recommended a dividend of Rs. 25/- per fully paid-up Ordinary Share of Rs. 10/- each (250%) to the shareholders of the Company for the Financial Year ended March 31, 2021. Further, in respect of the outstanding partly paid-up Ordinary Shares of the Company on which call money remains unpaid as on the date of book closure for the dividend payment, the dividend will be paid in proportion to the amount paid-up on such shares i.e. Rs. 6.25 per partly paid-up Ordinary Share of Rs. 10/- each (paid-up Rs. 2.504 per share) (250%). (AS Per BSE Announcement Dated on 05.05.2021)"
            ],
            [
                "09-02-2021",
                "Quarterly Results"
            ],
            [
                "09-02-2021",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/02/2021 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited ('the Company') will be held on Tuesday, February 9, 2021, inter alia, to consider and take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and nine months ended December 31, 2020. Approval of financial results and making of first and final call on Partly-Paid Shares of the Company (As per BSE Announcement Dated on 9/2/2021)"
            ],
            [
                "13-11-2020",
                "Quarterly Results"
            ],
            [
                "13-11-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/11/2020 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited will be held on Friday, November 13, 2020, inter alia, to consider and take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter and half year ended September 30, 2020. The Board of Directors of Tata Steel Limited at its meeting held today, i.e. November 13, 2020, inter alia, transacted the following business: a. Financial Results and b. Exercise of Call Option in respect of Non-Convertible Debentures/Perpetual Hybrid Securities of the Company (As per BSE Announcement Dated on 13/11/2020)"
            ],
            [
                "13-08-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/08/2020 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited will be held on Thursday, August 13, 2020, inter alia, to consider and take on record the audited Standalone and unaudited Consolidated financial results of the Company for the quarter ended June 30, 2020. The Board of Directors of Tata Steel Limited at its meeting held today, i.e. August 13, 2020, approved the audited Standalone and unaudited Consolidated Financial Results of the Company for the quarter ended June 30, 2020. A copy of the said Results together with the Auditors'' Report and Press Release are enclosed herewith. (As per BSE Announcement Dated on 13/8/2020)"
            ],
            [
                "29-06-2020",
                "Tata Steel Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on June 29, 2020, inter alia:1. to consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2020;2. to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2020; and3. recommend dividend, if any, for the financial year ended March 31, 2020.Further, in accordance with the Company's Code for Prevention of Insider Trading, the Trading Window for dealing in the Company's securities was closed from March 25, 2020. TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/06/2020 ,inter alia, to consider and approve A meeting of the Board of Directors of Tata Steel Limited will be held on Monday, June 29, 2020, inter alia: 1. to consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2020; 2. to consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2020; and 3. recommend dividend, if any, for the financial year ended March 31, 2020. Further, in accordance with the Company's Code for Prevention of Insider Trading, the Trading Window for dealing in the Company's securities was closed from March 25, 2020. (As Per BSE Announcement Dated on 26.06.2020) Recommended a dividend of Rs. 10/- per Ordinary Share of Rs. 10/- each (100%) and Rs. 2.504 per partly paid Ordinary Share of Rs. 10/- each (paid-up Rs. 2.504 per share) (100%) to the shareholders for the Financial Year ended March 31, 2020. (As Per BSE Announcement Dated on 29.06.2020)"
            ],
            [
                "24-04-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/04/2020 ,inter alia, to consider and approve Fund Raising The Board of Directors of Tata Steel Limited inter alia, approved issue of additional debt securities up to Rs5,000 crore in the form of Non-Convertible Debentures ('NCDs') on private placement basis in one or more tranches ('Issue'). The Board also authorized a Committee of Directors to determine and approve the quantum, timing and terms & conditions of the NCDs (As Per BSE Announcement dated on 24.04.2020)"
            ],
            [
                "13-04-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/04/2020 ,inter alia, to consider and approve This is to inform you that a meeting of the Committee of Directors of Tata Steel Limited will be held on Monday, April 13, 2020, inter-alia, to consider and approve the issuance of unsecured Non-Convertible Debentures on private placement basis, within the limits approved by the Board of Directors at their meeting held on August 13, 2018. Inter alia the Committee of Directors has approved the issue of debt of Up to 70,000 NCDs of face value Rs. 10,00,000 each aggregating up to Rs.7,000 crore to be issued in one or more issues, as per the terms and conditions given. (Please see company Board outcome announcement on bse website: www.bseindia.com) (As Per BSE Bulletin Dated on 15.04.2020)"
            ],
            [
                "09-03-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/03/2020 ,inter alia, to consider and approve issuance of unsecured Non-Convertible Debentures on private placement basis Outcome of the Meeting - Issue of Unsecured, Redeemable, Listed, Rated Non-Convertible Debentures aggregating Rs. 670 crore"
            ],
            [
                "07-02-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2020 ,inter alia, to consider and approve Audited Standalone & Unaudited Consolidated Financial Results for the Quarter and nine months ended December 31, 2019 Q3FY20 Financial Results Outcome (As Per BSE Announcement Dated on 07/02/2020)"
            ],
            [
                "07-02-2020",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2020 ,inter alia, to consider and approve Audited Standalone & Unaudited Consolidated Financial Results for the Quarter and nine months ended December 31, 2019"
            ],
            [
                "06-11-2019",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/11/2019 ,inter alia, to consider and approve Audited Standalone and Unaudited Consolidated financial results of the Company for the quarter and half year ended September 30, 2019. Outcome of the Board Meeting held on November 6, 2019. The Board of Directors of Tata Steel Limited (''the Company'') at its meeting held today, i.e. November 6, 2019, approved the audited Standalone and unaudited Consolidated Financial Results of the Company for the quarter and half year ended September 30, 2019. (As Per BSE Announcement Dated 6.11.2019)"
            ],
            [
                "07-08-2019",
                "Quarterly Results"
            ],
            [
                "25-04-2019",
                "Tata Steel Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on April 25, 2019, inter alia: 1. To consider and take on record the audited Standalone and unaudited Consolidated financial statements and results for the quarter ended March 31, 2019; 2. To consider and take on record the audited Standalone and Consolidated financial statements and results for the financial year ended March 31, 2019; and 3. recommend dividend, if any, for the financial year ended March 31, 2019. Further, in accordance with the Company's Code for Prevention of Insider Trading, the Trading Window for dealing in the Company's securities was closed from March 25, 2019 and will open 48 hours after the said financial results are declared to the Stock Exchanges."
            ],
            [
                "26-02-2019",
                "TATA STEEL LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/02/2019 ,inter alia, to consider and approve This is to inform you that a meeting of the Committee of Directors of Tata Steel Limited will be held on Tuesday, February 26, 2019, inter-alia, to consider and approve the issuance of unsecured Non-Convertible Debentures on private placement basis, within the limits approved by the Shareholders at the Annual General Meeting of the Company held on July 20, 2018 and as approved by the Board of Directors at their meeting held on August 13, 2018. This notice is being submitted pursuant to Regulation 29(1)(d) of the SEBI (Listing Obligation and Disclosure Requirements) Regulations, 2015."
            ],
            [
                "08-02-2019",
                "Quarterly Results"
            ],
            [
                "13-11-2018",
                "Quarterly Results"
            ],
            [
                "13-08-2018",
                "inter-alia, consider the issuance of unsecured Non-Convertible Debentures ('NCDs') on private placement basis, within the limits approved by the Shareholders at the Annual General Meeting of the Company held on July 20, 2018."
            ],
            [
                "16-05-2018",
                "Board Meeting on May 16, 2018"
            ],
            [
                "03-04-2018",
                "This is to inform you that a meeting of the Board of Directors of Tata Steel Limited ('the Company') will be held on Tuesday, April 3, 2018, inter-alia to consider and approve the issuance of unsecured Non-Convertible Debentures ('NCDs') on private placement basis, within the limits approved by the shareholders at the Annual General Meeting of the Company held on August 8, 2017. This communication is issued in terms of Regulation 29(1)(d) of the SEBI (Listing Obligation and Disclosure Requirements) Regulations, 2015. Thanking you."
            ],
            [
                "09-02-2018",
                "Quarterly Results"
            ],
            [
                "18-12-2017",
                "This is to inform you that a meeting of the Board of Directors of the Company will be held on December 18, 2017 and will continue and conclude on December 19, 2017,to consider, inter alia, a proposal for raising of funds by issue of equity shares or other securities including through qualified institutions placement, rights issue, preferential issue or through any other permissible mode or a combination thereof, subject to such regulatory/ statutory approvals as may be required, including approval of shareholders of the Company, if applicable (the 'Issue'). The proposal for the Issue will be considered by the Board of Directors of the Company on December 19, 2017. This intimation is issued in terms of Regulation 29(1)(d) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015. This is for your information and records."
            ],
            [
                "19-12-2017",
                "A meeting of the Board of Directors of the Company will be held on December 18, 2017 and will continue and conclude on December 19, 2017,to consider, inter alia, a proposal for raising of funds by issue of equity shares or other securities including through qualified institutions placement, rights issue, preferential issue or through any other permissible mode or a combination thereof, subject to such regulatory/ statutory approvals as may be required, including approval of shareholders of the Company, if applicable (the \"Issue\"). The proposal for the Issue will be considered by the Board of Directors of the Company on December 19, 2017."
            ],
            [
                "30-10-2017",
                "As attached"
            ],
            [
                "07-08-2017",
                "Quarterly Results"
            ],
            [
                "16-05-2017",
                "Audited Results & Dividend"
            ],
            [
                "20-04-2017",
                "A meeting of the Board of Directors of the Company will be held on Thursday, April 20, 2017, inter-alia to consider a proposal for fund raising"
            ],
            [
                "07-02-2017",
                "Quarterly Results"
            ],
            [
                "11-11-2016",
                "Quarterly Results"
            ],
            [
                "12-09-2016",
                "Quarterly Results"
            ],
            [
                "25-05-2016",
                "Dividend & Audited Results"
            ],
            [
                "04-02-2016",
                "Quarterly Results"
            ],
            [
                "05-11-2015",
                "Quarterly Results"
            ],
            [
                "11-08-2015",
                "Quarterly Results"
            ],
            [
                "20-05-2015",
                "Dividend & Audited Results"
            ],
            [
                "06-02-2015",
                "Quarterly Results"
            ],
            [
                "12-11-2014",
                "Quarterly Results"
            ],
            [
                "13-08-2014",
                "Quarterly Results"
            ],
            [
                "14-05-2014",
                "Dividend & Audited Results"
            ],
            [
                "11-02-2014",
                "Quarterly Results"
            ],
            [
                "13-11-2013",
                "Quarterly Results"
            ],
            [
                "13-08-2013",
                "Quarterly Results"
            ],
            [
                "23-05-2013",
                "Dividend & Audited Results"
            ],
            [
                "13-02-2013",
                "Quarterly Results"
            ],
            [
                "09-11-2012",
                "Quarterly Results"
            ],
            [
                "13-08-2012",
                "Quarterly Results"
            ],
            [
                "18-05-2012",
                "Dividend & Audited Results"
            ],
            [
                "09-02-2012",
                "Quarterly Results"
            ],
            [
                "10-11-2011",
                "Quarterly Results"
            ],
            [
                "12-08-2011",
                "Quarterly Results"
            ],
            [
                "25-05-2011",
                "Dividend & Audited Results"
            ],
            [
                "11-04-2011",
                "inter alia, to consider a proposal to restructure Centennial Steel Company Limited, a wholly owned subsidiary of the Company."
            ],
            [
                "15-02-2011",
                "Quarterly Results"
            ],
            [
                "12-08-2010",
                "Quarterly Results"
            ],
            [
                "26-05-2010",
                "Dividend & Audited Results"
            ],
            [
                "16-02-2010",
                "Quarterly Results inter alia, to consider and take on record the Consolidated Financial Results of the Company for the quarter / nine months ended December 31, 2009."
            ],
            [
                "28-01-2010",
                "Quarterly Results"
            ],
            [
                "26-11-2009",
                "Quarterly Results Consolidated   Financial Results for quarter / six months ended 30.09.2009"
            ],
            [
                "27-10-2009",
                "Quarterly Results"
            ],
            [
                "27-08-2009",
                "Inter alia, will also consider payment of pro-rata interim dividend for the period April 01, 2009 to August 31, 2009 on the 2% Cumulative Convertible Preference Shares (CCPS) of the Company."
            ],
            [
                "27-08-2009",
                "Inter alia, will also consider payment of pro-rata interim dividend for the period April 01, 2009 to August 31, 2009 on the 2% Cumulative Convertible Preference Shares (CCPS) of the Company."
            ],
            [
                "29-07-2009",
                "Quarterly Results"
            ],
            [
                "25-06-2009",
                "Dividend & Audited Results"
            ],
            [
                "27-02-2009",
                "Quarterly Results inter alia, to take on record the Consolidated Financial Results for the quarter / nine months ended 31st December, 2008."
            ],
            [
                "28-01-2009",
                "Quarterly Results"
            ],
            [
                "02-12-2008",
                "Quarterly Results Consolidated Fin. Results for the quarter / half year ended 30th Sept., 2008."
            ],
            [
                "28-11-2008",
                "Consolidated Financial Results of the Company for the quarter (Q2) / six months ended September 30, 2008."
            ],
            [
                "24-10-2008",
                "Quarterly Results"
            ],
            [
                "26-06-2008",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2008",
                "Quarterly Results"
            ],
            [
                "26-10-2007",
                "Quarterly Results"
            ],
            [
                "30-07-2007",
                "Quarterly Results"
            ],
            [
                "17-05-2007",
                "Dividend & Audited Results"
            ],
            [
                "17-04-2007",
                "to consider possible proposals for raising equity funds as part of its long-term fund raising exercise to finance the Company's investment in the SPV (Special Purpose Vehicle) for acquiring Corns Group Plc, UK."
            ],
            [
                "30-01-2007",
                "Quarterly Results"
            ],
            [
                "30-10-2006",
                "Quarterly Results & Half Yearly Results"
            ],
            [
                "21-07-2006",
                "Quarterly Results"
            ],
            [
                "18-05-2006",
                ""
            ],
            [
                "23-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "06-06-2025",
                "06-06-2025",
                "360%",
                "The Board Recommended a dividend of ?3.60 per Ordinary (Equity) Share of face value ?1/- each (360%) to the shareholders of the Company for FY2024-25."
            ],
            [
                "21-06-2024",
                "21-06-2024",
                "360%",
                "Recommended a dividend of ?3.60 per Ordinary (Equity) Share of face value ?1/- each (360%) to the shareholders of the Company for FY2023-24."
            ],
            [
                "23-06-2023",
                "22-06-2023",
                "360%",
                "Board approved:- Recommended a dividend of Rs.3.60 per Ordinary (Equity) Share of Re.1/- each (360%) to the shareholders of the Company for the FY2022-23. Dividend will be paid on and from Monday, July 10, 2023"
            ],
            [
                "17-06-2022",
                "15-06-2022",
                "510%",
                "Board recommended a dividend of Rs 51 per fully paid-up Ordinary Share of Rs 10/- each (510%) to the shareholders of the Company for the Financial Year ended March 31, 2022. Further, in respect of the outstanding partly paid-up Ordinary Shares of the Company on which call money remains unpaid as on the date of book closure for the dividend payment, the dividend will be paid in proportion to the amount paid-up on such shares, i.e., Rs 12.75 per partly paid-up Ordinary Share of Rs 10/- each (paid-up Rs 2.504 per share) (510%). The dividend, if approved by the shareholders at the AGM to be held on June 28, 2022, will be paid, subject to deduction of tax at source, on and from June 30, 2022."
            ],
            [
                "19-06-2021",
                "17-06-2021",
                "250%",
                "Outcome of Board Meeting Tata Steel Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 05, 2021, inter alia, has recommended a dividend of Rs. 25/- per fully paid-up Ordinary Share of Rs. 10/- each (250%) to the shareholders of the Company for the Financial Year ended March 31, 2021. Further, in respect of the outstanding partly paid-up Ordinary Shares of the Company on which call money remains unpaid as on the date of book closure for the dividend payment, the dividend will be paid in proportion to the amount paid-up on such shares i.e. Rs. 6.25 per partly paid-up Ordinary Share of Rs. 10/- each (paid-up Rs. 2.504 per share) (250%). Communication to Shareholders - Intimation on Tax Deduction on Dividend (As Per BSE announcement Dated 19.05.2021)"
            ],
            [
                "08-08-2020",
                "06-08-2020",
                "100%",
                "Recommended a dividend of Rs. 10/- per Ordinary Share of Rs. 10/- each (100%) and Rs. 2.504 per partly paid Ordinary Share of Rs. 10/- each (paid-up Rs. 2.504 per share) (100%) to the shareholders for the Financial Year ended March 31, 2020."
            ],
            [
                "06-07-2019",
                "04-07-2019",
                "130%",
                "The Board of Directors at the meeting held today, i.e. April 25, 2019, inter alia, approved the audited standalone and consolidated financial results for the financial year ended March 31, 2019, approved dividend and fixed the book closure date for AGM and payment of dividend."
            ],
            [
                "06-07-2019",
                "04-07-2019",
                "130%",
                "Rs.13.0000 per share(130%)Dividend"
            ],
            [
                "07-07-2018",
                "05-07-2018",
                "100%",
                "Rs.10.0000 per share(100%)Dividend"
            ],
            [
                "22-07-2017",
                "20-07-2017",
                "100%",
                "Rs.10.0000 per share(100%)Dividend"
            ],
            [
                "30-07-2016",
                "28-07-2016",
                "80%",
                "Rs.8.0000 per share(80%)Dividend"
            ],
            [
                "25-07-2015",
                "23-07-2015",
                "80%",
                "Rs.8.0000 per share(80%)Dividend"
            ],
            [
                "16-07-2014",
                "14-07-2014",
                "100%",
                "Rs.10.0000 per share(100%)Dividend"
            ],
            [
                "17-07-2013",
                "15-07-2013",
                "80%",
                "Rs.8.0000 per share(80%)Dividend"
            ],
            [
                "18-07-2012",
                "16-07-2012",
                "120%",
                "inter alia, has recommended a dividend of Rs. 12/- per Ordinary Share of Rs. 10 each to the shareholders for the year ended March 31, 2012, subject to the approval of the shareholders at the Annual General Meeting (AGM) of the Company scheduled to be held on August 14, 2012."
            ],
            [
                "06-07-2011",
                "04-07-2011",
                "120%",
                "Rs.12.00 per share(120%)Dividend"
            ],
            [
                "14-07-2010",
                "12-07-2010",
                "80%",
                "Rs.8.00 per share(80%)Dividend"
            ],
            [
                "08-07-2009",
                "06-07-2009",
                "160%",
                "Rs.16.00 per share(160%)Dividend"
            ],
            [
                "21-07-2008",
                "18-07-2008",
                "160%",
                ""
            ],
            [
                "12-06-2007",
                "08-06-2007",
                "155%",
                "A.G.M. & 155% Dividend ( 130% for the year 2006-07 and special"
            ],
            [
                "30-05-2006",
                "26-05-2006",
                "130%",
                "A.G.M.& 130% Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "29-07-2022",
                "28-07-2022",
                "1:10"
            ]
        ]
    },
    "bonus": {
        "title": "Bonus",
        "msg": "Tata Steel has not announced any bonus for the last few years."
    },
    "rights": {
        "msg": "",
        "title": "Rights",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio",
            "Premium"
        ],
        "data": [
            [
                "01-02-2018",
                "31-01-2018",
                "4:25",
                "500"
            ],
            [
                "05-11-2007",
                "29-10-2007",
                "1:5",
                "290"
            ]
        ]
    }
}