[
    {
        "title": "Announcement under Regulation 30 (LODR)-Press Release / Media Release 31 May - Kotak Mahindra Bank announces Deputy MD retirement and appoints Paritosh Kashyap as Executive Director.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=0f9820a8-e0c1-4b8a-be5f-b050e589ddc7.pdf",
        "date": "31 May - Kotak Mahindra Bank announces Deputy MD retirement and appoints Paritosh Kashyap as Executive Director."
    },
    {
        "title": "Appointment Of Secretarial Auditor 31 May - Kotak Mahindra Bank appoints Parikh & Associates as secretarial auditor for FY 2025-26 to 2029-30.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=856cca40-ee05-4e33-b408-be2d9265fe5c.pdf",
        "date": "31 May - Kotak Mahindra Bank appoints Parikh & Associates as secretarial auditor for FY 2025-26 to 2029-30."
    },
    {
        "title": "Intimation Under Regulation 30 Of The SEBI (LODR) Regulations, 2015 - Change In Director / Key Managerial Personnel / Changes In Senior Management Personnel 31 May - Kotak Mahindra Bank announces retirement of DMD, appoints new Whole-time Director and key compliance officers.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=848951bc-7fc0-4768-93a2-1ca668b4d5a3.pdf",
        "date": "31 May - Kotak Mahindra Bank announces retirement of DMD, appoints new Whole-time Director and key compliance officers."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Change in Directorate 31 May - Kotak Bank announces retirement of DMD, appoints new Whole-time Director, CCO, and Head of Internal Audit.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=33af62be-af4d-4370-9333-5412690f2374.pdf",
        "date": "31 May - Kotak Bank announces retirement of DMD, appoints new Whole-time Director, CCO, and Head of Internal Audit."
    },
    {
        "title": "Compliances-Reg.24(A)-Annual Secretarial Compliance 30 May - Kotak Mahindra Bank's FY25 Annual Secretarial Compliance Report with minor non-material regulatory deviations.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=06ad186d-2fbb-4bf4-baa1-b39a7235171a.pdf",
        "date": "30 May - Kotak Mahindra Bank's FY25 Annual Secretarial Compliance Report with minor non-material regulatory deviations."
    }
]