[
    {
        "title": "Commercial Operation Of First Unit Of 250 MW Of Tehri PSP (4X250 MW) Of THDC India Limited, A Subsidiary Of NTPC Limited. 2h - First 250 MW unit of Tehri PSP declared commercial from 07.06.2025; NTPC capacity now 80,515 MW.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=e8947114-49e2-4ae7-9299-1dde7353aace.pdf",
        "date": "2h - First 250 MW unit of Tehri PSP declared commercial from 07.06.2025; NTPC capacity now 80,515 MW."
    },
    {
        "title": "Please Find Attached Herewith Disclosure Dated 05.06.2025 Made By Our Subsidiary NTPC Green Energy Limited Titled 'Disclosure Under Regulation 30 Of The SEBI (LODR) Regulations, 2015' Regarding Declaration Of COD Of First Part Capacity Of 110.25 MW Out Of 1255 MW Khavda 1 Solar PV Project In Gujarat Of NTPC Renewable Energy Limited (NTPC REL), A Stepdown Subsidiary Of NTPC Limited Through Its Subsidiary NTPC Green Energy Limited. 7h - 110.25 MW capacity of 1255 MW Khavda-1 Solar PV Project declared commercial from 06.06.2025.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=239ca8c6-243c-4bd9-909d-6025b8d902f6.pdf",
        "date": "7h - 110.25 MW capacity of 1255 MW Khavda-1 Solar PV Project declared commercial from 06.06.2025."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Change in Management 1 Jun - Executive Directors Shoba Pattabhiraman retired; R. Sarangapani ceased as Key Managerial Personnel.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=309adf47-56bf-4e04-bbb4-7cf2180028c7.pdf",
        "date": "1 Jun - Executive Directors Shoba Pattabhiraman retired; R. Sarangapani ceased as Key Managerial Personnel."
    },
    {
        "title": "Disclosure Under Regulation 30 Of SEBI (LODR) Regulations, 2015 Regarding Notices Received From Stock Exchanges 30 May - NTPC fined Rs.14.16 lakh by NSE and BSE for SEBI LODR non-compliance; company claims compliance now.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=ea20e2d1-3553-4f06-ab2b-e2dfbeeb273f.pdf",
        "date": "30 May - NTPC fined Rs.14.16 lakh by NSE and BSE for SEBI LODR non-compliance; company claims compliance now."
    },
    {
        "title": "Announcement under Regulation 30 (LODR)-Earnings Call Transcript 29 May - Transcript of Conference Call held with Analysts and Investors on 24 May 2025",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=c980c3da-489d-44fe-9fde-673929110123.pdf",
        "date": "29 May - Transcript of Conference Call held with Analysts and Investors on 24 May 2025"
    }
]