{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "13-05-2025",
                "Hero Motocorp Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/05/2025 inter alia to consider and approve the Audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31 2025 and to consider and recommend the final dividend if any for the financial year 2024-25 The Board of Directors at its meeting held today, viz. May 13, 2025 has considered and approved the matters given in the attached file. (As Per BSE Announcement dated on 13.05.2025)"
            ],
            [
                "06-02-2025",
                "Quarterly Results"
            ],
            [
                "06-02-2025",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/02/2025 inter alia to consider and approve the unaudited standalone and consolidated financial results for the quarter and nine months period ended on December 31 2024. The Board of Directors at its meeting held today viz. February 6, 2025 has considered and approved the matters given in the attached file. (As per BSE Announcement Dated on 06/02/2025)"
            ],
            [
                "14-11-2024",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/11/2024 inter alia to consider and approve the unaudited standalone and consolidated financial results for the quarter and half year ended on September 30 2024. The Board of Directors at its meeting held today viz. November 14, 2024 has approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2024. A copy of the said results along with the limited review report, is enclosed. (As per BSE Announcement dated on 14/11/2024)"
            ],
            [
                "13-08-2024",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/08/2024 inter alia to consider and approve the unaudited standalone and consolidated financial results for the quarter ended on June 30 2024."
            ],
            [
                "25-06-2024",
                "Please note that the Board of Directors at its meeting held today, viz. June 25, 2024 has subject to the approval of the shareholders of the Company , approved the re-appointment of Ms. Tina Trikha as an Independent Director for a second term of 5 years with effect from October 23, 2024 up to October 22, 2029, Ms. Camille Miki Tang as an Independent Director for a second term of 3 years with effect from November 19, 2024 up to November 18, 2027, Mr. Rajnish Kumar as an independent Director for a second term of 3 years with effect from November 25, 2024 up to November 24, 2027 , Mr. Vikram Sitaram Kasbekar as Whole-time Director, designated as Executive Director (Operations) for a term of 3 years with effect from August 8, 2024 up to August 7, 2027 and appointment of Director in place of Mr. Pradeep Dinodia who is retiring by rotation and being eligible has offered himself for re-appointment. requisite details as required under regulation 30 are enclosed in the annexure."
            ],
            [
                "08-05-2024",
                "Quarterly Results"
            ],
            [
                "08-05-2024",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/05/2024 inter alia to consider and approve the Audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31 2024 and to consider and recommend the final dividend if any for the financial year 2023-24. The Board of Directors at its meeting held today viz. May 8, 2024 has considered and approved the matters given in the attached file The Board of Directors at is meeting held today, viz. May 8, 2024 has considered and approved the matter given in the attached file. (As Per BSE Announcement Dated on 08.05.2024)"
            ],
            [
                "09-02-2024",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/02/2024 inter alia to consider and approve a. the unaudited standalone and consolidated financial results for the quarter and nine months period ended on December 31 2023 b. declaration of interim dividend if any for the financial year 2023-24 1. Interim Dividend @3750%, i.e. Rs. 75 per equity shares and a special dividend @1250% i.e. Rs. 25 per equity shares, taking overall interim dividend @5000% i.e. Rs. 100 per equity share for the financial year 2023-24, marking the centennial year of Chairman Emeritus Dr. Brijmohan Lall Munjal. Accordingly, the Board has fixed February 21, 2024 as record date for determining entitlement of members for the purpose of payment of interim & special dividend. The payment of dividend / dispatch of dividend warrants will be completed by March 09, 2024 (As Per BSE Bulletin Dated on 09.02.2024)"
            ],
            [
                "01-11-2023",
                "Quarterly Results"
            ],
            [
                "01-11-2023",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2023 inter alia to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and half year ended on September 30 2023. The Board of Directors at its meeting held today, viz. November 1, 2023 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today viz. November 1, 2023 has approved standalone & consolidated financial results for the quarter and half year ended September 30, 2023. Please find the update regarding the revision in remuneration of the Executive Chairman of the Company. (As Per BSE Announcement dated on 01.11.2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "10-08-2023",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/08/2023 inter alia to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter ended on June 30 2023. The Board of Directors at its meeting held today has approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2023. A copy of the said results along with the limited review report, is enclosed. A press release issued in this regard, is also enclosed. (As per BSE Announcement Dated on 10/08/2023)"
            ],
            [
                "04-05-2023",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/05/2023 inter alia to consider and approve the audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31 2023 and to consider and recommend the final dividend if any for the financial year 2022-23. The Board of Directors at its meeting held today, viz. May 4, 2023, recommended final dividend subject to approval of members @ 1750% i.e. Rs. 35 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 8, 2023. The Board of Directors at its meeting held today, viz. May 4, 2023 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today, viz. May 4, 2023, has considered and approved the audited standalone and consolidated financial results for the quarter and financial year ended March 31, 2023. A copy of duly signed audited financial results along with audit reports and declaration in respect of audit reports with unmodified opinion under Regulation 33 of Listing Regulations, is enclosed. A press release issued in this regard, is also enclosed. Prof. Jagmohan Singh Raju has been re-appointed as an Independent Director for a term of five (5) years with effect from November 15, 2023 up to November 14, 2028 subject to the approval of shareholders at the ensuing Annual General Meeting of the Company. Prof. Raju is not debarred from holding the office of Director by virtue of any order of SEBI or any other such authority and he is not disqualified to be re-appointed as an Independent Director. Requisite details as required under Regulation 30 are enclosed in the Annexure. (As Per BSE Announcement Dated on 04.05.2023)"
            ],
            [
                "07-02-2023",
                "Quarterly Results"
            ],
            [
                "07-02-2023",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2023 inter alia to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31 2022. HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/02/2023 ,inter alia, to consider and approve This is with reference to our letter dated January 19, 2023, wherein we have informed that a meeting of the Board of Directors has been scheduled for February 7, 2023, inter-alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31, 2022. In this regard, we wish to inform that at the same meeting, viz. on February 7, 2023, the Board will also consider declaration of interim dividend, if any, for the financial year 2022-23. This is with reference to our letter dated January 19, 2023, wherein we have informed that a meeting of the Board of Directors has been scheduled for February 7, 2023, inter-alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31, 2022. In this regard, we wish to inform that at the same meeting, viz. on February 7, 2023, the Board will also consider declaration of interim dividend, if any, for the financial year 2022-23. (As Per BSE Announcement Dated on 31.01.2023) The Board of Directors at its meeting held today, viz. February 7, 2023, has considered and approved interim dividend @ 3,250% i.e. Rs. 65 per equity share (face value of Rs. 2 per equity share) for the financial year 2022-23. Accordingly, the Board has fixed February 17, 2023 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 9, 2023. The Board of Directors at its meeting held today, viz. February 7, 2023 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today, viz. February 7, 2023, has considered and approved the unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2022. A copy of the said results along with the limited review report, is enclosed. A press release issued in this regard, is also enclosed. The updated Code of Practices and Procedures of Fair Disclosure of Unpublished Price Sensitive Information is enclosed herewith. (As Per BSE Announcement Dated on 07.02.2023)"
            ],
            [
                "03-11-2022",
                "Quarterly Results HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/11/2022 ,inter alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and half year ended on September 30, 2022. (As Per BSE Announcement Dated on 26.10.2022) The Board of Directors at its meeting held today, viz. November 3, 2022 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today has approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2022. A copy of the said results along with the limited review report, is enclosed. A press release issued in this regard, is also enclosed. (As per BSE Announcement Dated on 03/11/2022)"
            ],
            [
                "12-08-2022",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/08/2022 inter alia to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter ended on June 30 2022. In this regard an earnings conference call with analysts / investors is also being scheduled on Saturday August 13 2022 at 10.30 am a copy of the invite is attached. This is for your information and further dissemination. The Board of Directors at its meeting held today has approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2022. A copy of the said results along with the limited review report, is enclosed. A press release issued in this regard, is also enclosed. The meeting of the Board of Directors commenced at 2:30 p.m. and concluded at 5:30 p.m. Kindly take the aforesaid information on your records. (As per BSE Announcement Dated on 12/08/2022)"
            ],
            [
                "03-05-2022",
                "Quarterly Results"
            ],
            [
                "03-05-2022",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/05/2022 inter alia to consider and approve the audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31 2022 and to consider and recommend the final dividend if any for the financial year 2021-22. This is for your information and further dissemination. Recommendation of final dividend subject to approval of members @ 1,750% i.e. Rs. 35 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 8, 2022. The Board of Directors at its meeting held today, viz. May 03, 2022 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today, viz. May 03, 2022, has considered and approved the audited standalone and consolidated financial results for the quarter and financial year ended March 31, 2022. A copy of duly signed audited financial results along with audit reports and declaration in respect of audit report with unmodified opinion under Regulation 33 of Listing Regulations, is enclosed. A press release issued in this regard, is also enclosed. The meeting of the Board of Directors commenced at 6.25 p.m. and concluded at 9.15 p.m. Kindly take the aforesaid information on your records. (As Per BSE Announcement Dated on 03.05.2022)"
            ],
            [
                "24-01-2022",
                "The Board of Directors of the Company, in its meeting held on 24th January 2022, has appointed Mr. Dhiraj Kapoor as the Company Secretary & Compliance Officer of the Company effective February 1, 2022. The relevant details are attached as Annexure B. This is for your information and records."
            ],
            [
                "10-02-2022",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/02/2022 inter alia to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31 2021. This is with reference to our letter dated January 21, 2022, wherein we have informed that a meeting of the Board of Directors has been scheduled for February 10, 2022, inter-alia, to consider and approve the Unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31, 2021. In this regard, we wish to inform that at the same meeting, viz. on February 10, 2022, the Board will also consider declaration of interim dividend, if any, for the financial year 2021-22. This is for your information and further dissemination. (As Per BSE Announcement Dated on 03-02-2022) The Board of Directors at its meeting held today, viz. February 10, 2022, has considered and approved interim dividend @ 3000% i.e. Rs. 60 per equity share (face value of Rs. 2 per equity share) for the financial year 2021-22. Accordingly, the Board has fixed February 22, 2022 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 12, 2022. Kindly take the aforesaid information on your records. (As Per BSE Announcement Dated on 10.02.2022)"
            ],
            [
                "13-01-2022",
                "The Board of Directors of the Company, in its meeting held on 13th January 2022, has approved an investment of up to INR 420 crore (Rupees Four Hundred Twenty Crore) in one or more tranches, in Ather Energy Private Limited. The investment is subject to execution of definitive documents and completion of certain conditions customary to a transaction of this nature. The requisite information is disclosed in the Annexure. A release issued by the Company in this regard is also enclosed. This is for your information and records."
            ],
            [
                "12-11-2021",
                "Quarterly Results"
            ],
            [
                "12-11-2021",
                "Quarterly Results HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/11/2021 ,inter alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and half year ended September 30, 2021. The Board of Directors at its meeting held today, viz. November 12, 2021 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today, viz. November 12, 2021 has considered and approved the matters given in the attached file. Appointment of Ms. Camille Tang as an Additional and Independent Director, with effect from November 19, 2021, for a tenure of three years, subject to the approval of shareholders. The requisite details are provided in the enclosed letter. (As per BSE Announcement Dated on 12/11/2021)"
            ],
            [
                "12-08-2021",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/08/2021 ,inter alia, to consider and approve unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2021. This is for your information and further dissemination. The Board of Directors at its meeting held today has approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2021. A copy of the said results along with the limited review report is enclosed. A press release issued in this regard is also enclosed. The meeting of the Board of Directors commenced at 4:15 p.m. and concluded at 6:20 p.m. Kindly take the aforesaid information on your records. (As per BSE Announcement Dated on 12/8/2021)"
            ],
            [
                "06-05-2021",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/05/2021 ,inter alia, to consider and approve the audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31, 2021 and to consider and recommend the final dividend, if any, for the financial year 2020-21. Recommendation of final dividend subject to approval of members @ 1250% i.e. Rs. 25 per share and special dividend @ 500% i.e Rs 10 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 3, 2021 The Board of Directors at its meeting held today, viz. May 6, 2021 has considered and approved the matters given in the attached file. (As Per BSE Announcement Dated on 06.05.2021)"
            ],
            [
                "04-02-2021",
                "Quarterly Results"
            ],
            [
                "04-02-2021",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2021 ,inter alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31, 2020. In this regard, an earnings conference call with analysts / investors is also being scheduled on Friday, February 5, 2021 at 11.30 am, a copy of the invite is attached. This is for your information and further dissemination. Quarterly Results & Interim Dividend (As per BSE Bulletin Dated on 01/02/2021) The Board of Directors has declared an Interim dividend @3250% i.e. Rs. 65 per equity share (face value of Rs. 2 per equity share) for the financial year 2020-21. Further, the Board has also declared a special interim dividend of Rs.100 crores @250% i.e. Rs. 5 per equity share, to mark the achievement of historic milestone of achieving 100 million cumulative production of two wheelers, taking the aggregate interim dividend declared to 3500% i.e. Rs. 70 per equity share. Accordingly, the Board has fixed February 16, 2021 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 6, 2021. (As Per BSE Announcement Dated on 04.02.2021)"
            ],
            [
                "28-10-2020",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2020 ,inter alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter and half year ended September 30, 2020. The Board of Directors at its meeting held today, viz. October 28, 2020 has considered and approved the matters given in the attached file. (As Per BSE Announcement dated on 28.10.2020)"
            ],
            [
                "13-08-2020",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/08/2020 ,inter alia, to consider and approve the unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2020. The Board of Directors at its meeting held today, viz. August 13, 2020 has considered and approved the matters given in the attached file. (As per BSE Announcement Dated on 13/8/2020)"
            ],
            [
                "09-06-2020",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/06/2020 ,inter alia, to consider and approve the Audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31, 2020 and to consider and recommend the final dividend, if any, for the financial year 2019-20. This is for your information and further dissemination. Recommendation of final dividend subject to approval of members @ 1250% viz., INR 25 per equity share of INR 2/- each for the financial year 2019-20. The dividend, if declared at the ensuing AGM, will be paid by September 11, 2020. The Board of Directors at its meeting held today, viz. June 9, 2020 has considered and approved the matters given in the attached file. (As Per BSE Announcement Dated on 09.06.2020)"
            ],
            [
                "06-02-2020",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 06/02/2020 ,inter alia, to consider and approve the unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2019. We write in furtherance to our letter dated January 6, 2020, wherein we informed that a meeting of the Board of Directors has been scheduled for February 6, 2020, inter-alia, to consider and approve the Unaudited Standalone and Consolidated Financial Results for the quarter and nine months ended December 31, 2019. We wish to inform that at the same meeting, viz. on February 6, 2020, the Board will also consider declaration of interim dividend, if any, for the financial year 2019-20. This is for your information and further dissemination. (As Per BSE Announcement Dated on 03.02.2020) The Board of Directors has declared an interim dividend of INR 65/- per equity share of INR 2/- each (at the rate of 3250%) for the financial year 2019-20. Accordingly, the Board has fixed February 18, 2020 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend / despatch of dividend warrants will be completed by March 6, 2020. Kindly take the aforesaid information on your records. The Board of Directors at its meeting held today, viz. February 6, 2020 has considered and approved the matters given in the attached file. The Board, at its meeting held today, viz. February 6, 2020, has noted that the tenure of Ms. Shobana Kamineni on the Board would end effective March 26, 2020 due to completion of her term of 5 years as an Independent Director. The Company places on record its appreciation for the guidance and support provided by Ms. Kamineni during her tenure. The requisite details as per Regulation 30 are enclosed as Annexure A. Kindly take the aforesaid information on your records. (As Per BSE Announcement Dated on 06/02/2020) Please find enclosed herewith a copy of the newspaper advertisement published regarding fixation of record date for the interim dividend declared by the Board of Directors at its meeting held on February 6, 2020. This is submitted for your information and records. (As Per BSE Announcement dated on 08.02.2020)"
            ],
            [
                "23-10-2019",
                "Quarterly Results"
            ],
            [
                "23-10-2019",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2019 ,inter alia, to consider and approve the unaudited standalone and consolidated financial results for the quarter and half year ending September 30, 2019. The Board of Directors at its meeting held today, viz. October 23, 2019 has considered and approved the matters given in the attached file. The Board of Directors at its meeting held today, viz. October 23, 2019, has considered and approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2019. A copy of the said results and limited review report alongwith the press release being issued by the Company in this regard, is enclosed. The meeting of the Board of Directors commenced at 2:00 p.m. and concluded at 4:55 p.m. Kindly take the aforesaid information on your records. The Board of Directors at its meeting held today, viz. October 23, 2019, has approved shifting of registered office of the Company within Delhi from its current location i.e. 34, Community Centre, Basant Lok, Vasant Vihar, New Delhi - 110057. (As Per BSE Announcement Dated on 23/10/2019) We write in furtherance to our letter dated October 23, 2019 wherein we informed that the Board of Directors has approved shifting of registered office of the Company within Delhi. In this regard, please take note of the new Registered Office Address as under. Hero MotoCorp Limited The Grand Plaza Plot No. 2, Nelson Mandela Road Vasant Kunj - Phase-II New Delhi - 110 070 Request you to kindly take the same on your records. (As per BSE Announcement dated on 02/12/2019)"
            ],
            [
                "30-07-2019",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/07/2019 ,inter alia, to consider and approve unaudited standalone and consolidated financial results for the quarter ending June 30, 2019."
            ],
            [
                "26-04-2019",
                "Final Dividend & Audited Results"
            ],
            [
                "31-01-2019",
                "HERO MOTOCORP LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2019 ,inter alia, to consider and approve Pursuant to Regulation 29 and other applicable Regulations of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday, January 31, 2019, inter-alia, to consider and approve the Unaudited Financial Results for the quarter and nine months ended December 31, 2018."
            ],
            [
                "16-10-2018",
                "The Board of Directors at its meeting held today, viz. October 16, 2018, has appointed Prof. Jagmohan Singh Raju as an Additional and Independent Director, with effect from November 15, 2018 for a tenure of five years. In this regard, we wish to confirm that Prof. Raju is not disqualified/ debarred from being appointed to the office of Director by virtue of any order of SEBI or any other such authority. The disclosure pursuant to Regulation 30 of the Listing Regulations is enclosed as Annexure A. Kindly take the aforesaid information on your records."
            ],
            [
                "25-07-2018",
                "Quarterly Results"
            ],
            [
                "02-05-2018",
                "Final Dividend & Audited Results"
            ],
            [
                "06-02-2018",
                "Interim Dividend"
            ],
            [
                "01-11-2017",
                "A meeting of the Board of Directors of the Company is scheduled to be held on Wednesday, November 1, 2017, inter-alia, to consider and approve the Unaudited Financial Results for the quarter and half year ended September 30, 2017."
            ],
            [
                "25-07-2017",
                "Quarterly Results"
            ],
            [
                "10-05-2017",
                "Audited Results & Pursuant to Regulation 29 and other applicable Regulations of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Wednesday, May 10, 2017, inter?alia, to consider and approve the Audited Standalone and Consolidated Financial Results for the quarter and financial year ended March 31, 2017 and to consider and recommend the final dividend, if any, for the financial year 2016-17. & Final Dividend"
            ],
            [
                "07-03-2017",
                "Interim Dividend"
            ],
            [
                "08-02-2017",
                "Quarterly Results"
            ],
            [
                "26-10-2016",
                "Quarterly Results"
            ],
            [
                "08-08-2016",
                "Quarterly Results"
            ],
            [
                "05-05-2016",
                "Final Dividend"
            ],
            [
                "10-03-2016",
                "Interim Dividend"
            ],
            [
                "11-02-2016",
                "Quarterly Results"
            ],
            [
                "20-10-2015",
                "Quarterly Results"
            ],
            [
                "03-08-2015",
                "Quarterly Results"
            ],
            [
                "07-05-2015",
                "Audited Results & Final Dividend"
            ],
            [
                "03-02-2015",
                "Quarterly Results"
            ],
            [
                "16-10-2014",
                "Quarterly Results"
            ],
            [
                "05-08-2014",
                "Interim Dividend"
            ],
            [
                "05-08-2014",
                "Interim Dividend"
            ],
            [
                "28-05-2014",
                "Audited Results & Dividend"
            ],
            [
                "30-01-2014",
                "Quarterly Results"
            ],
            [
                "23-10-2013",
                "Quarterly Results"
            ],
            [
                "24-07-2013",
                "Quarterly Results"
            ],
            [
                "26-04-2013",
                "Dividend & Audited Results"
            ],
            [
                "17-01-2013",
                "Quarterly Results"
            ],
            [
                "23-10-2012",
                "Quarterly Results"
            ],
            [
                "19-07-2012",
                "Quarterly Results"
            ],
            [
                "04-06-2012",
                "inter alia, to consider and approve the following: 1. The proposal of Amalgamation of HIPL with HMCL; 2. The Scheme of Amalgamation; 3. The Valuation report; 4. The Fairness Opinion; and 5. Other matters incidental and connected to the said proposal."
            ],
            [
                "02-05-2012",
                "Audited Results & Final Dividend"
            ],
            [
                "19-01-2012",
                "Quarterly Results"
            ],
            [
                "18-10-2011",
                "Quarterly Results"
            ],
            [
                "21-07-2011",
                "Quarterly Results"
            ],
            [
                "04-05-2011",
                "Audited Results & Final Dividend"
            ],
            [
                "13-04-2011",
                "Interim Dividend"
            ],
            [
                "02-02-2011",
                "Quarterly Results"
            ],
            [
                "29-10-2010",
                "Quarterly Results"
            ],
            [
                "29-07-2010",
                "Quarterly Results"
            ],
            [
                "19-04-2010",
                "Dividend & Audited Results"
            ],
            [
                "30-03-2010",
                "Special Interim Dividend"
            ],
            [
                "25-01-2010",
                "Quarterly Results"
            ],
            [
                "21-10-2009",
                "Quarterly Results"
            ],
            [
                "29-07-2009",
                "Quarterly Results"
            ],
            [
                "21-04-2009",
                "Dividend & Audited Results"
            ],
            [
                "20-01-2009",
                "Quarterly Results"
            ],
            [
                "21-10-2008",
                "Quarterly Results"
            ],
            [
                "29-07-2008",
                "Quarterly Results"
            ],
            [
                "24-04-2008",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2008",
                "Quarterly Results"
            ],
            [
                "18-10-2007",
                "Quarterly Results"
            ],
            [
                "24-07-2007",
                "Quarterly Results"
            ],
            [
                "11-05-2007",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2007",
                "Quarterly Results"
            ],
            [
                "25-10-2006",
                "Quarterly Results"
            ],
            [
                "11-07-2006",
                "Quarterly Results"
            ],
            [
                "30-05-2006",
                "Accounts & Dividend"
            ],
            [
                "30-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "12-02-2025",
                "12-02-2025",
                "5000%",
                "Interim Dividend @5000%, i.e. Rs. 100/- per equity share, having nominal value of Rs. 2/- ach for the financial year 2024-25. Accordingly, the Board has fixed February 12, 2025 s record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of dividend / dispatch of dividend warrants will be completed by March 08, 2025"
            ],
            [
                "02-08-2024",
                "01-08-2024",
                "2000%",
                "Board Meeting held today i.e. Wednesday, May 8, 2024: Recommendation of final dividend @ 2,000% i.e. Rs. 40/- per share (face value of Rs. 2 per equity share), subject to approval of the members of the Company at the ensuing 41st Annual General Meeting. The payment of dividend / dispatch of dividend warrants will be completed within 30 days of declaration at the ensuing Annual General Meeting (AGM)."
            ],
            [
                "21-02-2024",
                "21-02-2024",
                "1250%",
                "1. Interim Dividend @3750%, i.e. Rs. 75 per equity shares and a special dividend @1250% i.e. Rs. 25 per equity shares, taking overall interim dividend @5000% i.e. Rs. 100 per equity share for the financial year 2023-24, marking the centennial year of Chairman Emeritus Dr. Brijmohan Lall Munjal. Accordingly, the Board has fixed February 21, 2024 as record date for determining entitlement of members for the purpose of payment of interim & special dividend. The payment of dividend / dispatch of dividend warrants will be completed by March 09, 2024"
            ],
            [
                "21-02-2024",
                "21-02-2024",
                "3750%",
                "1. Interim Dividend @3750%, i.e. Rs. 75 per equity shares and a special dividend @1250% i.e. Rs. 25 per equity shares, taking overall interim dividend @5000% i.e. Rs. 100 per equity share for the financial year 2023-24, marking the centennial year of Chairman Emeritus Dr. Brijmohan Lall Munjal. Accordingly, the Board has fixed February 21, 2024 as record date for determining entitlement of members for the purpose of payment of interim & special dividend. The payment of dividend / dispatch of dividend warrants will be completed by March 09, 2024"
            ],
            [
                "28-07-2023",
                "27-07-2023",
                "1750%",
                "The Board of Directors at its meeting held today, viz. May 4, 2023, recommended final dividend subject to approval of members @ 1750% i.e. Rs. 35 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 8, 2023."
            ],
            [
                "17-02-2023",
                "17-02-2023",
                "3250%",
                "The Board of Directors at its meeting held today, viz. February 7, 2023, has considered and approved interim dividend @ 3,250% i.e. Rs. 65 per equity share (face value of Rs. 2 per equity share) for the financial year 2022-23. Accordingly, the Board has fixed February 17, 2023 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 9, 2023."
            ],
            [
                "29-07-2022",
                "27-07-2022",
                "1750%",
                "Recommendation of final dividend subject to approval of members @ 1,750% i.e. Rs. 35 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 8, 2022."
            ],
            [
                "22-02-2022",
                "21-02-2022",
                "3000%",
                "The Board of Directors at its meeting held today, viz. February 10, 2022, has considered and approved interim dividend @ 3000% i.e. Rs. 60 per equity share (face value of Rs. 2 per equity share) for the financial year 2021-22. Accordingly, the Board has fixed February 22, 2022 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 12, 2022. Kindly take the aforesaid information on your records."
            ],
            [
                "24-07-2021",
                "22-07-2021",
                "500%",
                "Recommendation of final dividend subject to approval of members @ 1250% i.e. Rs. 25 per share and special dividend @ 500% i.e Rs 10 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 3, 2021"
            ],
            [
                "24-07-2021",
                "22-07-2021",
                "1250%",
                "Recommendation of final dividend subject to approval of members @ 1250% i.e. Rs. 25 per share and special dividend @ 500% i.e Rs 10 per share (face value of Rs. 2 per equity share). The dividend, if declared at the ensuing AGM, will be paid by September 3, 2021"
            ],
            [
                "16-02-2021",
                "15-02-2021",
                "250%",
                "The Board of Directors has declared an Interim dividend @3250% i.e. Rs. 65 per equity share (face value of Rs. 2 per equity share) for the financial year 2020-21. Further, the Board has also declared a special interim dividend of Rs.100 crores @250% i.e. Rs. 5 per equity share, to mark the achievement of historic milestone of achieving 100 million cumulative production of two wheelers, taking the aggregate interim dividend declared to 3500% i.e. Rs. 70 per equity share. Accordingly, the Board has fixed February 16, 2021 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 6, 2021."
            ],
            [
                "16-02-2021",
                "15-02-2021",
                "3250%",
                "The Board of Directors has declared an Interim dividend @3250% i.e. Rs. 65 per equity share (face value of Rs. 2 per equity share) for the financial year 2020-21. Further, the Board has also declared a special interim dividend of Rs.100 crores @250% i.e. Rs. 5 per equity share, to mark the achievement of historic milestone of achieving 100 million cumulative production of two wheelers, taking the aggregate interim dividend declared to 3500% i.e. Rs. 70 per equity share. Accordingly, the Board has fixed February 16, 2021 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend/ dispatch of dividend warrants will be completed by March 6, 2021."
            ],
            [
                "03-08-2020",
                "30-07-2020",
                "1250%",
                "Recommendation of final dividend subject to approval of members @ 1250% viz., INR 25 per equity share of INR 2/- each for the financial year 2019-20. The dividend, if declared at the ensuing AGM, will be paid by September 11, 2020."
            ],
            [
                "18-02-2020",
                "17-02-2020",
                "3250%",
                "The Board of Directors has declared an interim dividend of INR 65/- per equity share of INR 2/- each (at the rate of 3250%) for the financial year 2019-20. Accordingly, the Board has fixed February 18, 2020 as record date for determining entitlement of members for the purpose of payment of interim dividend. The payment of interim dividend / despatch of dividend warrants will be completed by March 6, 2020. Kindly take the aforesaid information on your records."
            ],
            [
                "18-07-2019",
                "16-07-2019",
                "1600%",
                "Recommendation of final dividend subject to approval of members @ 1600% viz., INR 32 per equity share of INR 2/- each for the financial year 2018-19. The dividend, if declared at the ensuing AGM, will be paid by August 28, 2019."
            ],
            [
                "18-07-2019",
                "16-07-2019",
                "1600%",
                "Rs.32.0000 per share(1600%)Final Dividend"
            ],
            [
                "12-02-2019",
                "11-02-2019",
                "2750%",
                "Rs.55.0000 per share(2750%)Interim Dividend"
            ],
            [
                "13-07-2018",
                "11-07-2018",
                "2000%",
                "Rs.40.0000 per share(2000%)Final Dividend"
            ],
            [
                "17-02-2018",
                "15-02-2018",
                "2750%",
                "Rs.55.0000 per share(2750%)Interim Dividen"
            ],
            [
                "04-07-2017",
                "30-06-2017",
                "1500%",
                "Rs.30.0000 per share(1500%)Final Dividend"
            ],
            [
                "18-03-2017",
                "16-03-2017",
                "2750%",
                "05/04/2017 Equity Rs.55.0000 per share(2750%)Interim Dividend"
            ],
            [
                "17-09-2016",
                "15-09-2016",
                "1600%",
                "Rs.32.0000 per share(1600%)Final Dividend"
            ],
            [
                "22-03-2016",
                "21-03-2016",
                "2000%",
                "Rs.40.0000 per share(2000%)Interim Dividend"
            ],
            [
                "03-06-2015",
                "01-06-2015",
                "1500%",
                "Rs.30.0000 per share(1500%)Final Dividend"
            ],
            [
                "11-08-2014",
                "08-08-2014",
                "1500%",
                "Interim Dividend"
            ],
            [
                "05-07-2014",
                "03-07-2014",
                "3250%",
                "Rs.65.0000 per share(3250%)Dividend"
            ],
            [
                "05-09-2013",
                "03-09-2013",
                "3000%",
                "Rs.60.0000 per share(3000%)Dividend"
            ],
            [
                "09-08-2012",
                "07-08-2012",
                "2250%",
                "Rs.45.00 per share(2250%)Final Dividend & A.G.M."
            ],
            [
                "27-08-2011",
                "25-08-2011",
                "1750%",
                "Rs.35.00 per share(1750%)Final Dividend"
            ],
            [
                "21-04-2011",
                "20-04-2011",
                "3500%",
                "Interim Dividend"
            ],
            [
                "01-09-2010",
                "30-08-2010",
                "1500%",
                "Rs.30.00 per share(1500%)Dividend"
            ],
            [
                "15-04-2010",
                "13-04-2010",
                "4000%",
                "Special Silver Jubilee Dividend"
            ],
            [
                "01-09-2009",
                "28-08-2009",
                "1000%",
                "1000 % Dividend"
            ],
            [
                "11-09-2008",
                "09-09-2008",
                "950%",
                "950% Dividend A.G.M."
            ],
            [
                "12-07-2007",
                "10-07-2007",
                "850%",
                "850% Dividend & A.G.M."
            ],
            [
                "17-08-2006",
                "14-08-2006",
                "1000%",
                "A.G.M. & 1000% Dividend"
            ]
        ]
    },
    "splits": {
        "title": "Split",
        "msg": "Hero MotoCorp has not announced any stock split for the last few years."
    },
    "bonus": {
        "title": "Bonus",
        "msg": "Hero MotoCorp has not announced any bonus for the last few years."
    },
    "rights": {
        "title": "Rights",
        "msg": "Hero MotoCorp has not announced any rights for the last few years."
    }
}