{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "28-04-2025",
                "Intimation of grant of options pursuant to Employee Stock Option Scheme, 2009"
            ],
            [
                "29-04-2025",
                "Bajaj Finance Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/04/2025 inter alia to consider and approve the audited financial results of the Company for the quarter and year ended 31 March 2025. The Board meeting commenced at 2:30 p.m. and concluded at 4:40 p.m. (As Per BSE Announcement Dated on: 29/04/2025)"
            ],
            [
                "20-03-2025",
                "The Board of Directors, based on the recommendation of the Nomination and Remuneration Commitee has approved the elevation of Rajeev Jain (DIN: 01550158) as the Vice Chairman in the capacity of Executive Director for a period of three years w.e.f. 1 April 2025 and re-designation of Anup Kumar Saha (DIN: 07640220) as Managing Director w.e.f. 1 April 2025, for the remainder of his term i.e., upto 31 March 2028."
            ],
            [
                "29-01-2025",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2025 inter alia to consider and approve the unaudited financial results of the Company for the quarter and nine months ended 31 December 2024. The Board Meeting today commenced at 4:00 p.m. and consideration of financial results for the quarter and nine months ended 31 December 2024 was approved at 5.15 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. Unaudited standalone and consolidated financial results for the quarter and nine months ended 31 December 2024 (As Per BSE Announcement dated on 29.01.2025)"
            ],
            [
                "22-10-2024",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/10/2024 inter alia to consider and approve unaudited standalone and consolidated financial results for the quarter and half year ended 30 September 2024. The Board Meeting today commenced at 5.00 p.m. and consideration of financial results for the quarter and half year ended 30 September 2024 was approved at 5.30 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. (As Per BSE Announcement Dated on: 22/10/2024)"
            ],
            [
                "23-07-2024",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/07/2024 inter alia to consider and approve unaudited standalone and consolidated financial results for the quarter ending 30 June 2024. The Board Meeting commenced at 1:45 p.m. and concluded at 3:25 p.m. for consideration of financial results for the quarter ended 30 June 2024. Unaudited standalone and consolidated financial results for the quarter ended 30 June 2024 (As per BSE Announcement Dated on 23/07/2024)"
            ],
            [
                "07-06-2024",
                "Intimation under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 - Offer for Sale"
            ],
            [
                "25-04-2024",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/04/2024 inter alia to consider and approve the standalone and consolidated audited financial results of the Company for the quarter and year ending 31 March 2024 and recommend dividend on equity shares if any for the year ending 31 March 2024. Final Dividend & Audited Results (As per BSE Bulletin dated on 01/04/2024) The Board Meeting today commenced at 4:30 p.m. and recommendation of dividend and consideration of financial results for the quarter and year ended 31 March 2024 was approved at 5:15 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. Annual General Meeting of the Company will be held on Tuesday, 23 July 2024. Further details will be provided in due course. A dividend of Rs. 36 per share (1800%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the Financial Year ended 31 March 2024. The said dividend, if declared, by the shareholders at the ensuing annual general meeting, will be credited/dispatched on or about 26 July 2024 or 27 July 2024 The Board of Directors, based on the recommendation of the Nomination and Remuneration Committee, has recommended to the Shareholders, the appointment of Shri Tarun Bajaj as an Independent Director of the Company for a period of 5 years, commencing from 1 August 2024 The Board recommended for approval of Members and in accordance with policy for appointment of Auditors, the appointment of Price Waterhouse LLP and Kirtane & Pandit LLP, Chartered Accountants as Joint Statutory Auditors. Audited standalone and consolidated financial results for the quarter and year ended 31 March 2024 A dividend of Rs. 36 per share (1800%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the Financial Year ended 31 March 2024. The said dividend, by the Shareholders at the ensuing Annual General Meeting, will be credited/ dispatched on or about 26 July 2024 or 27 July 2024. (As per BSE Announcement Dated on 25/04/2024)"
            ],
            [
                "29-01-2024",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2024 inter alia to consider and approve the unaudited standalone and consolidated financial results of the Company for the quarter and nine months ending 31 December 2023 Resignation of Shri Rakesh Bhatt (DIN: 02531541) as an Executive Director of the Company w.e.f. close of business hours on 31 January 2024. The Board Meeting today commenced at 3:30 p.m. and consideration of financial results for the quarter and nine months ended 31 December 2023 was approved at 4:35 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. Unaudited standalone and consolidated financial results for the quarter and nine months ended 31 December 2023. The Board of Directors of the Company at its meeting held today, i.e., 29 January 2024 approved raising of funds. Re-appointment of Director and Changes in Key Managerial Personnel (As per BSE Announcement Dated on 29/01/2024)"
            ],
            [
                "09-11-2023",
                "BAJAJ FINANCE LIMITED has informed BSE about Board Meeting to be held on 09 Nov 2023 to consider Other business."
            ],
            [
                "01-11-2023",
                "Issue Of Warrants Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2023 ,inter alia, to consider and approve We wish to inform you that a meeting of the Preferential Issue Special Committee of the Board of Directors of the Company is scheduled to be held on Wednesday, 1 November 2023, subject to obtaining approval from the shareholders in the meeting scheduled on 31 October 2023. (As Per BSE Announcement dated on 26.10.2023)"
            ],
            [
                "17-10-2023",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/10/2023 inter alia to consider and approve the unaudited standalone and consolidated financial results of the Company for the quarter and half year ending 30 September 2023 The Board Meeting today commenced at 2.45 p.m. and consideration of financial results for the quarter and half year ended 30 September 2023 was approved at 3.40 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. Unaudited standalone and consolidated financial results for the quarter and half year ended 30 September 2023 (As Per BSE Announcement dated on 17.10.2023)"
            ],
            [
                "05-10-2023",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/10/2023 inter alia to consider and approve proposal for raising of funds through any or all of various methods including by way of preferential issue qualified institutions placement subject to such regulatory/statutory approvals as may be required including approval of the shareholders of the Company. Outcome of Meeting of the Board of Directors held on 5 October 2023 (As Per BSE Announcement Dated on 05.10.2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "26-07-2023",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/07/2023 inter alia to consider and approve the unaudited standalone and consolidated financial results of the Company for the quarter ended 30 June 2023. The Board Meeting today commenced at 1.30 p.m. and consideration of financial results for the quarter ended 30 June 2023 was approved at 2.20 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. (As Per BSE Announcement dated on 26.07.2023)"
            ],
            [
                "26-04-2023",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2023 inter alia to consider and approve the standalone and consolidated audited financial results of the Company for the quarter and year ended 31 March 2023 and recommend dividend on equity shares if any for the year ended 31 March 2023. A dividend of Rs. 30 per share (1500%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2023. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on or about 28 July 2023 or 29 July 2023. The meeting commenced at 3.45 p.m. and recommendation of dividend and consideration of financial results for the quarter and year ended 31 March 2023 was approved at 5.20 p.m. The Board of Directors of the Company, at its meeting held today, i.e., 26 April 2023, approved, inter-alia, issue of 489,305 equity shares of face value of Rs. 2 at the respective grant prices to the Trustees of BFL Employee Welfare Trust under the BFL Employee Stock Option Scheme, 2009 (Scheme). In terms of provisions of Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, (SEBI Listing Regulations), as amended, and in continuation to our letter dated 26 April 2023 regarding outcome of Board meeting for Standalone and Consolidated financial results and recommendation of dividend, this is to inform you that the Board of Directors of the Company, at its meeting held today, i.e., 26 April 2023, approved, inter-alia, issue of 489,305 equity shares of face value of Rs. 2 at the respective grant prices to the Trustees of BFL Employee Welfare Trust under the BFL Employee Stock Option Scheme, 2009 (Scheme). The Board Meeting commenced at 3.45 p.m. and concluded at 6.00 p.m. Pursuant to Regulation 42 of the SEBI Listing Regulations, the record date for the purpose of determining the members eligible to receive the dividend for the financial year ended 31 March 2023, has been fixed as Friday, 30 June 2023. (As Per BSE Announcement Dated on 26.04.2023)"
            ],
            [
                "27-01-2023",
                "Quarterly Results"
            ],
            [
                "27-01-2023",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/01/2023 inter alia to consider and approve the unaudited financial results for the quarter ending 31 December 2022 The Board Meeting today commenced at 3.30 p.m. and consideration of financial results for the quarter and nine months ended 31 December 2022 was approved at 4.00 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure. Unaudited standalone and consolidated financial results for the quarter and nine months ended 31 December 2022 (As Per BSE Announcement dated on 27.01.2023)"
            ],
            [
                "20-10-2022",
                "Quarterly Results"
            ],
            [
                "20-10-2022",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/10/2022 inter alia to consider and approve the unaudited financial results for the quarter and half year ending 30 September 2022. Unaudited standalone and consolidated financial results for the quarter and half year ended 30 September 2022. The Board meeting commenced at 2.30 pm and financials were approved at 3.45 pm. Unaudited standalone and consolidated financial results for the quarter and half year ended 30 September 2022. The Board Meeting commenced at 2.30 pm and financial results were approved at 3.45 pm. (As Per BSE Announcement Dated on 20/10/2022)"
            ],
            [
                "27-07-2022",
                "Quarterly Results"
            ],
            [
                "27-07-2022",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/07/2022 inter alia to consider and approve Pursuant to aforementioned regulations notice is hereby given that a meeting of the Board of Directors of the Company will be held on Wednesday 27 July 2022 inter alia to consider the unaudited financial results for the quarter ending 30 June 2022. Further this is to inform you that the trading window for dealing in the securities of the Company will remain closed from Friday 1 July 2022 till Friday 29 July 2022 (both days inclusive) for designated persons as per the Companys Code of Conduct framed pursuant to SEBI (Prohibition of Insider Trading) Regulations 2015 as amended. The designated persons of the Company are being informed of the same. Unaudited standalone and consolidated financial results for the quarter ended 30 June 2022. Unaudited standalone and consolidated financial results for the quarter ended 30 June 2022 (As Per BSE Announcement Dated on 27.07.2022)"
            ],
            [
                "26-04-2022",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2022 inter alia to consider and approve inter alia the audited financial results for the year ended 31 March 2022 and recommendation of dividend on equity shares if any for the said year. Further this is to inform you that the trading window for dealing in the securities of the Company is closed from 1 April 2022 till 28 April 2022 (both days inclusive) for designated persons as per the Companys Code of Conduct framed pursuant to SEBI (Prohibition of Insider Trading) Regulations 2015 as amended. The designated persons of the Company have been informed of the same. A dividend of Rs. 20 per share (1000%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2022. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on 1 August 2022 and/or 2 August 2022. Outcome of Board meeting held on 26 April 2022 The meeting commenced at 4.00 p.m. and concluded at 6.10 p.m. Audited standalone and consolidated financial results for the quarter and financial year ended 31 March 2022 The Annual General Meeting of the Company is scheduled to be held on 27 July 2022 The Dividend, if declared, shall be paid to the equity shareholders whose names appear on the Register of Members of the Company or in the records of the Depositories as beneficial owners of the shares as on Friday, 1 July 2022, which is the Record Date fixed for the purpose. (As Per BSE Announcement Dated on 26.04.2022) Outcome of Board Meeting Intimation of grant of options pursuant to Employee Stock Option Scheme, 2009 (As Per BSE Announcement dated on 27.04.2022)"
            ],
            [
                "14-03-2022",
                "In terms of provisions of Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, (SEBI Listing Regulations) as amended, this is to inform that Board at its Meeting held today, i.e., 14 March 2022 approved, inter- alia, issue of 18,34,888 equity shares of face value of Rs 2 at the respective grant prices to the Trustees of BFL Employee Welfare Trust under the BFL Employee Stock Option Scheme, 2009 ('scheme'). The meeting commenced at 11:15 a.m. and concluded at 4.30 p.m. Retirement of Independent Director upon completion of second term"
            ],
            [
                "18-01-2022",
                "Quarterly Results"
            ],
            [
                "18-01-2022",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 18/01/2022 inter alia to consider and approve Notice is hereby given that a meeting of the Board of Director of the Company will be held on Tuesday 18 January 2022 inter alia to consider the unaudited financial results for the quarter and nine months ending 31 December 2021. Outcome of Board Meeting. The meeting commenced at 3.00 p.m. and concluded at 5.35 p.m. Financial Results for the quarter and nine months ended 31 December 2021 (As per BSE Announcement Dated on 18/01/2022)"
            ],
            [
                "26-10-2021",
                "Quarterly Results"
            ],
            [
                "26-10-2021",
                "Quarterly Results"
            ],
            [
                "26-10-2021",
                "Quarterly Results Outcome of Board meeting held on 26 October 2021. Unaudited standalone and consolidated financial results for the quarter and half year ended 30 September 2021 (As per BSE Announcement Dated on 26/10/2021)"
            ],
            [
                "20-07-2021",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/07/2021 ,inter alia, to consider and approve unaudited financial results for the quarter ending 30 June 2021 Outcome of Board meeting held on 20 July 2021. (AS Per BSE Announcement Dated on 20.07.2021) Intimation of investment in Bajaj Finserv Direct Limited under Regulation 30 of SEBI Listing Regulations (As Per BSE Announcement dated on 21.07.2021)"
            ],
            [
                "27-04-2021",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/04/2021 ,inter alia, to consider and approve the audited financial results for the year ending 31 March 2021 and recommendation of dividend on equity shares, if any, for the said year. Outcome of Board meeting held on 27 April 2021. The meeting commenced at 2.15 p.m. and concluded at 5.15 p.m. A dividend of Rs. 10 per share (500%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2021. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on 24 July 2021 and/or 26 July 2021. In terms of provisions of Regulation 30 of the SEBI Listing Regulations, this is to inform you that Shri Rahul Bajaj, NED of the Company, having been at the helm of the Company since its inception in 1987 and the Group for over five decades, considering his age has tendered his resignation as NED of the Company with effect from close of business hours on 30 April 2021. He has made a huge contribution to the success of the Company and the Group over the last five decades. Considering his tremendous experience and in the interest of the Company and to continue to benefit from his experience, knowledge and wisdom from time to time in an advisory role and as a mentor, the Board of Directors at its meeting held today and as recommended by Nomination and Remuneration Committee has approved the appointment of Shri Rahul Bajaj as Chairman Emeritus of the Company for a term of five years with effect from 1 May 2021. Shri Rahul Bajaj will not accept any emoluments for taking up this position. (As Per BSE Announcement dated on 27.04.2021) We hereby inform you that the Company has sent a detailed communication to all the Shareholders holding shares as on Friday, 4 June 2021 whose email addresses are registered with the Company/Depositories indicating the process and documentation required for claiming exemption from deduction/withholding of tax on dividends. A specimen copy of the said communication sent to the shareholders is enclosed and is uploaded on the Company's website at https://www.bajajfinserv.in/finance-investor-relation-annual-reports (As Per BSE Announcement dated on 16.06.2021)"
            ],
            [
                "15-03-2021",
                "The Board of Directors of Bajaj Finance, at its meeting held today, approved the following: 1. Issue of 1,007,006 equity shares of face value of Rs. 2 at the respective grant prices to the Trustees of BFL Employee Welfare Trust under the BFL Employee Stock Option Scheme, 2009 ('ESOP Scheme'); 2. Variation to the terms of the existing ESOP Scheme, subject to the approval of shareholders through Postal Ballot. 3. Amendment to the Dividend Distribution Policy of the Company"
            ],
            [
                "20-01-2021",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/01/2021 ,inter alia, to consider and approve unaudited financial results for the quarter and nine months ending 31 December 2020. Outcome of Board meeting held on 20 January 2021. The meeting commenced at 1.30 p.m. and concluded at 3.27 p.m. (As Per BSE Announcement dated on 20.01.2021)"
            ],
            [
                "21-10-2020",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/10/2020 ,inter alia, to consider and approve unaudited financial results for the quarter and half year ending 30 September 2020. Outcome of Board meeting held on 21 October 2020 The meeting commenced at 11.00 a.m. and concluded at 1:15 p.m. (As per BSE Announcement Dated on 21/10/2020)"
            ],
            [
                "21-07-2020",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/07/2020 ,inter alia, to consider and approve the unaudited financial results for the quarter ending 30 June 2020. Unaudited standalone and consolidated financial results for the quarter ended 30 June 2020 (AS Per BSE Announcement Dated on 21.07.2020)"
            ],
            [
                "19-05-2020",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/05/2020 ,inter alia, to consider and approve audited financial results of the Company for the year ended 31 March 2020. The meeting commenced at 1.30 p.m. and concluded at 4.05 p.m. (As Per BSE Announcement dated on 19.05.2020)"
            ],
            [
                "17-03-2020",
                "In terms of provisions of Regulation 30 (read with Part A of Schedule III) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, as amended, this is to inform you that the Board of Directors, at its Meeting held on 17 March 2020, has re-appointed Shri Rajeev Jain (DIN: 01550158), Managing Director of the Company for a further period of 5 years w.e.f.1 April 2020, subject to approval of the Shareholders of the Company at the ensuing Annual General Meeting."
            ],
            [
                "21-02-2020",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/02/2020 ,inter alia, to consider and approve Pursuant to Regulation 29 (l)(e) of the SEBI Listing Regulations, 2015, notice is hereby given that a Meeting of the Board of Directors of the Company will be held on Friday, 21 February 2020,inter alia, to consider payment of interim dividend for the financial year ending 31 March 2020. This is to inform you that the trading window for dealing in the securities of the Company will remain closed from 13 February 2020 till 23 February 2020 (both days inclusive), for designated persons as per the Company''s Code of Conduct framed pursuant to SEBI (Prohibition of Insider Trading) Regulations 2015, as amended. The designated persons of the Company have been informed of the same."
            ],
            [
                "29-01-2020",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2020 ,inter alia, to consider and approve unaudited financial results for the quarter and nine months ending 31 December 2019. The Board Meeting to be held on 29/01/2020 has been revised to 29/01/2020 This has reference to our letter dated 30 December 2019 informing you about the meeting of the Board of Directors of the Company scheduled to be held on Wednesday, 29 January 2020, to consider, inter alia, the unaudited financial results for the quarter and nine months ended 31 December 2019. This is to further inform you that at the said meeting, the Board will also consider raising of funds, inter alia, by issue of non-convertible debentures as a part of the proposed increase in the overall borrowing limit, pursuant to Section 180(1)(c) of the Companies Act, 2013, subject to approval of the shareholders by postal ballot. Kindly take the above intimation on your record. (As Per BSE Announcement Dated on 24/01/2020) The meeting commenced at 11.30 a.m. and concluded at 1.25 p.m. Pursuant to Reserve Bank of India circular no. RBI/2018-2019/184DNBR (PD)CC.No.099/03.10.001/2018-19 dated 16 May 2019, we wish to inform that the Board at its Meeting held on 29 January 2020, has appointed Shri Deepak Bagati as Chief Risk Officer of the Company w.e.f. 29 January 2020 in place of Shri Fakhari Sarjan. (As Per BSE Announcement Dated on 29/01/2020)"
            ],
            [
                "07-11-2019",
                "A meeting of the Special Committee of the Board of the Directors of the Company is scheduled to be held on November 7, 2019 to, inter alia, consider and approve the issue price, including a discount, if any thereto as permitted under the SEBI ICDR Regulations, for the Equity Shares to be allotted to qualified institutional buyers, pursuant to the Issue. Outcome of Special Committee meeting of the Board of Directors held on 7 November 2019. The meeting commenced at 5.30 p.m. and concluded at 6.25 p.m. (As Per BSE Announcement Dated on 07.11.2019)"
            ],
            [
                "22-10-2019",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/10/2019 ,inter alia, to consider and approve unaudited financial results for the quarter and half year ended 30 September 2019."
            ],
            [
                "17-09-2019",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/09/2019 ,inter alia, to consider and approve proposal for raising of funds by way of qualified institutions placement ('QIP'), subject to such regulatory/statutory approvals as may be required, including approval of the shareholders of the Company. The Trading Window for dealing in the securities of the Company will be closed from Friday,6 September 2019 till Thursday, 19 September 2019 (both days inclusive) in terms of the Company's Code of Conduct framed pursuant to SEBI (Prohibition of Insider Trading) Regulations, 2015, as amended. Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/09/2019 ,inter alia, to consider and approve proposal for raising of funds by way of qualified institutions placement ('QIP'), subject to such regulatory/statutory approvals as may be required, including approval of the shareholders of the Company. The Trading Window for dealing in the securities of the Company will be closed from Friday,6 September 2019 till Thursday, 19 September 2019 (both days inclusive) in terms of the Company's Code of Conduct framed pursuant to SEBI (Prohibition of Insider Trading) Regulations, 2015, as amended. (As Per BSE Announcement dated on 05/09/2019) Outcome of Board Meeting held on 17 September 2019. The meeting commenced at 3.30 p.m. and concluded at 5.55 p.m. (As Per BSE Announcement Dated 17.09.2019) Outcome of Special Committee meeting of the Board of Directors held on 4 November 2019. The meeting commenced at 3.30 p.m. and concluded at 5.00 p.m. (As Per BSE Announcement Dated 4.11.2019)"
            ],
            [
                "17-09-2019",
                "inter alia, to consider a proposal for raising of funds by way of qualified institutions placement (\"QIP\"), subject to such regulatory/statutory approvals as may be required, including approval of the shareholders of the Company."
            ],
            [
                "25-07-2019",
                "Bajaj Finance Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2019 ,inter alia, to consider and approve unaudited financial results for the quarter ending 30 June 2019"
            ],
            [
                "16-05-2019",
                "With reference to the earlier announcement dated April 16, 2019, regarding the Board of Directors of the Company approving borrowing by way of external commercial borrowing (ECB) for an aggregate amount up to USD 700 million. Bajaj Finance Ltd has now informed BSE that a meeting of the Board of Directors of the Company will be held on May 16, 2019, inter alia, to also consider revision in the aforementioned limits approved for ECBs by way of loan and/or issuance of secured/unsecured notes, bonds, debenture, etc. subject to the directions issued by Reserve Bank of India, from time to time, within the overall borrowing limit as approved by the shareholders, from time to time."
            ],
            [
                "29-01-2019",
                "Quarterly Results inter alia, I. Raising of funds. inter alia, by issue of non-convertible debentures as a part of the proposed increase in the overall borrowing limit, pursuant to Section 180( l )(c) of the Companies Act, 2013. subject to approval of' the shareholders by postal ballot. 2. Raising ot? External Commercial Borrowing (ECB) in foreign currency subject to directions issued by Reserve Bank of India, from time to time, within the overall borrowing limit as may be approved by the shareholders."
            ],
            [
                "29-01-2019",
                "Quarterly Results inter alia, I. Raising of funds. inter alia, by issue of non-convertible debentures as a part of the proposed increase in the overall borrowing limit, pursuant to Section 180( l )(c) of the Companies Act, 2013. subject to approval of' the shareholders by postal ballot. 2. Raising ot? External Commercial Borrowing (ECB) in foreign currency subject to directions issued by Reserve Bank of India, from time to time, within the overall borrowing limit as may be approved by the shareholders."
            ],
            [
                "23-10-2018",
                "BAJAJ FINANCE LIMITEDhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2018 ,inter alia, to consider and approve Pursuant to Regulation 29 of the SEBI Listing Regulations, 2015, notice is hereby given that a meeting of the Board of Directors of the Company will be held on Tuesday, 23 October 2018, inter alia, to consider the unaudited financial results for the quarter and half year ending 30 September 2018."
            ],
            [
                "19-07-2018",
                "Quarterly Results"
            ],
            [
                "17-05-2018",
                "Dividend & Audited Results"
            ],
            [
                "01-02-2018",
                "This has reference to our letter no. SEC/BM/2018/4 dated 3 January 2018 informing you about the meeting of the Board of Directors of the Company scheduled to be held on Thursday, 1 February 2018, to consider, inter alia, the unaudited financial results for the quarter and nine months ended 31 December 2017. This is to further inform you that at the said meeting, the Board shall also consider following proposals: 1. raising of funds, inter alia, by issue of non-convertible debentures as a part of the proposed increase in the overall borrowing limit, pursuant to Section 180(1)(c) of the Companies Act, 2013, subject to approval of the shareholders by postal ballot. 2. raising of funds by issue of rupee denominated unsecured bonds ('Masala Bonds') in the overseas markets subject to approval of Reserve Bank of India."
            ],
            [
                "19-07-2017",
                "Quarterly Results"
            ],
            [
                "17-05-2017",
                "Rotation of the statutory auditors of the Company on completion of term as prescribed under the Companies Act, 2013"
            ],
            [
                "30-01-2017",
                "Quarterly Results"
            ],
            [
                "27-10-2016",
                "The Board of Directors i.e. October 27, 2016, scheduled to consider, inter alia, the unaudited financial results for the quarter and half year ended September 30, 2016. Bajaj Finance Ltd has now informed BSE that at the said meeting, the Board may also consider a proposal to seek approval of the shareholders by postal ballot for raising of funds by issue of non-convertible debentures or such other securities as a part of the proposed increase in overall borrowing limits of the Board, pursuant to Section 180(1)(c) of the Companies Act, 2013, from Rs. 50,000 crore to such amount as may be decided by the Board."
            ],
            [
                "26-07-2016",
                "The Board of Directors, i.e. July 26, 2016, scheduled to consider and take on record the unaudited financial results for the quarter ended June 30. 2016, Bajaj Finance Ltd has now informed BSE that at the said meeting, the Board may also consider: a. Sub-division of equity shares of the Company of face value of Rs. 10 each, and/or b. Issue of fully-paid bonus equity shares to the members of the Company. The aforesaid proposal(s), if approved by the Board, will be subject to the approval of the shareholders."
            ],
            [
                "24-05-2016",
                "Audited Results & Final Dividend"
            ],
            [
                "09-03-2016",
                "Interim Dividend"
            ],
            [
                "03-02-2016",
                "Quarterly Results"
            ],
            [
                "20-10-2015",
                "Quarterly Results"
            ],
            [
                "22-07-2015",
                "Quarterly Results"
            ],
            [
                "20-05-2015",
                ""
            ],
            [
                "20-05-2015",
                "Issue Of Warrants"
            ],
            [
                "20-05-2015",
                "Audited Results & Dividend"
            ],
            [
                "14-01-2015",
                "Quarterly Results"
            ],
            [
                "14-10-2014",
                "Quarterly Results"
            ],
            [
                "16-07-2014",
                "Quarterly Results"
            ],
            [
                "14-05-2014",
                "Dividend & Audited Results"
            ],
            [
                "15-01-2014",
                "Quarterly Results"
            ],
            [
                "15-10-2013",
                "Quarterly Results"
            ],
            [
                "18-07-2013",
                "Quarterly Results"
            ],
            [
                "15-05-2013",
                "Audited Results & Dividend"
            ],
            [
                "15-01-2013",
                "Quarterly Results"
            ],
            [
                "19-10-2012",
                "Quarterly Results"
            ],
            [
                "17-07-2012",
                "Quarterly Results"
            ],
            [
                "16-05-2012",
                "Dividend & Audited Results"
            ],
            [
                "18-01-2012",
                "Quarterly Results"
            ],
            [
                "19-10-2011",
                "Quarterly Results"
            ],
            [
                "13-07-2011",
                "Quarterly Results"
            ],
            [
                "09-06-2011",
                "to consider raising capital through QIP and preferential issue."
            ],
            [
                "17-05-2011",
                "Audited Results & Dividend"
            ],
            [
                "18-01-2011",
                "Quarterly Results"
            ],
            [
                "18-10-2010",
                "Quarterly Results"
            ],
            [
                "21-07-2010",
                "Quarterly Results"
            ],
            [
                "11-05-2010",
                "Audited Results & Dividend"
            ],
            [
                "12-01-2010",
                "Quarterly Results Nine Months"
            ],
            [
                "14-10-2009",
                "Quarterly Results"
            ],
            [
                "15-07-2009",
                "Quarterly Results"
            ],
            [
                "20-05-2009",
                "Dividend & Audited Results"
            ],
            [
                "15-01-2009",
                "Quarterly Results"
            ],
            [
                "22-10-2008",
                "Quarterly Results"
            ],
            [
                "09-07-2008",
                "Quarterly Results"
            ],
            [
                "21-05-2008",
                "Dividend & Audited Results"
            ],
            [
                "29-01-2008",
                "Quarterly Results"
            ],
            [
                "18-10-2007",
                "Quarterly Results"
            ],
            [
                "11-07-2007",
                "Quarterly Results"
            ],
            [
                "16-05-2007",
                "Audited Results & Dividend"
            ],
            [
                "15-01-2007",
                "Quarterly Results"
            ],
            [
                "17-10-2006",
                "Quarterly Results"
            ],
            [
                "14-07-2006",
                "Quarterly Results"
            ],
            [
                "18-05-2006",
                "Accounts & Dividend"
            ],
            [
                "12-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "30-05-2025",
                "30-05-2025",
                "2200%",
                "The Board of Directors have recommended Final Dividend on equity shares at the rate of Rs. 44 per share (2200%) of face value of Rs . 2 each for the financial year 31 March 2025. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on or about 28 July 2025."
            ],
            [
                "09-05-2025",
                "09-05-2025",
                "600%",
                "The Board of Directors have declared a Special (Interim) Dividend on equity shares at the rate of Rs. 12 per share (600%) of face value of Rs. 2 each for the financial year ended 31 March 2025. The same will be credited/dispatched on or about 26 May 2025."
            ],
            [
                "21-06-2024",
                "21-06-2024",
                "1800%",
                "The Board Meeting today commenced at 4:30 p.m. and recommendation of dividend and consideration of financial results for the quarter and year ended 31 March 2024 was approved at 5:15 p.m. The proceedings of the Board Meeting are in progress at the time of filing of this disclosure"
            ],
            [
                "30-06-2023",
                "30-06-2023",
                "1500%",
                "A dividend of Rs. 30 per share (1500%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2023. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on or about 28 July 2023 or 29 July 2023."
            ],
            [
                "01-07-2022",
                "30-06-2022",
                "1000%",
                "A dividend of Rs. 20 per share (1000%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2022. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on 1 August 2022 and/or 2 August 2022."
            ],
            [
                "10-07-2021",
                "08-07-2021",
                "500%",
                "Outcome of Board meeting held on 27 April 2021. The meeting commenced at 2.15 p.m. and concluded at 5.15 p.m. A dividend of Rs. 10 per share (500%) of the face value of Rs. 2 each on equity shares of the Company has been recommended by the Board of Directors for the financial year ended 31 March 2021. The said dividend, if declared, by the shareholders at the ensuing Annual General Meeting, will be credited/dispatched on 24 July 2021 and/or 26 July 2021."
            ],
            [
                "04-03-2020",
                "03-03-2020",
                "500%",
                "Bajaj Finance Ltd has informed BSE that the Board of Directors of the Company at its meeting held on February 21, 2020, has considered and declared an Interim Dividend of Rs. 10 (i.e. 500%) per equity share of Rs. 2/- each. Further, the aforesaid Interim Dividend shall be credited / dispatched on or around March 09, 2020."
            ],
            [
                "13-07-2019",
                "11-07-2019",
                "300%",
                "The Board at its meeting held on 16 May 2019 has recommended a dividend of Rs. 6 per equity share (300%) of face value of Rs. 2, subject to approval of the shareholders at the 32nd Annual General Meeting to be held on 25 July 2019."
            ],
            [
                "13-07-2019",
                "11-07-2019",
                "300%",
                "Rs.6.0000 per share(300%)Dividend"
            ],
            [
                "07-07-2018",
                "05-07-2018",
                "200%",
                "Rs.4.0000 per share(200%)Dividend"
            ],
            [
                "08-07-2017",
                "06-07-2017",
                "180%",
                "Rs.3.6000 per share(180%)Dividend"
            ],
            [
                "16-07-2016",
                "14-07-2016",
                "70%",
                "Rs.7.0000 per share(70%)Final Dividend"
            ],
            [
                "17-03-2016",
                "16-03-2016",
                "180%",
                "Interim Dividend"
            ],
            [
                "11-07-2015",
                "09-07-2015",
                "180%",
                "Rs.18.0000 per share(180%)Dividend"
            ],
            [
                "05-07-2014",
                "03-07-2014",
                "160%",
                "Rs.16.0000 per share(160%)Dividend"
            ],
            [
                "06-07-2013",
                "04-07-2013",
                "150%",
                "Rs.15.0000 per share(150%)Dividend"
            ],
            [
                "07-07-2012",
                "05-07-2012",
                "120%",
                "Rs.12.00 per share(120%)Dividend"
            ],
            [
                "01-07-2011",
                "29-06-2011",
                "100%",
                "Rs.10.00 per share(100%)Dividend"
            ],
            [
                "10-07-2010",
                "08-07-2010",
                "60%",
                "Rs.6.00 per share(60%)Dividend"
            ],
            [
                "01-07-2009",
                "29-06-2009",
                "20%",
                "Rs.2.00 per share(20%)Dividend & A.G.M."
            ],
            [
                "01-07-2008",
                "27-06-2008",
                "10%",
                "10% Dividend & A.G.M."
            ],
            [
                "01-07-2007",
                "28-06-2007",
                "30%",
                ""
            ],
            [
                "01-07-2006",
                "29-06-2006",
                "40%",
                "40% Dividend & A.G.M."
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "10-09-2016",
                "08-09-2016",
                "2:10"
            ]
        ]
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "10-09-2016",
                "08-09-2016",
                "1:1"
            ]
        ]
    },
    "rights": {
        "msg": "",
        "title": "Rights",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio",
            "Premium"
        ],
        "data": [
            [
                "25-01-2013",
                "23-01-2013",
                "3:19",
                "1090"
            ],
            [
                "20-11-2006",
                "13-11-2006",
                "6:10",
                "315"
            ]
        ]
    }
}