{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "22-04-2025",
                "HCL Technologies Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 22/04/2025 inter alia to consider and approve Enclosed please find an intimation in regard to the date of the Board Meeting to consider the annual audited financial results and dividend. Enclosed please find Outcome for Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2025 The Board of Directors has declared an Interim Dividend of Rs. 18/- per equity share of Rs. 2/- each of the Company for the Financial Year 2025-26 Appointment of Secretarial Auditor of the Company. (As Per BSE Announcement dated on 22.04.2025)"
            ],
            [
                "13-01-2025",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/01/2025 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Monday January 13 2025 to consider amongst others: 1. Un-audited Financial Results of the Company for quarter and nine months ending December 31 2024. 2.Payment of 4th Interim dividend for the financial year 2024-25. This is for your information and records. Enclosed please find the Financial Results for the Quarter and nine months ended December 31, 2024. (As Per BSE Announcement Dated on: 13/01/2025)"
            ],
            [
                "14-10-2024",
                "Quarterly Results"
            ],
            [
                "14-10-2024",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/10/2024 inter alia to consider and approve Enclosed please find an intimation in regard to the captioned subject. Enclosed please find the Unaudited Financial Results for the Quarter and Half yearly ended September 30, 2024. The Record Date of October 22, 2024, fixed for the payment of the aforesaid Interim Dividend has been confirmed by the Board of Directors. The Payment date of the said Interim Dividend shall be October 30, 2024 (As Per BSE Announcement Dated on: 14/10/2024)"
            ],
            [
                "18-08-2024",
                "Enclosed please find an intimation in regard to the Change in Management (Chief Financial Officer) of the Company."
            ],
            [
                "12-07-2024",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/07/2024 inter alia to consider and approve Enclosed please find an intimation in regard to the Board meeting of the Company for considering the Quarterly financial results and interim dividend. Enclosed please find an intimation in regard to the Record Date for payment of interim dividend, if any, declared by the Board of Directors of the Company in its meeting to be held on July 12, 2024. Enclosed please find an intimation in regard to the record date in respect of the dividend, if any declared by the Board of Directors of the Company in its meeting to be held on July 12, 2024. Enclosed please find the Financial Results for the quarter ended June 30, 2024 Enclosed please find an intimation for re-appointment of Statutory Auditors of the Company. Enclosed please find the intimation for Re-appointment of Mr. Simon John England as an Non-Executive Independent Director of the Company. (As Per BSE Announcement Dated on 12.07.2024)"
            ],
            [
                "25-04-2024",
                "Appointment of Ms. Lee Fang Chew as an Independent Director. Enclosed please find an intimation in regard to the appointment of Ms. Lee Fang Chew as an Independent Director"
            ],
            [
                "26-04-2024",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/04/2024 inter alia to consider and approve Enclosed please find intimation on A) Board Meeting to consider Audited financial results & payment of interim dividend and B) Intimation of record date for payment of dividend Enclosed please find Audited Financial Results for the quarter and year ended March 31, 2024. Enclosed please find Outcome for Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2024. The Board of Directors has declared an Interim Dividend of Rs. 18/- per equity share of Rs. 2/- each of the Company for the Financial Year 2024-25. The payment date of the said interim dividend shall be May 15, 2024. Approval of RSU Plan 2024 (As Per BSE Announcement Dated on 26/04/2024)"
            ],
            [
                "12-01-2024",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/01/2024 inter alia to consider and approve 1) Un-audited Financial Results of the Company for the quarter and nine months ending December 31 2023. 2) Payment of 4th Interim dividend for the financial year 2023-24. Board approved:- The Board of Directors has declared an Interim Dividend of Rs.12/- per equity share of Rs.2/- each of the Company for the Financial Year 2023-24. The Record date of January 20, 2024 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be January 31, 2024. (As Per BSE Bulletin Dated on 12.01.2024) Unaudited Financial Results for the quarter and nine months ended December 31, 2023. Appointment of Ms. Bhavani Balasubramanian as an Independent Director. (As Per BSE Announcement Dated on 12/01/2024)"
            ],
            [
                "12-10-2023",
                "Quarterly Results"
            ],
            [
                "12-10-2023",
                "Quarterly Results & Interim Dividend HCL TECHNOLOGIES LIMITED has informed BSE about Board Meeting to be held on 12 Oct 2023 to consider financial statements for the period ended September 2023. Financial results / Dividend. The Board of Directors has declared an interim dividend of Rs. 12/- per equity share of Rs. 2/- each for the financial year 2023-2024. The record date of October 20, 2023 fixed for the payment of the aforesaid dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be October 31, 2023. 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and half year ended September 30, 2023. The Financials Results under Regulation 33 of the SEBI (Listing Obligation and Disclosure Requirements), Regulations 2015 along with declaration prescribed under these regulations are enclosed at Annexure-A. 2. The Limited Review Reports on the aforesaid Consolidated and Standalone Financials of the Company are enclosed at Annexure-B. 3. The Board of Directors has declared an interim dividend of Rs. 12/- per equity share of Rs. 2/- each of the Company for the Financial Year 2023-2024. The record date of October 20, 2023 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment of the said interim dividend shall be October 31, 2023. The Board meeting commenced at 12:45 PM (IST) on October 12, 2023 and concluded at 5:30 PM (IST). (As Per BSE Announcement Dated on 12.10.2023)"
            ],
            [
                "12-07-2023",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/07/2023 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Wednesday July 12 2023 to consider amongst others: 1) Un- audited Financial Results of the Company for quarter ending June 30 2023. 2) Payment of 2nd Interim dividend for the financial year 2023-24. The Record Date for determining the entitlement of the shareholders for the payment of the aforesaid interim dividend shall be July 20 2023 subject to the approval of the interim dividend by the Board of Directors. The Board of Directors has declared interim dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the financial year 2023-24. The record date of July 20, 2023 fixed for payment of aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be August 1, 2023. The Board of Directors has today approved the Un-audited (Consolidated & Standalone) Financial results of the Company for the quarter ended June 30, 2023. The Financial results under Regulation 33 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure-A. The Limited Review Report on the aforesaid Consolidated & Standalone Financial Results of the Company are enclosed at Annexure-B. (As Per BSE Announcement Dated on 12.07.2023)"
            ],
            [
                "20-04-2023",
                "Quarterly Results"
            ],
            [
                "20-04-2023",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 20/04/2023 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on April 19 & 20 2023 to consider amongst others: 1) Audited Financial Results of the Company for the financial year ending March 31 2023. 2) Payment of Interim dividend for the financial year 2023-24. The items relating to financial results and payment of Interim dividend shall be considered by the Board on April 20 2023. The Record Date for determining the entitlement of the shareholders for the payment of the aforesaid interim dividend shall be April 28 2023 subject to the approval of the interim dividend by the Board of Directors. 1. Board has today approved Audited (Consolidated & Standalone) Financial results for quarter and year ended March 31, 2023. Financial Results under Regulation 33 of SEBI (LODR) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure- A. 2. Auditor's Reports on aforesaid Consolidated & Standalone Financial results of Company are enclosed at Annexure- B 3. Board has declared Interim Dividend of Rs. 18/per equity share of Rs.2/- each of Company for FY 2023-24. 4. Record date of April 28, 2023 fixed for payment of aforesaid interim dividend has been confirmed by Board. The payment date of said interim dividend shall be May 9, 2023. Board Meeting commenced at 11:00 AM (IST) on April 19, 2023 and was adjourned at 08.20 PM (IST). Adjourned meeting was reconvened on April 20, 2023 at 01.20 PM (IST) and concluded at 4.30 PM (IST). aforesaid financial results and interim dividend were considered and approved by Board on April 20, 2023. 1. Board has today approved Audited (Consolidated & Standalone) Financial results for quarter and year ended March 31, 2023. Financial Results under Regulation 33 of SEBI (LODR) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure- A. 2. Auditor's Reports on aforesaid Consolidated & Standalone Financial results of Company are enclosed at Annexure- B. 3. Board has declared Interim Dividend of Rs. 18/per equity share of Rs.2/- each of Company for FY 2023-24. 4. Record date of April 28, 2023 fixed for payment of aforesaid interim dividend has been confirmed by Board. The payment date of said interim dividend shall be May 9, 2023. Board Meeting commenced at 11:00 AM (IST) on April 19, 2023 and was adjourned at 08.20 PM (IST). Adjourned meeting was reconvened on April 20, 2023 at 01.20 PM (IST) and concluded at 4.30 PM (IST). aforesaid financial results and interim dividend were considered and approved by Board on April 20, 2023. Board has declared Interim Dividend of Rs. 18/per equity share of Rs.2/- each of Company for FY 2023-24. Record date of April 28, 2023 fixed for payment of aforesaid interim dividend has been confirmed by Board. The payment date of said interim dividend shall be May 9, 2023. (As Per BSE Announcement Dated on 20.04.2023)"
            ],
            [
                "12-01-2023",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/01/2023 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday January 12 2023 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and nine months ended December 31 2022. 2) Payment of 4th Interim dividend for the financial year 2022-23. The Record Date for determining the entitlement of the shareholders for the payment of the aforesaid interim dividend shall be January 20 2023 subject to the approval of the interim dividend by the Board of Directors. The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of January 20, 2023, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 1, 2023. 1. The Board of Directors has today approved Unaudited (Consolidated & Standalone) Financial results of the Company for quarter and nine months ended December 31, 2022. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Reports of Statutory Auditors on aforesaid Consolidated & Standalone Financial results of Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of Company for the FY 2022-23. The Record date of January 20, 2023, fixed for payment of aforesaid interim dividend has been confirmed by Board of Directors. The Payment date of the said interim dividend shall be February 1, 2023. 4. An Investor Release dated January 12, 2023, on the financial results is enclosed at Annexure- C. The Board meeting commenced at 12:45 P.M. (IST) and concluded at 05:15 P.M. (IST). (As Per BSE Announcement Dated on 12.01.2023)"
            ],
            [
                "12-10-2022",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/10/2022 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Wednesday October 12 2022 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and half-year ended September 30 2022. 2) Payment of 3rd Interim dividend for the financial year 2022-23. The Record Date for determining the entitlement of the shareholders for the payment of the aforesaid interim dividend shall be October 20 2022 subject to the approval of the interim dividend by the Board of Directors. The Board of Directors has declared an Interim Dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of October 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 2, 2022. 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and half-year ended September 30, 2022. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Reports of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of October 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 2, 2022. 4. An Investor Release dated October 12, 2022, on the financial results is enclosed at Annexure- C. (As Per BSE Announcement Dated on 12.10.2022)"
            ],
            [
                "12-07-2022",
                "Quarterly Results"
            ],
            [
                "12-07-2022",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 12/07/2022 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Tuesday July 12 2022 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ended June 30 2022. 2) Payment of 2nd Interim dividend for the financial year 2022-23. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be July 20 2022 subject to the approval of the interim dividend by the Board of Directors. The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of July 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 2, 2022. 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter ended June 30, 2022. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Reports of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of July 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 2, 2022. 4. An Investor Release dated July 12, 2022, on the financial results is enclosed at Annexure- C. (As Per BSE Announcement Dated on 12.07.2022)"
            ],
            [
                "21-04-2022",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/04/2022 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on April 20 & 21 2022 to consider amongst others: 1) Audited Financial Results of the Company for the financial year ended March 31 2022; 2) Payment of Interim dividend for the financial year 2022-23. The items relating to financial results and payment of Interim dividend shall be considered by the Board on April 21 2022. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be April 29 2022 subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. The Board of Directors has declared an Interim Dividend of Rs.18/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of April 29, 2022 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be May 11, 2022. 1. The Board of Directors has today approved the Audited (Consolidated & Standalone) Financial results of the Company for the quarter and year ended March 31, 2022. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure- A. 2. The Auditor's Reports on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.18/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of April 29, 2022 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be May 11, 2022. 4. An Investor Release dated April 21, 2022 on the financial results is enclosed at Annexure- C. (As Per BSE Announcement Dated on 21.04.2022)"
            ],
            [
                "14-01-2022",
                "Quarterly Results"
            ],
            [
                "14-01-2022",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 14/01/2022 inter alia to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on January 14 2022 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and nine months ending December 31 2021. 2) Payment of 4th Interim dividend for the financial year 2021-22. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be January 22 2022 subject to the approval of the interim dividend by the Board of Directors. This is for your information and records 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and nine months ended December 31, 2021. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Reports of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of January 22, 2022 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 4, 2022. 4. An Investor Release dated January 14, 2022 on the financial results is enclosed at Annexure- C. (As Per BSE Announcement Dated 14.01.2022)"
            ],
            [
                "14-10-2021",
                "Quarterly Results"
            ],
            [
                "14-10-2021",
                "Quarterly Results & Third Interim Dividend HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on October 14 2021 inter alia has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22.(As Per BSE Announcement Dated on 10/14/2021 6:51:27 AM) The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of October 23 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 8 2021. (As Per BSE Announcement Dated on 10/14/2021)"
            ],
            [
                "19-07-2021",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 19/07/2021 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on July 19, 2021 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ended June 30, 2021; 2) Payment of 2nd Interim dividend for the financial year 2021-22. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be July 28, 2021, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. The Board of Directors has declared an Interim Dividend of Rs. 6/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of July 28, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 10, 2021. 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter ended June 30, 2021. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Reports of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs. 6/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of July 28, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 10, 2021. 4. An Investor Release dated July 19, 2021 on the financial results is enclosed at Annexure- C. Please find an intimation in terms of provisions of Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, for the (A) Appointment of Shri Shiv Nadar as the Chairman Emeritus & Strategic Advisor to the Board and (B) Appointment of Mr. C. Vijayakumar as the Managing Director of HCL Technologies. This is for your information and records. (As Per BSE Announcement Dated on 19.07.2021)"
            ],
            [
                "23-04-2021",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/04/2021 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on April 21, 22 & 23, 2021 to consider amongst others: 1) Audited Financial Results of the Company for the financial year ending March 31, 2021; 2) Payment of Interim dividend. The items relating to financial results and payment of Interim dividend shall be considered by the Board on April 23, 2021. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be May 1, 2021, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. 1.The Board has today approved the Audited Financial results of the Company for the quarter and year ended March 31, 2021. The Financial Results are enclosed at Annex.- A. 2.The Auditors' Reports on the aforesaid Financial results of the Company are enclosed at Annex- B. 3.The Board has declared 1st Interim Dividend of Rs.6 per equity share of Rs. 2 each and a Special interim dividend of Rs.10 per equity share of Rs.2 each for FY 2021-22. The Special Interim Dividend has been declared by the Board in recognition of the Company's recent milestone, crossing the $10 Billion mark in Revenue during FY21. The total interim dividend of Rs16 per equity share of Rs 2 each will be paid on May 19 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of May 1 2021 already announced for the purpose. 4.An Investor Release dated April 23 2021 is enclosed at Annex- C The Board of Directors has declared 1st Interim Dividend of Rs.6/- per equity share of Rs. 2/- each and a Special interim dividend of Rs.10/- per equity share of Rs.2/- each for FY 2021-22. The Special Interim Dividend has been declared by the Board in recognition of the Company's recent milestone, crossing the $10 Billion mark in Revenue during FY'21. The total interim dividend of Rs. 16/- per equity share of Rs. 2/- each will be paid on May 19, 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of May 1, 2021, already announced for the purpose (As Per BSE Announcement dated on 23.04.2021)"
            ],
            [
                "15-01-2021",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 15/01/2021 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on January 14-15, 2021 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and nine months ending December 31, 2020; 2) Payment of 3rd Interim dividend for the financial year 2020-21. The items relating to financial results and payment of Interim dividend shall be considered by the Board on January 15, 2021. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be January 23, 2021, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on January 15, 2021, inter alia, has declared an Interim Dividend of Rs. 4/- per equity share of Rs. 2/- each of the Company for the Financial Year 2020-21.The Payment date of the said interim dividend shall be February 08, 2021. (As Per BSE Announcement Dated on 1/15/2021 9:07:33 AM)"
            ],
            [
                "16-10-2020",
                "Quarterly Results & Second Interim Dividend We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on October 15-16, 2020 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and half year ending September 30, 2020; 2) Payment of 2nd Interim dividend for the financial year 2020-21. The items relating to un-audited financial results and payment of Interim dividend shall be considered by the Board on October 16, 2020. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be October 24, 2020, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. (As Per BSE Announcement dated on 25.09.2020) The Board of Directors has declared an Interim Dividend of Rs.4/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of October 24, 2020 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 9, 2020 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and half year ended September 30, 2020. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed . 2. The Limited Review Report of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company is enclosed . 3. The Board of Directors has declared an Interim Dividend of Rs.4/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of October 24, 2020 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 9, 2020. 4. An Investor Release dated October 16, 2020 on the financial results is enclosed. (As Per BSE Announcement Dated on 16.10.2020)"
            ],
            [
                "17-07-2020",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/07/2020 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on July 16-17, 2020 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ended June 30, 2020; 2) Payment of 1st Interim dividend for the financial year 2020-21. The items relating to un-audited financial results and payment of Interim dividend shall be considered by the Board on July 17, 2020. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be July 25, 2020, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. 1.Board of Directors has approved Unaudited (Consolidated & Standalone) Financial results of the Company for quarter ended June 30, 2020. Financial Results under Reg 33 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed. 2.Limited Review Report of Statutory Auditors on Consolidated & Standalone Financial results is enclosed. 3.Board of Directors has declared Interim Dividend of Rs.2/- per equity share of Rs.2/- each for FY 20-21. Record date of July 25, 2020 fixed for payment of interim dividend has been confirmed by Board. Payment date of interim dividend shall be Aug 7, 2020. 4.Investor Release dated July 17, 2020 on financial results is enclosed. 5.Board of Directors has appointed Ms. Roshni Nadar Malhotra, NED as Chairperson of Board and Company w.e.f. July 17, 2020, in place of Mr. Shiv Nadar who expressed his desire to step down from position of Chairman. Mr. Nadar would continue to be MD of Company with designation as Chief Strategy Officer. Enclosed please find the Consolidated Financial Statements of HCL Technologies Limited and its Subsidiaries for the three months ended June 30, 2020 under US GAAP, with Independent Auditor''s Review Report. The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of July 25, 2020 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 7, 2020. (As Per BSE Announcement Dated 17.07.2020)"
            ],
            [
                "07-05-2020",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/05/2020 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on May 6-7, 2020 to consider amongst others: 1)Audited Financial Results of the Company for the financial year ended March 31, 2020. 2)Recommendation of Final Dividend for the year ended March 31, 2020. The items relating to audited financial results and recommendation of final dividend shall be considered by the Board on May 7, 2020. This is for your information and records. Dear Sir, 1. The Board of Directors has today approved the Audited (Consolidated & Standalone) Financial results of the Company for the quarter and year ended March 31, 2020. The Financial Results under Regulation 33 of the SEBI (LODR) along with declaration prescribed under these regulations are enclosed at Ann- A 2. The Auditors' Report on the aforesaid Consolidated & Standalone Financial results of the Company is enclosed at Ann- B 3. The Board of Directors has recommended a Final Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2019-20, subject to the approval of the shareholders in the ensuing Annual General Meeting of the Company. 4. An Investor Release dated May 7, 2020 on the financial results is enclosed at Ann- C. The Board of Directors has recommended a Final Dividend of Rs. 2/- per equity share of Rs.2/- each of the Company for the Financial Year 2019-20, subject to the approval of the shareholders in the ensuing Annual General Meeting of the Company. Dear Sir, 1. The Board of Directors has today approved the Audited (Consolidated & Standalone) Financial results of the Company for the quarter and year ended March 31, 2020. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure- A. 2. The Auditors' Report on the aforesaid Consolidated & Standalone Financial results of the Company is enclosed at Annexure- B. 3. The Board of Directors has recommended a Final Dividend of Rs. 2/- per equity share of Rs.2/- each of the Company for the Financial Year 2019-20, subject to the approval of the shareholders in the ensuing Annual General Meeting of the Company. 4. An Investor Release dated May 7, 2020 on the financial results is enclosed at Annexure- C. This is for your information and records. HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 07, 2020, inter alia, has recommended a Final Dividend of Rs. 2/- per equity share of Rs. 2/- each of the Company for the Financial Year 2019-20, subject to the approval of the shareholders in the ensuing Annual General Meeting of the Company. (As Per BSE Announcement Dated on 5/7/2020 12:44:39 PM)"
            ],
            [
                "17-01-2020",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/01/2020 ,inter alia, to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on January 16-17, 2020 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and nine months ending December 31, 2019; 2) Payment of 4th Interim dividend for the financial year 2019-20. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on January 17, 2020. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be January 27, 2020, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on January 16-17, 2020 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and nine months ending December 31, 2019; 2) Payment of 4th Interim dividend for the financial year 2019-20. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on January 17, 2020. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be January 27, 2020, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. (As per BSE Announcement dated on 20/12/2019) Dear Sirs, 1.The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and nine months ended December 31, 2019. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 is enclosed at Annexure- A. 2.The Limited Review Reports of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company are enclosed at Annexure- B. 3.The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share on face value of Rs.2/- per equity share of the Company, for the Financial Year 2019-20. The Board of Directors has approved January 27, 2020 as record date for the payment of the aforesaid interim dividend. The Payment date of the said interim dividend shall be Feb 4, 2020. 4.An Investor Release dated Jan 17, 2020 on the financial results is enclosed at Annexure- C This is for your information and records. Dear Sirs, The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share on face value of Rs.2/- per equity share of the Company, for the Financial Year 2019-20. The Board of Directors has approved January 27, 2020 as record date for the payment of the aforesaid interim dividend. The Payment date of the said interim dividend shall be February 4, 2020. (As Per BSE Announcement Dated on 17/01/2020)"
            ],
            [
                "23-10-2019",
                "Quarterly Results"
            ],
            [
                "23-10-2019",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2019 ,inter alia, to consider and approve We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on October 22- 23, 2019 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ending September 30, 2019; 2) Payment of 3rd Interim dividend for the financial year 2019-20. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on October 23, 2019. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be November 1, 2019, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records. Enclosed please find the outcome of the meeting of the board of directors held on October 22-23, 2019. 1. The BOD has today approved the Unaudited Financial results for the quarter ended Sep. 30, 2019. The Financial Results under Regulation 33 of the SEBI (LODR) Reg,2015 along with declaration prescribed under these regulations are enclosed at Ann.- A. 2. The Limited Review Report of the Statutory Auditors on the aforesaid Financial results of the Company is enclosed at Ann.- B. 3. The BOD has declared an Interim Dividend of Rs.2/- per equity share on FV of Rs.2/- per equity share of the Company, for the FY 2019-20. The BOD has approved Nov 1, 2019 as record date for the payment of the aforesaid interim dividend. The Payment date of the said interim dividend shall be Nov 8, 2019. 4. The BOD has considered, approved and recommended issue of one Bonus Share for every one Eq shares held by the EQ shareholders of the Company. The bonus issue of Eq shares is subject to the approval of the shareholders and any other applicable statutory and regl approvals, as may be required. Enclosed please find the outcome of the meeting of the board of directors held on October 22-23, 2019. The Board of Directors has considered, approved and recommended issue of one Bonus Share for every one equity share held by the equity shareholders of the Company. The bonus issue of equity shares is subject to the approval of the shareholders and any other applicable statutory and regulatory approvals, as may be required. The Bonus shares once allotted shall rank pari-passu in all respects and carry the same rights of the existing Equity Shares and shall be entitled to participate in full in any dividend and other corporate action, recommended and declared after the issue and allotment of such Bonus Shares. The details pertaining to the Bonus issue of equity shares as per Regulations 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015. (As Per BSE Announcement Dated 23.10.2019)"
            ],
            [
                "07-08-2019",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 07/08/2019 ,inter alia, to consider and approve Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on August 6-7, 2019 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ended June 30, 2019; 2) Payment of 2nd Interim dividend for the financial year 2019-20. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on August 7, 2019. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be August 17, 2019, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records."
            ],
            [
                "09-05-2019",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 09/05/2019 ,inter alia, to consider and approve 1) Audited Financial Results of the Company for the financial year ended March 31, 2019; 2) Payment of Interim dividend for the financial year 2019-20. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on May 9, 2019. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be May 17, 2019, subject to the approval of the interim dividend by the Board of Directors. This is for your information and records."
            ],
            [
                "29-01-2019",
                "HCL TECHNOLOGIES LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2019 ,inter alia, to consider and approve 1)Un-audited Financial Results of the Company for the quarter and nine months ended December 31, 2018; 2)Payment of 4th Interim dividend for the financial year 2018-19. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be February 6, 2019, subject to the approval of the interim dividend by the Board of Directors."
            ],
            [
                "23-10-2018",
                "The Board of Directors has declared an Interim Dividend of Rs. 2/- per equity share of Rs. 2/- each of the Company for the Financial Year 2018-19. The Record date of October 31, 2018 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be November 11, 2018."
            ],
            [
                "23-10-2018",
                "Re.: Dividend payment date (corrigendum) Dear Sir, This is further to our letter dated October 23, 2018 on the captioned subject which inter-alia provided date of payment of 3rd Interim Dividend (2018-19) as November 11, 2018. There was an inadvertent error in stating the date as November 11, 2018. We would request you to kindly read the date of payment of 3rd Interim Dividend (2018-19) as November 9, 2018. This is for your information and records."
            ],
            [
                "23-10-2018",
                "Interim Dividend & Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on October 22-23, 2018 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter and half-year ended September 30, 2018; 2) Payment of 3rd Interim dividend for the financial year 2018-19. The items relating to financial results and payment of Interim dividend shall be considered by the Board on October 23, 2018."
            ],
            [
                "01-01-1970",
                "Dear Sirs, We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on July 26-27, 2018 to consider amongst others: 1)Un-audited Financial Results of the Company for the quarter ended June 30, 2018; 2)Payment of 2nd Interim dividend for the financial year 2018-19. The items relating to financial results and payment of Interim dividend shall be considered by the Board on July 27, 2018. We would like to inform you that the Register of Members and Share Transfer Books shall remain closed from August 6, 2018 to August 6, 2018 (for one day only) for the purpose of determining the entitlement of the shareholders for the payment of the aforesaid interim dividend, subject to approval of the interim dividend by the Board of Directors. This is for your information and records."
            ],
            [
                "27-07-2018",
                "Quarterly Results & Second Interim Dividend The Board of Directors of the Company is scheduled to be held on July 26-27, 2018 to consider amongst others: 1) Un-audited Financial Results of the Company for the quarter ended June 30, 2018; 2) Payment of 2nd Interim dividend for the financial year 2018-19. The items relating to financial results and payment of Interim dividend shall be considered by the Board on July 27, 2018. We would like to inform you that the Register of Members and Share Transfer Books shall remain closed from August 6, 2018 to August 6, 2018 (for one day only) for the purpose of determining the entitlement of the shareholders for the payment of the aforesaid interim dividend, subject to approval of the interim dividend by the Board of Directors."
            ],
            [
                "12-07-2018",
                "We would like to inform you that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday, July 12, 2018, to consider a proposal for buy-back of the equity shares of the Company in accordance with the applicable provisions of the Companies Act, 2013 and the Securities and Exchange Board of India (Buy-back of Securities) Regulations, 1998. This is for your information and records."
            ],
            [
                "02-05-2018",
                "A meeting of the Board of Directors of the Company is scheduled to be held on April 30 to May 2, 2018 to consider amongst others: 1) Audited Financial Results of the Company for the financial year ended March 31, 2018. 2) Payment of Interim dividend for the financial year 2018-19. The items relating to the audited financial results and payment of interim dividend shall be considered by the Board on May 2, 2018. The record date for determining the entitlement of the shareholders for the payment of the aforesaid interim dividend shall be May 10, 2018, subject to approval of the interim dividend by the Board of Directors. & Interim Dividend & Audited Results"
            ],
            [
                "19-01-2018",
                "HCL Technologies Ltd has informed BSE that a meeting of the Board of Directors of the Company is scheduled to be held from January 18 to 19, 2018, inter alia, to consider: 1. Un-audited Financial Results of the Company for the quarter and nine months ended December 31, 2017 (Q3). 2. Payment of 4th Interim Dividend for the financial year 2017-18. The items relating to Financial Results and payment of Interim dividend shall be considered by the Board on January 19, 2018."
            ],
            [
                "25-10-2017",
                "1. The Board of Directors has today approved the Un-Audited (Consolidated & Standalone) Financial results of the Company for the quarter and half-year ended September 30, 2017. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Report of the Statutory Auditors on the aforesaid Financial results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 is enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2017-18. The Record date of November 2, 2017 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be November 9, 2017. 4. An Investor Release dated October 25, 2017 on the financial results is enclosed at Annexure- C. This is for your information and records."
            ],
            [
                "25-10-2017",
                "Quarterly Results A meeting of the meeting of the Board of Directors of the Company is scheduled to be held from October 24-25, 2017 to consider amongst others: 1) Un-audited Financial Results of the Company for quarter and half-year ended September 30, 2017. 2) Payment of 3rd Interim dividend for the financial year 2017-18. The items relating to Financial Results and payment of Interim dividend shall be considered by the Board on October 25, 2017. The Record Date for determining the entitlement of the shareholders for the payment of aforesaid interim dividend shall be November 2, 2017, subject to approval of the interim dividend by the Board of Directors. & Third Interim Dividend"
            ],
            [
                "27-07-2017",
                "Interim Dividend 2nd Interim Dividend & Quarterly Results"
            ],
            [
                "11-05-2017",
                "Interim Dividend (Revised) & (Revised) & Audited Results (Revised)"
            ],
            [
                "09-05-2017",
                "Audited Results & We would like to inform you that a meeting of the meeting of the Board of Directors of the Company is scheduled to be held from May 9 to 11, 2017 to consider amongst others: 1) Audited Financial Results of the Company for the financial year ended March 31, 2017. 2) Payment of Interim dividend for the financial year 2017-18. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on May 11, 2017. & Interim Dividend"
            ],
            [
                "20-03-2017",
                "Buy Back of Shares"
            ],
            [
                "24-01-2017",
                "Quarterly Results & Interim Dividend 4th interim dividend"
            ],
            [
                "21-10-2016",
                "Interim Dividend Third interim dividend"
            ],
            [
                "03-08-2016",
                "Interim Dividend 2nd Interim Dividend & Quarterly Results"
            ],
            [
                "28-04-2016",
                "Quarterly Results A meeting of the meeting of the Board of Directors of the Company is scheduled to be held on April 27-28, 2016 to consider amongst others: 1. Audited Financial Results of the Company for the nine months financial period ended March 31, 2016. In terms of the provisions of Section 2(41) of the Companies Act, 2013, the current financial year of the Company is from July 01, 2015 to March 31, 2016. Henceforth, the financial year of the Company will be from 1st April to 31st March. 2. Payment of interim dividend for the financial year 2016-17. The items relating to audited financial results and payment of Interim dividend shall be considered by the Board on April 28, 2016. & Interim Dividend"
            ],
            [
                "19-01-2016",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on January 17-19, 2016, inter alia, to consider amongst others: 1. Un-audited Financial Results of the Company for the quarter and six months ended December 31, 2015; 2. Payment of 3rd Interim dividend for the financial year 2015-16. The items relating to Un-audited financial results and payment of Interim dividend shall be considered by the Board on January 19, 2016 & Third Interim Dividend"
            ],
            [
                "19-10-2015",
                "Quarterly Results & Interim Dividend Second Interim Dividend"
            ],
            [
                "03-08-2015",
                "Interim Dividend & Audited Results"
            ],
            [
                "21-04-2015",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "30-01-2015",
                "Bonus issue"
            ],
            [
                "30-01-2015",
                "Bonus issue"
            ],
            [
                "17-10-2014",
                "Interim Dividend & Quarterly Results The Board of Directors of the Company is scheduled to be held on October 16-17, 2014, to consider the Un-audited Financial Results of the Company for the quarter ended September 30, 2014 (Q1), payment of Interim dividend for the year 2014-15 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter ended September 30, 2014 and payment of Interim dividend for the year 2014-15 shall be considered on October 17, 2014. Accordingly, the financial results and interim dividend (if any) shall be declared on October 17, 2014."
            ],
            [
                "31-07-2014",
                "Interim Dividend"
            ],
            [
                "31-07-2014",
                "Interim Dividend"
            ],
            [
                "17-04-2014",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on April 15-17, 2014, inter alia, to consider the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2014, payment of Interim dividend for the year 2013-14. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2014 and payment of Interim dividend for the year 2013-14 shall be considered on April 17, 2014. Accordingly, the financial results and interim dividend (if any) shall be declared on April 17, 2014 & Interim Dividend"
            ],
            [
                "16-01-2014",
                "Second Interim Dividend & Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on January 14-16, 2014 to consider the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2013, payment of 2nd Interim dividend for the year 2013-14 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2013 and payment of 2nd Interim dividend for the year 2013-14 shall be considered on January 16, 2014. Accordingly, the financial results and interim dividend (if any) shall be declared on January 16, 2014."
            ],
            [
                "17-10-2013",
                "Quarterly Results The Board of Directors of the Company is scheduled to be held on October 15-17, 2013 to consider the Un-audited Financial Results of the Company for the quarter ended September 30, 2013, payment of Interim dividend for the year 2013-14 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter ended September 30, 2013 and payment of Interim dividend for the year 2013-14 shall be considered on October 17, 2013. Accordingly, the financial results and interim dividend (if any) shall be declared on October 17, 2013. & Interim Dividend"
            ],
            [
                "31-07-2013",
                "Final Dividend & Audited Results A meeting of the Board of Directors of the Company will be held on July 29-31, 2013, to consider the Audited Financial Results of the Company for the year ended June 30, 2013, recommendation of final dividend for the year ended June 30, 2013 and other agenda matters. Further the Company has informed that, the Audited Financial Results of the Company for the year ended June 30, 2013 and the recommendation of final dividend for the said year shall be considered on July 31, 2013. Accordingly, the financial results and recommendation of final dividend (if any) shall be announced on July 31, 2013."
            ],
            [
                "17-04-2013",
                "Quarterly Results A meeting of the Board of Directors of the Company will be held on April 15-17, 2013, inter alia, to consider the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2013, payment of 3rd Interim dividend for the year 2012-13 and other agenda matters. Further, the Company has informed that the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2013 and payment of Interim dividend for the year 2012-13 shall be considered on April 17, 2013. & Third Interim Dividend"
            ],
            [
                "17-01-2013",
                "Quarterly Results A meeting of the Board of Directors of the Company will be held on January 15-17, 2013, to consider the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2012, payment of 2nd Interim dividend for the year 2012-13 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2012 and payment of Interim dividend for the year 2012-13 shall be considered on January 17, 2013. Accordingly, the financial results and interim dividend (if any) shall be declared on January 17, 2013 & Second Interim Dividend"
            ],
            [
                "17-10-2012",
                "Quarterly Results A Meeting of the Board is scheduled to be held on October 15-16-17, 2012 to consider the Un-audited Financial Results of the company for the quarter ended September 30,2012, payment of Interim Dividend for the year 2012-13 and other agenda matters. Further, the company has informed that the Un-audited Financial Results of the company for the quarter ended September 30,2012 and payment of Interim Dividend for the year 2012-13 shall be considered on October 17, 2012. & Interim Dividend"
            ],
            [
                "25-07-2012",
                "Audited Results & Final Dividend The Board of Directors of the Company will be held on July 24- 25, 2012 at to consider the Audited Financial Results of the Company for the year ended June 30, 2012, recommendation of final dividend for the year ended June 30, 2012 and other agenda matters. Further, the Company informed that the Audited Financial Results of the Company for the year ended June 30, 2012 and the recommendation of final dividend for the said year shall be considered on July 25, 2012. Accordingly, the financial results and recommendation of final dividend (if any) shall be announced on July 25, 2012."
            ],
            [
                "18-04-2012",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on April 16-18, 2012, to consider the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2012, payment of 3rd Interim dividend for the year 2011-12 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and nine months ended March 31, 2012 and payment of Interim dividend for the year 2011-12 shall be considered on April 18, 2012. Accordingly, the financial results and interim dividend (if any) shall be declared on April 18, 2012. & 3rd Interim Dividend"
            ],
            [
                "17-01-2012",
                "Interim Dividend Second Interim Dividend & Quarterly Results The Board of Directors of the Company is scheduled to be held on January 16-17, 2012, to consider the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2011, payment of 2nd Interim Dividend for the year 2011-12 and other agenda matters. Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2011 and payment of Interim Dividend for the year 2011-12 shall be considered on January 17, 2012. Accordingly, the financial results and interim dividend (if any) shall be declared on January 17, 2012."
            ],
            [
                "18-10-2011",
                "Interim Dividend & Quarterly Results"
            ],
            [
                "27-07-2011",
                "Final Dividend & Audited Results Further, the Company has informed that, the Audited Financial Results of the Company for the year ended June 30, 2011 and the recommendation of final dividend for the said year shall be considered on July 27, 2011."
            ],
            [
                "25-07-2011",
                "Audited Results Further, the Company has informed that, the Audited Financial Results of the Company for the year ended June 30, 2011 and the recommendation of final dividend for the said year shall be considered on July 27, 2011.  & Final Dividend"
            ],
            [
                "19-04-2011",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on April 19, 2011 and April 20, 2011, inter alia, to:  a) Consider and take on record the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011.  b) Consider the payment of 3rd Interim Dividend for the year 2010-2011.  Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011 and payment of interim dividend shall be considered on April 20, 2011 & Interim Dividend"
            ],
            [
                "20-04-2011",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on April 19, 2011 and April 20, 2011, inter alia, to:  a) Consider and take on record the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011.  b) Consider the payment of 3rd Interim Dividend for the year 2010-2011.  Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011 and payment of interim dividend shall be considered on April 20, 2011  & Interim Dividend A meeting of the Board of Directors of the Company is scheduled to be held on April 19, 2011 and April 20, 2011, inter alia, to:  a) Consider and take on record the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011.  b) Consider the payment of 3rd Interim Dividend for the year 2010-2011.  Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2011 and payment of interim dividend shall be considered on April 20, 2011"
            ],
            [
                "18-01-2011",
                "Quarterly Results & & 19/01/2011   Second Interim Dividend  will be held on January 18, 2011 and January 19, 2011, inter-alia, to :  1. Consider and take on record the Un-audited Financial Results of the Company for the quarter and half-year ended December 31, 2010.  2. Consider the payment of 2nd Interim Dividend for the year 2010-2011.  Further the Company has informed that the Un-audited Financial Results of the Company for the quarter and half year ended December 31, 2010 and payment of interim dividend shall be considered on January 19, 2011."
            ],
            [
                "19-10-2010",
                "Quarterly Results & 20/10/2010 & Interim Dividend"
            ],
            [
                "27-07-2010",
                "Audited Results"
            ],
            [
                "29-07-2010",
                "Final Dividend"
            ],
            [
                "28-07-2010",
                "Audited Results"
            ],
            [
                "20-04-2010",
                "Quarterly Results & Interim Dividend The Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2010 and the recommendation of interim dividend for the said year shall be considered on April 21, 2010."
            ],
            [
                "21-04-2010",
                "Quarterly Results & Interim Dividend The Un-audited Financial Results of the Company for the quarter and nine-months ended March 31, 2010 and the recommendation of interim dividend for the said year shall be considered on April 21, 2010."
            ],
            [
                "24-01-2010",
                "& Interim Dividend & 25/01/2010   Quarterly Results  A meeting of the Board of Directors of the Company will be held on January 24, 2010 and January 25, 2010, inter alia, to :  1. Consider and take on record the Un-audited Financial Results of the Company for the quarter and six months ended December 31, 2009 (Q2).  2. Consider the payment of 2nd Interim Dividend for the year 2009-10.  Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter and six months ended December 31, 2009 and the recommendation of interim dividend for the said year shall be considered on January 25, 2010."
            ],
            [
                "27-10-2009",
                "Quarterly Results & 28/10/2009 & Interim Dividend  A meeting of the Board of Directors of the Company will be held on October 27, 2009 & October 28, 2009,  Further the Company has informed that, the Un-audited Financial Results of the Company for the quarter ended September 30, 2009 and the recommendation of interim dividend for the said year shall be considered on October 28, 2009."
            ],
            [
                "27-10-2009",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "24-08-2009",
                "Audited Results & & 25/08/2009   Final Dividend"
            ],
            [
                "22-04-2009",
                "Quarterly Results & 3rd Interim Dividend"
            ],
            [
                "21-04-2009",
                "Quarterly Results & 3rd Interim Dividend"
            ],
            [
                "23-01-2009",
                "Quarterly Results & Second Interim Dividend"
            ],
            [
                "15-10-2008",
                "Interim Dividend & Quarterly Results"
            ],
            [
                "01-08-2008",
                "to Final Dividend & Audited Results A meeting of the Board of Directors of the Company will be held from July 30, 2008 to August 01, 2008.  Company informed that the Audited Financial Results of the Company for the year ended June 30, 2008 and the recommendation of final dividend for the said year shall be considered on August 01, 2008."
            ],
            [
                "15-04-2008",
                "Interim Dividend & Quarterly Results"
            ],
            [
                "17-01-2008",
                "Quarterly Results & Interim Dividend 2nd Interim Dividend"
            ],
            [
                "17-10-2007",
                "Interim Dividend & Quarterly Results (Cancelled)"
            ],
            [
                "16-10-2007",
                "Quarterly Results The un-audited financial results and the payment of interim dividend shall be considered on October 17, 2007."
            ],
            [
                "13-08-2007",
                "Final Dividend & Audited Results"
            ],
            [
                "16-04-2007",
                "Interim Dividend & Quarterly Results"
            ],
            [
                "17-04-2007",
                "Quarterly Results Meeting of the Board of Directors of the Company which was scheduled to be held on April 16, 2007 would now be held over two days i.e. April 16 & 17, 2007 and accordingly the Un-audited financial results of the Company for the quarter and nine months ended March 31, 2007 and payment of 3rd Interim Dividend for the year 2006-07, shall be considered on April 17, 2007."
            ],
            [
                "15-01-2007",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "16-10-2006",
                "Quarterly Results & Interim Dividend"
            ],
            [
                "19-08-2006",
                "& Dividend & Accounts"
            ],
            [
                "18-08-2006",
                "Accounts for the year ended 30th June, 2006.& Dividend"
            ],
            [
                "18-04-2006",
                "Quarterly Results & 3rd Interim Dividend & 19/04/2006"
            ],
            [
                "18-01-2006",
                "Quarterly Results & Interim Dividend"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "28-04-2025",
                "28-04-2025",
                "900%",
                "Enclosed please find Outcome for Board Meeting - Audited Financial Results for the quarter and year ended March 31, 2025 The Board of Directors has declared an Interim Dividend of Rs. 18/- per equity share of Rs. 2/- each of the Company for the Financial Year 2025-26 The Record date for the payment of the aforesaid interim dividend shall be April 28, 2025 and the payment date of the said interim dividend shall be May 6, 2025."
            ],
            [
                "17-01-2025",
                "17-01-2025",
                "300%",
                "The Board of Directors has declared 4th Interim Dividend of Rs. 18/- per equity share of Rs. 2/- each of the Company for the Financial Year 2024-25. This includes a special dividend of Rs. 6/- per share to celebrate 25 years of the Company's public listing."
            ],
            [
                "17-01-2025",
                "17-01-2025",
                "600%",
                "The Board of Directors has declared 4th Interim Dividend of Rs. 18/- per equity share of Rs. 2/- each of the Company for the Financial Year 2024-25. This includes a special dividend of Rs. 6/- per share to celebrate 25 years of the Company's public listing."
            ],
            [
                "22-10-2024",
                "22-10-2024",
                "600%",
                "The Board of Directors has declared an Interim Dividend of Rs. 12 /- per equity share of Rs. 2/- each of the Company for the Financial Year 2024-25."
            ],
            [
                "23-07-2024",
                "23-07-2024",
                "600%",
                "The Board of Directors has today. The Board of Directors has declared an Interim Dividend of Rs. 12 /- per equity share of Rs. 2/- each of the Company for the Financial Year 2024-25. The Record date of July 23, 2024 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be August 1, 2024."
            ],
            [
                "07-05-2024",
                "07-05-2024",
                "900%",
                "The Board of Directors has declared an Interim Dividend of Rs.18/- per equity share of Rs.2/- each of the Company for the Financial Year 2024-25."
            ],
            [
                "20-01-2024",
                "19-01-2024",
                "600%",
                "Board approved:- The Board of Directors has declared an Interim Dividend of Rs.12/- per equity share of Rs.2/- each of the Company for the Financial Year 2023-24. The Record date of January 20, 2024 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be January 31, 2024."
            ],
            [
                "20-10-2023",
                "20-10-2023",
                "600%",
                "The Board of Directors has declared an interim dividend of Rs. 12/- per equity share of Rs. 2/- each for the financial year 2023-2024. The record date of October 20, 2023 fixed for the payment of the aforesaid dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be October 31, 2023."
            ],
            [
                "20-07-2023",
                "20-07-2023",
                "500%",
                "The Board of Directors has declared interim dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the financial year 2023-24. The record date of July 20, 2023 fixed for payment of aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be August 1, 2023."
            ],
            [
                "28-04-2023",
                "28-04-2023",
                "900%",
                "Board has declared Interim Dividend of Rs. 18/per equity share of Rs.2/- each of Company for FY 2023-24. 4. Record date of April 28, 2023 fixed for payment of aforesaid interim dividend has been confirmed by Board. The payment date of said interim dividend shall be May 9, 2023. Board Meeting commenced at 11:00 AM (IST) on April 19, 2023 and was adjourned at 08.20 PM (IST). Adjourned meeting was reconvened on April 20, 2023 at 01.20 PM (IST) and concluded at 4.30 PM (IST). aforesaid financial results and interim dividend were considered and approved by Board on April 20, 2023."
            ],
            [
                "20-01-2023",
                "19-01-2023",
                "500%",
                "The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of January 20, 2023, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 1, 2023."
            ],
            [
                "20-10-2022",
                "19-10-2022",
                "500%",
                "The Board of Directors has declared an Interim Dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of October 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 2, 2022."
            ],
            [
                "20-07-2022",
                "19-07-2022",
                "500%",
                "The Board of Directors has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of July 20, 2022, fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 2, 2022."
            ],
            [
                "29-04-2022",
                "28-04-2022",
                "900%",
                "The Board of Directors has declared an Interim Dividend of Rs.18/- per equity share of Rs.2/- each of the Company for the Financial Year 2022-23. The Record date of April 29, 2022 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be May 11, 2022."
            ],
            [
                "22-01-2022",
                "20-01-2022",
                "500%",
                "The Board of Directors has declared an Interim Dividend of Rs. 10/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of January 22, 2022 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 4, 2022."
            ],
            [
                "23-10-2021",
                "21-10-2021",
                "500%",
                "HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on October 14, 2021, inter alia, has declared an Interim Dividend of Rs.10/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22."
            ],
            [
                "28-07-2021",
                "27-07-2021",
                "300%",
                "The Board of Directors has declared an Interim Dividend of Rs. 6/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of July 28, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 10, 2021. The Board of Directors has declared an Interim Dividend of Rs. 6/- per equity share of Rs.2/- each of the Company for the Financial Year 2021-22. The Record date of July 28, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 10, 2021. (As Per BSE Announcement dated on 19.07.2021)"
            ],
            [
                "01-05-2021",
                "29-04-2021",
                "500%",
                "The Board of Directors has declared 1st Interim Dividend of Rs.6/- per equity share of Rs. 2/- each and a Special interim dividend of Rs.10/- per equity share of Rs.2/- each for FY 2021-22. The Special Interim Dividend has been declared by the Board in recognition of the Company's recent milestone, crossing the $10 Billion mark in Revenue during FY'21. The total interim dividend of Rs. 16/- per equity share of Rs. 2/- each will be paid on May 19, 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of May 1, 2021, already announced for the purpose"
            ],
            [
                "01-05-2021",
                "29-04-2021",
                "300%",
                "The Board of Directors has declared 1st Interim Dividend of Rs.6/- per equity share of Rs. 2/- each and a Special interim dividend of Rs.10/- per equity share of Rs.2/- each for FY 2021-22. The Special Interim Dividend has been declared by the Board in recognition of the Company's recent milestone, crossing the $10 Billion mark in Revenue during FY'21. The total interim dividend of Rs. 16/- per equity share of Rs. 2/- each will be paid on May 19, 2021 to those members whose names appear on the Register of Members of the Company and as beneficial owners in the Depositories, determined with reference to the Record Date of May 1, 2021, already announced for the purpose"
            ],
            [
                "23-01-2021",
                "21-01-2021",
                "200%",
                "1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter and nine months ended December 31, 2020. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Report of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company is enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.4/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of January 23, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 8, 2021. 4. An Investor Release dated January 15, 2021 on the financial results is enclosed at Annexure- C. The Board of Directors has declared an Interim Dividend of Rs.4/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of January 23, 2021 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be February 8, 2021."
            ],
            [
                "24-10-2020",
                "22-10-2020",
                "200%",
                "The Board of Directors has declared an Interim Dividend of Rs.4/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of October 24, 2020 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be November 9, 2020"
            ],
            [
                "25-07-2020",
                "23-07-2020",
                "100%",
                "The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2020-21. The Record date of July 25, 2020 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 7, 2020."
            ],
            [
                "16-09-2020",
                "14-09-2020",
                "100%",
                "The Board of Directors has recommended a Final Dividend of Rs.2/- per equity share of Rs.2/-each of the Company for the Financial Year 2019-20, subject to the approval of the shareholders in the ensuing Annual General Meeting of the Company. Dear Sir, The shareholders of the Company in its meeting held on September 29, 2020 declared the Final Dividend for the financial year 2019-20. The date of payment of the dividend shall be October 5, 2020. This is for your information and records. (AS Per BSE Announcement Dated on 29.09.2020)"
            ],
            [
                "27-01-2020",
                "24-01-2020",
                "100%",
                "The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share on face value of Rs.2/- per equity share of the Company, for the Financial Year 2019-20. The Board of Directors has approved January 27, 2020 as record date for the payment of the aforesaid interim dividend. The Payment date of the said interim dividend shall be February 4, 2020."
            ],
            [
                "01-11-2019",
                "31-10-2019",
                "100%",
                "The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share on face value of Rs.2/- per equity share of the Company, for the Financial Year 2019-20."
            ],
            [
                "17-08-2019",
                "14-08-2019",
                "100%",
                "Dear Sir, 1. The Board of Directors has today approved the Unaudited (Consolidated & Standalone) Financial results of the Company for the quarter ended June 30, 2019. The Financial Results under Regulation 33 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 along with declaration prescribed under these regulations are enclosed at Annexure- A. 2. The Limited Review Report of the Statutory Auditors on the aforesaid Consolidated & Standalone Financial results of the Company is enclosed at Annexure- B. 3. The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2019-20. The Record date of August 17, 2019 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The Payment date of the said interim dividend shall be August 26, 2019. 4. An Investor Release dated August 7, 2019 on the financial results is enclosed at Annexure- C."
            ],
            [
                "17-08-2019",
                "14-08-2019",
                "100%",
                "Second Interim Dividend"
            ],
            [
                "17-05-2019",
                "16-05-2019",
                "100%",
                "HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 09, 2019, inter alia, has declared an Interim Dividend of Rs. 2/- per equity share of Rs. 2/- each of the Company for the Financial Year 2019-20. The Payment date of the said interim dividend shall be May 24, 2019."
            ],
            [
                "17-05-2019",
                "16-05-2019",
                "100%",
                "Interim Dividend"
            ],
            [
                "06-02-2019",
                "05-02-2019",
                "100%",
                "1. The Directors has today approved the Un-Audited (Consolidated & Standalone)Financial results of the Company for the quarter and nine months ended Dec 31, 2018. The Financial Results under Regulation 33 of the SEBI (LODR) Regulations, 2015 are enclosed at Annexure- A. 2. The Limited Review Report of the Statutory Auditors on the aforesaid Financial results under Regulation 33 of the SEBI (LODR) Regulations, 2015 is enclosed at Annexure- B. 3. The Directors has declared an Interim Dividend of Rs. 2/- per equity share of Rs. 2/- each of the Company for the FY 2018-19. The Record date of February 6, 2019 fixed for the payment of the aforesaid interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be Feb 14, 2019. 4. An Investor Release dated Jan 29, 2019 on the financial results is enclosed at Annexure- C. This is for your information and records."
            ],
            [
                "06-02-2019",
                "05-02-2019",
                "100%",
                ""
            ],
            [
                "31-10-2018",
                "30-10-2018",
                "100%",
                "The Board of Directors has declared an Interim Dividend of Rs.2/- per equity share of Rs.2/-each of the Company for the FY2018-19. The Record date of Oct 31,2018 fixed for the payment of the interim dividend has been confirmed by the Board of Directors. The payment date of the said interim dividend shall be Nov 11,2018. Re.: Dividend payment date (corrigendum) Dear Sir, This is further to our letter dated October 23, 2018 on the captioned subject which inter-alia provided date of payment of 3rd Interim Dividend (2018-19) as November 11, 2018. There was an inadvertent error in stating the date as November 11, 2018. We would request you to kindly read the date of payment of 3rd Interim Dividend (2018-19) as November 9, 2018. This is for your information and records."
            ],
            [
                "31-10-2018",
                "30-10-2018",
                "100%",
                "Third Interim Dividend"
            ],
            [
                "06-08-2018",
                "02-08-2018",
                "100%",
                "HCL Technologies Ltd has informed BSE that the Board of Directors of the Company at its meeting held on July 27, 2018, inter alia, has declared an Interim Dividend of Rs. 2/- per equity share of Rs. 2/- each of the Company for the Financial Year 2018-19."
            ],
            [
                "06-08-2018",
                "02-08-2018",
                "100%",
                "Second Interim Dividend"
            ],
            [
                "10-05-2018",
                "09-05-2018",
                "100%",
                "1. The Board of Directors has today declared the Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2018-19. Further, the Board of Directors has fixed May 10, 2018 as the Record Date for determining the entitlement of the shareholders to the aforesaid interim dividend. The Payment date of the said interim dividend shall be May 17, 2018. This is for your information and records. 1. The Board of Directors has today declared the Interim Dividend of Rs.2/- per equity share of Rs.2/- each of the Company for the Financial Year 2018-19. Further, the Board of Directors has fixed May 10, 2018 as the Record Date for determining the entitlement of the shareholders to the aforesaid interim dividend. The Payment date of the said interim dividend shall be May 17, 2018. This is for your information and records."
            ],
            [
                "10-05-2018",
                "09-05-2018",
                "100%",
                "Interim Dividend"
            ],
            [
                "30-01-2018",
                "29-01-2018",
                "100%",
                "Fourth Interim Dividend"
            ],
            [
                "02-11-2017",
                "01-11-2017",
                "100%",
                "Third Interim Dividend"
            ],
            [
                "04-08-2017",
                "03-08-2017",
                "100%",
                "Second Interim Dividend"
            ],
            [
                "25-05-2017",
                "24-05-2017",
                "300%",
                ""
            ],
            [
                "02-02-2017",
                "01-02-2017",
                "300%",
                "Interim Dividend"
            ],
            [
                "29-10-2016",
                "27-10-2016",
                "300%",
                "Third Interim Dividend"
            ],
            [
                "11-08-2016",
                "10-08-2016",
                "300%",
                "Second Interim Dividend"
            ],
            [
                "06-05-2016",
                "05-05-2016",
                "300%",
                "Interim Dividend"
            ],
            [
                "28-01-2016",
                "27-01-2016",
                "300%",
                "Third Interim Dividend"
            ],
            [
                "26-10-2015",
                "23-10-2015",
                "250%",
                "Second Interim Dividend"
            ],
            [
                "10-08-2015",
                "07-08-2015",
                "250%",
                "Interim Dividend"
            ],
            [
                "27-04-2015",
                "24-04-2015",
                "200%",
                "Interim Dividend"
            ],
            [
                "05-02-2015",
                "04-02-2015",
                "400%",
                "Interim Dividend"
            ],
            [
                "23-10-2014",
                "21-10-2014",
                "300%",
                "Interim Dividend"
            ],
            [
                "06-08-2014",
                "05-08-2014",
                "600%",
                "Interim Dividend"
            ],
            [
                "23-04-2014",
                "22-04-2014",
                "200%",
                "Rs.4.0000 per share(200%)Interim Dividend"
            ],
            [
                "23-01-2014",
                "22-01-2014",
                "200%",
                "Second Interim Dividend"
            ],
            [
                "20-12-2013",
                "18-12-2013",
                "300%",
                "Rs.6.0000 per share(300%)Final Dividend"
            ],
            [
                "23-10-2013",
                "22-10-2013",
                "100%",
                "Interim Dividend"
            ],
            [
                "23-04-2013",
                "22-04-2013",
                "100%",
                "Rs.2.0000 per share(100%)Interim Dividend"
            ],
            [
                "22-01-2013",
                "21-01-2013",
                "100%",
                ""
            ],
            [
                "23-10-2012",
                "19-10-2012",
                "100%",
                "Rs.2.0000 per share(100%)Interim Dividend"
            ],
            [
                "23-10-2012",
                "19-10-2012",
                "200%",
                "Rs.4.00 per share(200%)Final Dividend"
            ],
            [
                "24-04-2012",
                "23-04-2012",
                "100%",
                "Third Interim Dividend"
            ],
            [
                "23-01-2012",
                "20-01-2012",
                "100%",
                "Second Interim Dividend"
            ],
            [
                "25-10-2011",
                "21-10-2011",
                "100%",
                "08/11/2011 Equity Rs.2.00 per share(100%)Final Dividend Rs.2.00 per share(100%)Interim Dividend"
            ],
            [
                "25-10-2011",
                "21-10-2011",
                "100%",
                ""
            ],
            [
                "25-10-2011",
                "21-10-2011",
                "100%",
                "Rs.2.00 per share(100%)Final Dividend"
            ],
            [
                "26-04-2011",
                "25-04-2011",
                "100%",
                "Third Interim Dividend"
            ],
            [
                "25-01-2011",
                "24-01-2011",
                "100%",
                "Second Interim Dividend"
            ],
            [
                "26-10-2010",
                "22-10-2010",
                "75%",
                "Interim Dividend (To be decided at Board Meeting on 19-20/10/2010)"
            ],
            [
                "26-10-2010",
                "22-10-2010",
                "50%",
                "Rs.1.00 per share(50%)Final Dividend"
            ],
            [
                "27-04-2010",
                "26-04-2010",
                "50%",
                "Interim Dividend"
            ],
            [
                "01-02-2010",
                "29-01-2010",
                "50%",
                "Second Interim Dividend"
            ],
            [
                "04-12-2009",
                "02-12-2009",
                "50%",
                "Rs.1.00 per share(50%)Final Dividend & A.G.M."
            ],
            [
                "03-11-2009",
                "30-10-2009",
                "50%",
                "Rs.1.00 per share(50%)Final Dividend"
            ],
            [
                "27-04-2009",
                "24-04-2009",
                "50%",
                "Third Interim Dividend"
            ],
            [
                "29-01-2009",
                "28-01-2009",
                "100%",
                "100% Second Interim Dividend"
            ],
            [
                "24-10-2008",
                "22-10-2008",
                "300%",
                "300% Dividend & A.G.M. (150% Final Dividend &"
            ],
            [
                "22-04-2008",
                "21-04-2008",
                "100%",
                "100% Third Interim Dividend"
            ],
            [
                "24-01-2008",
                "23-01-2008",
                "100%",
                "100% Second Interim Dividend"
            ],
            [
                "04-12-2007",
                "30-11-2007",
                "100%",
                "Interim Dividend"
            ],
            [
                "24-10-2007",
                "23-10-2007",
                "100%",
                "100% Final Dividend & A.G.M."
            ],
            [
                "24-04-2007",
                "23-04-2007",
                "100%",
                "100% Third Interim Dividend"
            ],
            [
                "22-01-2007",
                "19-01-2007",
                "200%",
                "200% Interim Dividend"
            ],
            [
                "06-12-2006",
                "04-12-2006",
                "200%",
                "Interim Dividend"
            ],
            [
                "23-10-2006",
                "20-10-2006",
                "200%",
                "200% Final Dividend"
            ],
            [
                "26-04-2006",
                "25-04-2006",
                "200%",
                "200% Third Interim Dividend"
            ],
            [
                "25-01-2006",
                "24-01-2006",
                "200%",
                "200% Interim Dividend"
            ]
        ]
    },
    "splits": {
        "title": "Split",
        "msg": "HCL Technologies has not announced any stock split for the last few years."
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "07-12-2019",
                "05-12-2019",
                "1:1"
            ],
            [
                "20-03-2015",
                "19-03-2015",
                "1:1"
            ],
            [
                "16-03-2007",
                "15-03-2007",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "HCL Technologies has not announced any rights for the last few years."
    }
}