[
    {
        "title": "Release - 'Hcltech Grant Americas Second Edition Awards $1 Million To Three Ngos To Create Scalable Solutions To Combat Climate Change' 22h - HCLTech awards $1 million to three NGOs for scalable climate change solutions in the Americas.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=13bc9b61-7e4f-4397-aa7c-ddd562b49cf4.pdf",
        "date": "22h - HCLTech awards $1 million to three NGOs for scalable climate change solutions in the Americas."
    },
    {
        "title": "Release - 'Hcltech And Uipath Partner To Accelerate Agentic Automation For Global Enterprises' 2 Jun - HCLTech partners with UiPath to accelerate global agentic automation and establish AI Lab in India.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=8bce1391-3f64-49da-9211-c9b7d54240b6.pdf",
        "date": "2 Jun - HCLTech partners with UiPath to accelerate global agentic automation and establish AI Lab in India."
    },
    {
        "title": "Release - 'Hcltech Among Asia'S Most Honored In Extel'S 2025 Executive Team Rankings' 30 May - HCLTech tops Extel's 2025 Asia Executive Team rankings with 17 Top 3 awards, including Best CEO and CFO.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=f0264430-0c27-4342-b542-67fc057795ff.pdf",
        "date": "30 May - HCLTech tops Extel's 2025 Asia Executive Team rankings with 17 Top 3 awards, including Best CEO and CFO."
    },
    {
        "title": "Release - 'Hcltech Recognized As A Customers' Choice In 2025 Gartner® Peer Insights™ Voice Of The Customer For Managed Network Services, Worldwide' 29 May - HCLTech named Customers' Choice in 2025 Gartner Peer Insights for Managed Network Services worldwide.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=127a5e3b-fcf1-4baf-9740-7d6605ebab7c.pdf",
        "date": "29 May - HCLTech named Customers' Choice in 2025 Gartner Peer Insights for Managed Network Services worldwide."
    },
    {
        "title": "Release - 'Hcltech Recognized As A Leader In Everest Group'S Custom Application Development Services PEAK Matrix® Assessment 2025' 28 May - HCLTech named Leader in Everest Group's 2025 Custom Application Development Services PEAK Matrix.",
        "link": "https://www.bseindia.com/stockinfo/AnnPdfOpen.aspx?Pname=b3d9e67a-96b0-4aed-96eb-4b2584fda8f1.pdf",
        "date": "28 May - HCLTech named Leader in Everest Group's 2025 Custom Application Development Services PEAK Matrix."
    }
]