{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "08-05-2025",
                "Titan Company Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/05/2025 inter alia to consider and approve the audited financial results for the quarter and year ended 31st March 2025. Outcome of the Board meeting held on May 08, 2025 (As Per BSE Announcement Dated on: 08/05/2025)"
            ],
            [
                "04-02-2025",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2025 inter alia to consider and approve the unaudited financial results for the quarter and nine months ended 31st December 2024. Outcome of the Board Meeting in accordance with the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 Outcome of the Board Meeting in accordance with the SEBI (LODR) Regulation, 2015 (As per BSE Announcement Dated on 04/02/2025)"
            ],
            [
                "05-11-2024",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/11/2024 inter alia to consider and approve the unaudited financial results for the quarter and half year ended 30th September 2024 financial results for the quarter and half year ended 30th September 2024 (As per BSE Announcement Dated on 05/11/2024)"
            ],
            [
                "02-08-2024",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 02/08/2024 inter alia to consider and approve the unaudited financial results for the quarter ended 30th June 2024. Outcome of the Board Meeting in accordance with the SEBI (LODR) Regulation, 2015 (As Per BSE Announcement dated on 02.08.2024)"
            ],
            [
                "03-05-2024",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/05/2024 inter alia to consider and approve the audited financial results for the quarter and year ended 31st March 2024. TITAN COMPANY LIMITED has informed BSE about Board Meeting to be held on 03 May 2024 to consider financial statements for the period ended March 2024. Financial results / Dividend. (As Per BSE Announcement Dated on 22.04.2024) The Board at its meeting held today, i.e. Friday, 3rd May 2024 Approved the audited standalone and consolidated financial results for the quarter and year ended 31st March 2024. In this regard, please find enclosed: a) Audited Standalone and Consolidated Financial Results of the Company for the quarter and year ended 31st March 2024. b) Auditor's Report in respect of the Audited Standalone and Consolidated Financial Results of the Company for the quarter and year ended 31 st March 2024. 2. B S R & Co., LLP, statutory auditors of the Company, have issued an audit report with unmodified opinion on the above-mentioned results. 3. The Board has recommended a Dividend of Rs.11.00 per Equity Share oft 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 40th Annual General Meeting, subject to the approval of the shareholders of the Company. 4. The Board based on the recommendation of the Board Nomination and Remuneration Committee approved the re-appointment of Mr.CK Yenkataraman (DIN: 05228157) as the Managing Director of the Company for a further period with effect from 1st October 2024 up to 31 st December 2025, subject to the approval of the shareholders of the Company. 5. The Board based on the recommendation of the Board Nomination and Remuneration Committee approved the re-appointment of Dr. Mohanasankar Sivaprakasam (DIN: 08497296) as a Non-Executive Independent Director for a second term of 5 years from 3rd July 2024 up to 2nd July 2029, subject to the approval of the shareholders of the Company. (As Per BSE Announcement Dated on 03.05..2024)"
            ],
            [
                "01-02-2024",
                "Quarterly Results"
            ],
            [
                "01-02-2024",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/02/2024 inter alia to consider and approve the unaudited financial results for the quarter and nine months ended 31st December 2023. Unaudited Financial Results (standalone and consolidated) for the quarter and nine months ended 31st December 2023 (As Per BSE Announcement Dated on: 01/02/2024)"
            ],
            [
                "03-11-2023",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/11/2023 inter alia to consider and approve the unaudited financial results for the quarter and half year ended 30th September 2023. Unaudited Financial Results (standalone and consolidated) for the second quarter and half year ended 30th September 2023 Outcome of the Board Meeting in accordance with the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 Change in Directors - Nominee Director of TIDCO (As Per BSE Announcement Dated on 03.11.2023) Newspaper publication for unaudited financial results for the second quarter and half year ended 30th September 2023 (As Per BSE Announcement Dated on 06/11/2023)"
            ],
            [
                "17-10-2023",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/10/2023 inter alia to consider and approve the proposal for issuance of rated listed redeemable unsecured Non-Convertible Debentures on a private placement basis within the permissible borrowing limits under Section 180 of the Companies Act 2013. Disclosure under Regulation 30 of the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 ('Listing Regulations'): Change in Directorate Outcome of Board Meeting - Issue of rated, listed, redeemable, unsecured NCDs and availing long-term borrowings. (As Per BSE Announcement dated on 17.10.2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "02-08-2023",
                "Quarterly Results"
            ],
            [
                "02-08-2023",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 02/08/2023 inter alia to consider and approve Board Meeting to consider and approve the unaudited financial results for the quarter ended 30th June 2023. TITAN COMPANY LIMITED has informed BSE about Board Meeting to be held on 02 Aug 2023 to consider financial statements for the period ended June 2023. Financial results. (As Per BSE Announcement Dated on 12.07.2023) Unaudited Financial Results (standalone and consolidated) for the first quarter ended 30th June 2023. (As Per BSE Announcement dated on 02.08.2023)"
            ],
            [
                "03-05-2023",
                "Quarterly Results"
            ],
            [
                "03-05-2023",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/05/2023 inter alia to consider and approve the audited financial results for the quarter and year ended 31st March 2023. Dividend & Audited Results (As Per BSE Bulletin dated on 19.04.2023) The Board has recommended a Dividend of Rs.10.00 per Equity Share of { 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 39th Annual General Meeting subject to the approval of the shareholders of the Company. (As Per BSE Bulletin Dated on 03.05.2023) Outcome of the Board Meeting in accordance with the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 Audited Financial Results, Audited Consolidated Financial Results for year ended 31st March 2023. (As per BSE Announcement Dated on 03/05/2023)"
            ],
            [
                "23-02-2023",
                "Intimation under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015"
            ],
            [
                "02-02-2023",
                "Quarterly Results"
            ],
            [
                "02-02-2023",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 02/02/2023 inter alia to consider and approve the unaudited financial results for the quarter and nine months ended 31st December 2022. Unaudited Financial Results (standalone and consolidated) for the third quarter and nine months ended 31st December 2022. Outcome of the Board Meeting held on 2nd February 2023 to adopt the Titan Company Limited Performance Based Stock Unit Scheme 2023 (As Per BSE Announcement Dated on 02.02.2023)"
            ],
            [
                "04-11-2022",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/11/2022 inter alia to consider and approve the unaudited financial results for the quarter and half year ended 30th September 2022. Unaudited Financial Results (standalone and consolidated) for the second quarter and half year ended 30th September 2022. (As Per BSE Announcement dated on 04.11.2022)"
            ],
            [
                "05-08-2022",
                "Quarterly Results"
            ],
            [
                "05-08-2022",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/08/2022 inter alia to consider and approve the unaudited financial results for the quarter ended 30th June 2022. Unaudited Financial Results (standalone and consolidated) for the quarter ended 30th June 2022. (As per BSE Announcement Dated on 05/08/2022)"
            ],
            [
                "03-05-2022",
                "Quarterly Results"
            ],
            [
                "03-05-2022",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/05/2022 inter alia to consider and approve the audited financial results for the quarter and year ended 31st March 2022 Outcome of the Board Meeting in accordance with the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 Disclosure under Regulation 30(1) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 - Reappointment of Statutory Auditors Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 03, 2022, inter alia, has recommended a Dividend of Rs. 7.50 per Equity Share of Rs. 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 38th Annual General Meeting subject to the approval of the shareholders of the Company. Pursuant to the Finance Act, 2020, with effect from April 01, 2020, Dividend Distribution Tax is abolished and dividend income is taxable in the hands of the shareholders. In view of the same, the dividend payments will be subject to deduction of tax at source, as may be applicable. (As per BSE Announcement Dated on 3/5/2022)"
            ],
            [
                "03-02-2022",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 03/02/2022 inter alia to consider and approve the unaudited financial results for the quarter and nine months ended 31st December 2021 Unaudited Financial Results (standalone and consolidated) for the third quarter and nine months ended 31st December 2021 (As Per BSE Announcement dated on 03.02.2022)"
            ],
            [
                "27-10-2021",
                "Quarterly Results"
            ],
            [
                "27-10-2021",
                "Quarterly Results"
            ],
            [
                "04-08-2021",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/08/2021 ,inter alia, to consider and approve the unaudited financial results for the quarter ended 30th June 2021."
            ],
            [
                "28-06-2021",
                "Change in Key Managerial Personnel (Chief Financial Officer) of the Company"
            ],
            [
                "29-04-2021",
                "Quarterly Results"
            ],
            [
                "29-04-2021",
                "Titan Company Ltd has informed BSE that a meeting of the Board of Directors of the Company is scheduled to be held on April 29, 2021, inter alia to:1. Consider and approve the audited standalone & consolidated financial results for the quarter and year ending March 31, 2021; and2. Recommend payment of equity dividend for the Financial Year 2020-21, if any.As intimated to the Stock Exchanges vide letter dated March 22, 2021, the Trading Window for the purpose of trading in the shares of the Company by its `Designated Persons' is closed from March 24, 2021 and shall be opened 48 (Forty-Eight) hours after the conclusion of the aforesaid meeting of the Board of Directors. Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on April 29, 2021, inter alia, has recommended a Dividend of Rs. 4 per Equity Share of Rs. 1 each of the Company, which shall be paid / dispatched on or after the seventh day from the conclusion of the 37th Annual General Meeting subject to approval of the shareholders of the Company. Audited Financial Results, Audited Consolidated Financial Results for year ended 31st March 2021 Outcome of the Board Meeting in accordance with the SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015 (As Per BSE Announcement Dated on 4/29/2021 6:51:16 PM)"
            ],
            [
                "10-02-2021",
                "Quarterly Results"
            ],
            [
                "10-02-2021",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/02/2021 ,inter alia, to consider and approve the unaudited financial results for the quarter and nine months ended 31st December 2020 Unaudited Financial Results (standalone and consolidated) for the quarter ended 31st December 2020 (As Per BSE Announcement dated on 10.02.2021)"
            ],
            [
                "07-12-2020",
                "Outcome of the Board Meeting in accordance with Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulation, 2015"
            ],
            [
                "28-10-2020",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 28/10/2020 ,inter alia, to consider and approve the unaudited financial results for the quarter and half year ended 30th September 2020. Unaudited Financial Results (standalone and consolidated) for the quarter and half year ended 30th September 2020 (As Per BSE Announcement dated on 28.10.2020)"
            ],
            [
                "10-08-2020",
                "Quarterly Results"
            ],
            [
                "10-08-2020",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 10/08/2020 ,inter alia, to consider and approve Board Meeting to consider and approve the unaudited financial results for the quarter ended 30th June 2020 Unaudited Financial Results (standalone and consolidated) for the quarter ended 30th June 2020. 1. Appointment of Mr. Hemaram Choudhary(DIN No.:08817929) as Additional Independent Director of the company subject to the approval of shareholders. 2. Re-appointment of M/s Gandhi Gandhi & Co., Chartered Accountants, as an internal auditor of the company. 3. Re-appointment of Mr. Lalitkumar Gandhi(DIN No.:00618427) as the Managing Director of the company. 4. Re-appointment of M/S Anamika Jajoo as Secretarial auditor of the company in accordance with Section 204(1) of the Companies Act,2013 to conduct Secretarial Audit for the financial year 2020-2021. 5.the Audit committee of the company was reconstituted. 6.the Nomination and remuneration committee of the company was re-constituted 7.The Stakeholders relationship committee of the company was re-consitituted 8.The Corporate Social Responsibility committee of the company was re-consitituted. (AS Per BSE Announcement Dated on 10.08.2020)"
            ],
            [
                "11-08-2020",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 11/08/2020 ,inter alia, to consider and approve Board Meeting to consider and approve the unaudited financial results for the quarter ended 30th June 2020"
            ],
            [
                "08-06-2020",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 08/06/2020 ,inter alia, to consider and approve the audited standalone & consolidated financial results for the quarter and year ending 31st March 2020; and recommend payment of equity dividend for the Financial Year 2019-20, if any. Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on June 08, 2020, inter alia, has recommended a Dividend of Rs. 4.00 per Equity Share of Rs. 1 each of the Company which shall be paid / dispatched on or after the seventh day from the conclusion of the 36th Annual General meeting subject to approval of the shareholders of the Company. (As Per BSE Announcement Dated on 6/8/2020 7:44:12 PM)"
            ],
            [
                "04-02-2020",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 04/02/2020 ,inter alia, to consider and approve the unaudited financial results for the third quarter and nine months ended 31st December 2019. Notice published in newspaper regarding the Board meeting of the Company. (As per BSE Announcement dated on 13/01/2020) Unaudited Financial Results (standalone and consolidated) for the third quarter and nine months ended 31st December 2019. (As Per BSE Announcement Dated 04.02.2020)"
            ],
            [
                "05-11-2019",
                "Quarterly Results"
            ],
            [
                "06-08-2019",
                "Quarterly Results"
            ],
            [
                "08-05-2019",
                "Dividend & Audited Results"
            ],
            [
                "01-02-2019",
                "Titan Company Limitedhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/02/2019 ,inter alia, to consider and approve Board Meeting to consider and approve the unaudited financial results for the third quarter / nine months ended 31st December 2018."
            ],
            [
                "09-11-2018",
                "Quarterly Results"
            ],
            [
                "03-08-2018",
                "Quarterly Results"
            ],
            [
                "10-05-2018",
                "Dividend & Audited Results"
            ],
            [
                "01-02-2018",
                "Quarterly Results"
            ],
            [
                "03-11-2017",
                "Board Meeting on 3rd November 2017"
            ],
            [
                "03-08-2017",
                "Board Meeting on Aug 03, 2017"
            ],
            [
                "12-05-2017",
                "Board meeting. & Audited Results & Dividend"
            ],
            [
                "07-02-2017",
                "Quarterly Results"
            ],
            [
                "04-11-2016",
                "Quarterly Results"
            ],
            [
                "06-05-2016",
                "Audited Results & Final Dividend"
            ],
            [
                "16-03-2016",
                "Interim Dividend"
            ],
            [
                "28-01-2016",
                "Quarterly Results"
            ],
            [
                "30-10-2015",
                "Quarterly Results"
            ],
            [
                "31-07-2015",
                "Quarterly Results"
            ],
            [
                "07-05-2015",
                "Dividend & Audited Results"
            ],
            [
                "27-01-2015",
                "Quarterly Results"
            ],
            [
                "30-10-2014",
                "Quarterly Results"
            ],
            [
                "06-05-2014",
                "Dividend & Audited Results"
            ],
            [
                "29-01-2014",
                "Quarterly Results"
            ],
            [
                "31-10-2013",
                "Quarterly Results"
            ],
            [
                "01-08-2013",
                "Quarterly Results"
            ],
            [
                "03-05-2013",
                "Audited Results & Dividend"
            ],
            [
                "30-01-2013",
                "Quarterly Results"
            ],
            [
                "31-10-2012",
                "Quarterly Results"
            ],
            [
                "31-07-2012",
                "Quarterly Results"
            ],
            [
                "30-04-2012",
                "Dividend & Audited Results"
            ],
            [
                "31-01-2012",
                "Quarterly Results"
            ],
            [
                "24-10-2011",
                "Quarterly Results"
            ],
            [
                "28-07-2011",
                "Quarterly Results"
            ],
            [
                "29-04-2011",
                "Audited Results & Dividend"
            ],
            [
                "28-01-2011",
                "Quarterly Results"
            ],
            [
                "25-10-2010",
                "Quarterly Results"
            ],
            [
                "27-07-2010",
                "Quarterly Results"
            ],
            [
                "30-04-2010",
                "Dividend & Audited Results"
            ],
            [
                "29-01-2010",
                "Quarterly Results"
            ],
            [
                "23-10-2009",
                "Quarterly Results"
            ],
            [
                "27-07-2009",
                "Quarterly Results"
            ],
            [
                "29-04-2009",
                "Dividend & Audited Results"
            ],
            [
                "30-01-2009",
                "Quarterly Results"
            ],
            [
                "23-12-2008",
                "Inter alia, to consider and approve possible issue of Secured, Redeemable, Non-Convertible Debentures on a Private Placement Basis aggregating to Rs 50 crores to Life Insurance Corporation of India.  The highlights and terms of the proposed Issue are as follows:  Amount : Rs 50 crores Face value : Rs 500 per debenture No of Debentures : 10,00,000 nos Rate of Interest : 12.75% p.a., payable annually Duration : 5 years Redemption : Bullet redemption at the end of 5 years from the date of allotment."
            ],
            [
                "20-10-2008",
                "Quarterly Results"
            ],
            [
                "31-07-2008",
                "Quarterly Results"
            ],
            [
                "21-01-2008",
                "the Board shall also modify the proposal in respect of the erstwhile communicated Scheme of Merger of Domestic Associate Companies as under:  At the Board Meeting of the Company held on January 25, 2007, the Board of Directors of the Company had approved the proposal for the merger of domestic associate Companies viz., Samrat Holdings Ltd, Questar Investments Ltd and Titan Holdings Ltd (transferor Companies) with Titan Industries Ltd (transferee Company) and exchange / swap ratio for exchange of shares held in the transferor Company based on the valuation of these Companies and the transferee Company as at March 31, 2007.  Subsequently, at the Board Meeting of the Company on July 27, 2007; the Board had approved the proposal of the buy-out of the minority interest in the abovesaid 3 transferor Companies, in lieu of issue of shares of Titan Industries Ltd, involving an out-lay of about Rs 17.50 crores.  At the forthcoming Board Meeting of the Company, a proposal for buy-out of the minority interest in the transferor Companies based on higher valuation of these Companies (based on further negotiations), shall be placed for approval by the Board. The proposal for the revised swap ratio for exchange of shares in the transferee Company, post buy-out, shall also be placed for approval by the Board."
            ],
            [
                "05-03-2008",
                "Quarterly Results"
            ],
            [
                "29-10-2007",
                "Quarterly Results"
            ],
            [
                "27-07-2007",
                "Quarterly Results & The Board shall also consider for approval the final scheme of merger / amalgamation of the three transferor Companies (all domesticassociate Companies of the Titan group i.e., Samrat Holdings Ltd, Titan Holdings Ltd and Questar Investments Ltd) and the transferee Company, the Company."
            ],
            [
                "21-04-2007",
                "Accounts & Dividend"
            ],
            [
                "25-01-2007",
                "Quarterly Results  &  inter alia, to consider, discuss and may approve restructuring plan for domestic associate Companies, including consideration of merger / amalgamation options."
            ],
            [
                "18-10-2006",
                "Half Yearly Results & Quarterly Results"
            ],
            [
                "17-07-2006",
                "Quarterly Results"
            ],
            [
                "05-06-2006",
                "Dividend & Accounts"
            ],
            [
                "23-01-2006",
                "Quarterly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "28-06-2024",
                "27-06-2024",
                "1100%",
                "The Board at its meeting held today, i.e. Friday, 3rd May 2024 transacted, inter alia, the following businesses: The Board has recommended a Dividend of 11.00 per Equity Share oft 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 40th Annual General Meeting, subject to the approval of the shareholders of the Company."
            ],
            [
                "13-07-2023",
                "13-07-2023",
                "1000%",
                "The Board has recommended a Dividend of Rs.10.00 per Equity Share of { 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 39th Annual General Meeting subject to the approval of the shareholders of the Company. Intimation regarding the change in date of the 39th Annual General Meeting (AGM) and revised intimation of Book Closure Date pursuant to Regulation 42 of the Securities and Exchange Board of lndia (Listing Obligations and Disclosure Requirements) Regulations, 2015. (As Per BSE Announcement dated on 29.05.2023)"
            ],
            [
                "12-07-2022",
                "08-07-2022",
                "750%",
                "Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 03, 2022, inter alia, has recommended a Dividend of Rs. 7.50 per Equity Share of Rs. 1 each of the Company which shall be paid/dispatched on or after the seventh day from the conclusion of the 38th Annual General Meeting subject to the approval of the shareholders of the Company. Pursuant to the Finance Act, 2020, with effect from April 01, 2020, Dividend Distribution Tax is abolished and dividend income is taxable in the hands of the shareholders. In view of the same, the dividend payments will be subject to deduction of tax at source, as may be applicable."
            ],
            [
                "24-07-2021",
                "22-07-2021",
                "400%",
                "Audited Financial Results, Audited Consolidated Financial Results for year ended 31st March 2021 Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on April 29, 2021, inter alia, has recommended a Dividend of Rs. 4 per Equity Share of Rs. 1 each of the Company, which shall be paid / dispatched on or after the seventh day from the conclusion of the 37th Annual General Meeting subject to approval of the shareholders of the Company.Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on April 29, 2021, inter alia, has recommended a Dividend of Rs. 4 per Equity Share of Rs. 1 each of the Company, which shall be paid / dispatched on or after the seventh day from the conclusion of the 37th Annual General Meeting subject to approval of the shareholders of the Company."
            ],
            [
                "05-08-2020",
                "03-08-2020",
                "400%",
                "Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on June 08, 2020, inter alia, has recommended a Dividend of Rs. 4.00 per Equity Share of Rs. 1 each of the Company which shall be paid / dispatched on or after the seventh day from the conclusion of the 36th Annual General meeting subject to approval of the shareholders of the Company."
            ],
            [
                "31-07-2019",
                "29-07-2019",
                "500%",
                "Titan Company Ltd has informed BSE that the Board of Directors of the Company at its meeting held on May 08, 2019, inter alia, have recommended a Dividend of Rs. 5.00 per Equity Share of Rs. 1 each of the Company which shall be paid / dispatched on the seventh day from the conclusion of the 35th Annual General meeting subject to approval of the shareholders of the Company."
            ],
            [
                "31-07-2019",
                "29-07-2019",
                "500%",
                "Rs.5.0000 per share(500%)Dividend"
            ],
            [
                "25-07-2018",
                "23-07-2018",
                "375%",
                "Rs.3.7500 per share(375%)Dividend"
            ],
            [
                "26-07-2017",
                "24-07-2017",
                "260%",
                "Rs.2.6000 per share(260%)Dividend"
            ],
            [
                "24-03-2016",
                "22-03-2016",
                "220%",
                "Interim Dividend"
            ],
            [
                "21-07-2015",
                "17-07-2015",
                "230%",
                "Rs.2.3000 per share(230%)Dividend"
            ],
            [
                "17-07-2014",
                "15-07-2014",
                "210%",
                "Rs.2.1000 per share(210%)Dividend"
            ],
            [
                "18-07-2013",
                "16-07-2013",
                "210%",
                "Rs.2.1000 per share(210%)Dividend"
            ],
            [
                "17-07-2012",
                "13-07-2012",
                "175%",
                "Rs.1.75 per share(175%)Dividend"
            ],
            [
                "26-07-2011",
                "22-07-2011",
                "125%",
                "Rs.25.00 per share(250%)Dividend"
            ],
            [
                "13-07-2010",
                "09-07-2010",
                "150%",
                "Rs.15.00 per share(150%)Dividend"
            ],
            [
                "14-07-2009",
                "10-07-2009",
                "100%",
                "A.G.M. & Rs.10.00 per share(100%)Dividend"
            ],
            [
                "16-07-2008",
                "15-07-2008",
                "80%",
                "80% Dividend & A.G.M."
            ],
            [
                "13-07-2007",
                "11-07-2007",
                "50%",
                "50% Dividend"
            ],
            [
                "08-08-2006",
                "04-08-2006",
                "30%",
                "A.G.M. & 30% Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "24-06-2011",
                "23-06-2011",
                "1:10"
            ]
        ]
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "24-06-2011",
                "23-06-2011",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "Titan Company has not announced any rights for the last few years."
    }
}