{
    "board_meetings": {
        "msg": "",
        "title": "Board Meeting",
        "header": [
            "Date",
            "Agenda"
        ],
        "data": [
            [
                "24-04-2025",
                "Quarterly Results"
            ],
            [
                "24-04-2025",
                "Tech Mahindra Ltdhas informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/04/2025 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015. Outcome of Board Meeting Appointment of Secretarial Auditor of the Company. (As Per Bse Announcement Dated on :24.04.2025)"
            ],
            [
                "17-01-2025",
                "Quarterly Results"
            ],
            [
                "17-01-2025",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/01/2025 inter alia to consider and approve Prior Intimation of Board Meeting - Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015 and Intimation for Trading Window Closure. TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 17/01/2025 ,inter alia, to consider and approve Prior Intimation of Board Meeting - Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 and Intimation for Trading Window Closure. Please find enclosed the Audited Standalone and Consolidated financial results for the quarter ended 31st December 2024. (As per BSE Announcement Dated on 17/01/2025)"
            ],
            [
                "19-10-2024",
                "Quarterly Results"
            ],
            [
                "19-10-2024",
                "Quarterly Results Outcome of Board Meeting dated 19th Oct 2024 (As Per BSE Announcement dated on 19.10.2024)"
            ],
            [
                "25-07-2024",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2024 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015. Audited standalone and consolidated financial results for the quarter ended 30 June 2024. (As Per BSE Announcement dated on 25.07.2024)"
            ],
            [
                "25-04-2024",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/04/2024 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015. Final Dividend & Audited Results (As per BSE Bulletin dated on 28/03/2024) Board approves Dividend. Financial Results for 31st March, 2024 Outcome of the Board Meeting. Appointment of Secretarial Auditor. Announcement under Regulation 30 (LODR)-Date of payment of Dividend. (As Per BSE Announcement Dated on 25/04/2024)"
            ],
            [
                "24-01-2024",
                "Quarterly Results"
            ],
            [
                "24-01-2024",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/01/2024 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015 & Intimation for Trading Window Closure. Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 & intimation for Trading Window Closure. (As Per BSE Announcement Dated on 28/12/2023)"
            ],
            [
                "25-10-2023",
                "Quarterly Results"
            ],
            [
                "25-10-2023",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/10/2023 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015 & Intimation for Trading Window Closure. Outcome of Board Meeting. Intimation under Regulation 30-Merger Appointment of Company Secretary. Date of payment of Dividend. Board approves Dividend. Update on Interim Dividend. Resignation of Company Secretary/Compliance Officer. (As Per BSE Announcement Dated on 25/10/2023)"
            ],
            [
                "01-01-1970",
                "Quarterly Results"
            ],
            [
                "26-07-2023",
                "Quarterly Results"
            ],
            [
                "26-07-2023",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 26/07/2023 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015 & Intimation for Trading Window Closure TECH MAHINDRA LIMITED has informed BSE about Board Meeting to be held on 26 Jul 2023 to consider financial statements for the period ended June 2023. Financial results. (As Per BSE Announcement Dated on 30.06.2023) Outcome of Board Meeting held on 26th July, 2023. (As Per BSE Announcement dated on 26.07.2023)"
            ],
            [
                "27-04-2023",
                "Quarterly Results"
            ],
            [
                "27-04-2023",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/04/2023 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015. Board Recommended Final dividend of Rs. 32/- per equity share of Rs. 5/- each i.e., 640% of the face value for the financial year ended 31% March, 2023, subject to the approval of members of the Company at the forthcoming Annual General Meeting. The Final Dividend, if approved, will be paid by 11T August, 2023. This dividend is in addition to Special Dividend of Rs. 18/- per share paid as interim dividend in November, 2022. (As Per BSE Bulletin Dated on 27.04.2023) Outcome of Board Meeting Results-Financial Result for year ended 31st March, 2023. Announcement under Regulation 30(LODR)-Dividend Updates. Corporate Action-Fixes Book Closure date for 22nd July to 27th July Date of payment of Dividend. (As per BSE Announcement Dated on 27/04/2023)"
            ],
            [
                "11-03-2023",
                "Change in Directorate - Intimation under Regulation 30 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('SEBI Listing Regulations')."
            ],
            [
                "30-01-2023",
                "Quarterly Results"
            ],
            [
                "30-01-2023",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2023 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015."
            ],
            [
                "01-11-2022",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2022 inter alia to consider and approve Prior Intimation of Board Meeting pursuant to Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015. TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/11/2022 ,inter alia, to consider and approve Update on board meeting (As Per BSE Announcement Dated 22.10.2022) Pursuant to Regulation 33 read with Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform that the Board of Directors of the Company at its meeting held today: 1. Approved the Audited financial results and consolidated financial results of the Company for the second quarter and half year ended 30th September, 2022, together with Auditors Report thereon. 2. Declared Special dividend of Rs. 18/- per equity share of Rs. 5/- each i.e. 360% of the face value. 3. Fixed 10th November, 2022 as the Record Date for determining the members entitled to receive the Special Interim dividend. The Special dividend shall be paid on Thursday, 24th November, 2022 to equity shareholders of the Company whose names appear on the Register of Members of the Company or in the records of Depositories as beneficial owners of the shares as on Thursday, 10th November, 2022. (As Per BSE Announcement Dated on 01.11.2022) In terms of Regulation 47 of SEBI Listing Regulations, please find enclosed copies of newspaper advertisement dated 2nd November, 2022 published in Business Standard & Economic Times (in English) and Maharashtra Times (in Marathi), regarding Extract of Consolidated Audited Interim Financial Results of the Company and its subsidiaries for the quarter and six months period ended 30th September, 2022. Further to our intimation dated 1st November, 2022 with regard to the Outcome of the Board Meeting, please note that the Board meeting held on 31st October, 2022 commenced at 2.30 p.m. IST and was adjourned at 4.00 p.m. IST to reconvene on 1st November, 2022. The adjourned Board Meeting to consider Financial Results & payment of Special Dividend reconvened at 2.30 p.m. IST on 1st November, 2022 and concluded at 3.15 p.m. IST. The details of the Board Meeting commencement and conclusion was already mentioned in the financials filed in XBRL mode. (As Per BSE Announcement Dated on 02/11/2022) In terms of Regulation 47 of SEBI Listing Regulations, please find enclosed copies of newspaper advertisement dated 3rd November, 2022 published in Financial Express (in English) and Navshakti (in Marathi), regarding fixation of record date for the special dividend declared by the Board of Directors at its meeting held on 1st November, 2022. The above information is also available on the website of the Company www.techmahindra.com. (As per BSE Announcement Dated on 03/11/2022) In terms of Regulation 30 and 46 read with clause 15 of Para A of Part A of Schedule III of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, please find enclosed the transcript of the earnings conference call for the quarter ended 30th September, 2022 conducted after the meeting of the Board of Directors held on 1st November, 2022, for your information and records. (As Per BSE Announcement Dated on 07.11.2022)"
            ],
            [
                "25-07-2022",
                "Quarterly Results"
            ],
            [
                "25-07-2022",
                "Quarterly Results TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/07/2022 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29(1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Monday, 25th July, 2022 and Tuesday, 26th July, 2022 to consider and approve, inter alia: 1. The audited financial results of the Company for the first quarter ended 30th June, 2022. 2. The audited consolidated financial results of the Company for the first quarter ended 30th June, 2022. The financial results shall be considered and declared on 25th July, 2022. As intimated on 29th June, 2022, in terms of the Code of Conduct for Prevention of Insider Trading in Securities of Tech Mahindra Limited, the Trading Window has been closed from 1st July, 2022 and will reopen 48 hours after the announcement of Financial Results by the Company. Outcome of Board Meeting held on 25th July, 2022 (As per BSE Announcement Dated on 25/07/2022)"
            ],
            [
                "13-05-2022",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 13/05/2022 inter alia to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations 2015 intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Friday 13th May 2022 to inter alia consider and approve: 1. The audited financial results of the Company for the fourth quarter and financial year ended 31st March 2022. 2. The audited consolidated financial results of the Company and its subsidiaries for the fourth quarter and financial year ended 31st March 2022. 3. Recommendation of dividend if any for the financial year ended 31st March 2022. We request you to take the same on record. The Board of Directors have recommended a Final dividend of Rs. 15/- per share and a special dividend of Rs 15/- per share on par value of Rs.5/- (600%) for the financial year ended 31st March, 2022, subject to approval from the members of the Company at the forthcoming Annual General Meeting. The Final dividend, if approved, will be paid by 9th August, 2022. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in November 2021. The total dividend for FY 2021-22 will be Rs. 45/- per share on par value of Rs.5/- (900%). Outcome of Board Meeting held on 13th May, 2022 Outcome of Board Meeting held on 13th May, 2022 1. Appointment of Ms. Penelope Fowler (DIN: 09591815) as Additional Director. 2. Re-appointment of Mr. C. P. Gurnani (DIN: 00018234) as Managing Director & CEO. The Board of Directors have recommended, the re-appointment of M/s B S R & Co. LLP, Chartered Accountants, [ICAI Firm Registration No. 101248W/W-100022] as the statutory auditors of the Company pursuant to Section 139 of the Companies Act, 2013 subject to the approval of shareholders of the Company. M/s BSR & Co. LLP, will hold office for another term of 5 consecutive years commencing from the conclusion of the ensuing Annual General Meeting up to the Annual General Meeting for the financial year 2026-27. (As Per BSE Announcement dated on 13.05.2022)"
            ],
            [
                "01-02-2022",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 01/02/2022 inter alia to consider and approve the unaudited Standalone and unaudited Consolidated financial results of the Company for the third quarter (Q3) and nine months ended 31st December 2021. As intimated on 30th December 2021 in terms of the Code of Conduct for Prevention of Insider Trading in Securities of Tech Mahindra Limited the Trading Window has been closed from 1st January 2022 and will reopen 48 hours after the announcement of Financial Results by the Company. This intimation is also being uploaded on the Companys website at https://www.techmahindra.com/ Outcome of Board Meeting held on 1st February, 2022 (As Per BSE Announcement dated on 01.02.2022)"
            ],
            [
                "25-10-2021",
                "Quarterly Results"
            ],
            [
                "25-10-2021",
                "Quarterly Results. TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 25/10/2021 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Saturday, 23rd October, 2021 & Monday, 25th October, 2021 to consider and approve, inter alia: 1. The audited financial results of the Company for the second quarter and half year ended 30th September, 2021. 2. The audited consolidated financial results of the Company for the second quarter and half year ended 30th September, 2021. The financial results shall be considered and declared on 25th October, 2021. We request you to take the same on record. In continuation of the earlier communication dated October 07, 2021 regarding conveying of Board Meeting on October 23 & 25, 2021, Tech Mahindra Ltd has now informed BSE that the Board of Directors will also consider a proposal for payment of interim dividend for the financial year 2021-22, at its meeting scheduled on October 23 & 25, 2021. The payment of Interim Dividend will be considered by the Board on October 25, 2021. As intimated earlier Trading Window of the Company is closed from October 01, 2021 and shall open 48 hours after the declaration of Financial Results for the quarter ended Sepember 30, 2021. (As Per BSE Announcement Dated on 20.10.2021) Declared Special dividend of Rs. 15/- per equity share of Rs. 5/- each i.e. 300% of the face value. (As Per BSE Announcement Dated on 10/25/2021 4:05:37 AM) Tech Mahindra Ltd has informed BSE that the Company has fixed November 05, 2021 as the Record Date for the purpose of Payment of Special Dividend. The Special Dividend shall be paid on November 22, 2021. (As per BSE Announcement Dated on 26/10/2021)"
            ],
            [
                "29-07-2021",
                "Quarterly Results"
            ],
            [
                "29-07-2021",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/07/2021 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday, 29th July, 2021 & Friday, 30th July, 2021 to consider and approve, inter alia: 1. The audited financial results of the Company for the first quarter ended 30th June, 2021. 2. The audited consolidated financial results of the Company for the first quarter ended 30th June, 2021. The financial results shall be considered and declared on 29th July, 2021. We request you to take the same on record. Board of Directors of the Company at its meeting held today approved the Audited financial results and consolidated financial results of the Company for the first quarter ended 30th June, 2021, together with Auditors Report thereon. Outcome of Board Meeting held on 29th July, 2021 (As Per BSE Announcement dated on 29.07.2021)"
            ],
            [
                "26-04-2021",
                "Quarterly Results"
            ],
            [
                "26-04-2021",
                "Tech Mahindra Ltd has informed BSE that a meeting of the Board of Directors of the Company is scheduled to be held on April 26, 2021 & April 27, 2021, to consider and approve, inter alia:1. The audited financial results of the Company for the fourth quarter and financial year ended March 31, 2021. 2. The audited consolidated financial results of the Company and its subsidiaries for the fourth quarter and financial year ended March 31, 2021. 3. Recommendation of dividend, if any, for the financial year ended March 31, 2021. The financial results shall be considered and declared on April 26, 2021. Outcome of Board Meeting held on 26th April, 2021 The Board of Directors have recommended a Final dividend of Rs.30/- per share (including Special Dividend of Rs.15/- per share) on par value of Rs.5/- (600%) for the financial year ended 31st March, 2021, subject to approval by the members of the Company at the forthcoming Annual General Meeting. The Special and Final dividend, if approved, will be paid by 11th August, 2021. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in & the total dividend for FY 2021 will be Rs.45/- per share on par value of Rs.5/- (900%). (As Per BSE Announcement Dated 26.04.2021)"
            ],
            [
                "29-01-2021",
                "Quarterly Results"
            ],
            [
                "29-01-2021",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/01/2021 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Saturday, 30th January, 2021 to consider and approve, inter alia: 1. The audited financial results of the Company for the third quarter ended 31st December, 2020 and 2. The audited consolidated financial results of the Company for the third quarter ended 31st December, 2020. We request you to take the same on record. Quarterly Results (Revised) TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 29/01/2021 ,inter alia, to consider and approve In continuation of our earlier intimation dated 4th January, 2021, intimating date of Board Meeting as on 30th January, 2021, for the purpose of considering audited financial results for quarter ended 31st December, 2020, it is hereby informed that the said Board Meeting has now been rescheduled on 29th & 30th January, 2021. The financial results shall be considered and declared on 29th January, 2021. (As per BSE Announcement Dated on 19/01/2021) In terms of Regulation 47 of SEBI Listing Regulations, please find enclosed copies of newspaper advertisement published today, i.e. 20th January, 2021 in Business Standard (in English) and Navshakti (in Marathi), informing about rescheduling of Board Meeting on 29th & 30th January, 2021, which was originally scheduled on 30th January, 2021. The financial results shall be considered and declared on 29th January, 2021. (As per BSE Announcement Dated on 20/01/2021) Outcome of Board Meeting held on 29th January, 2021 (As Per BSE Announcement Dated on 29/01/2021)"
            ],
            [
                "12-11-2020",
                "Pursuant to the provisions of the Listing Regulations, we wish to inform the Stock Exchange of the resolution passed by the Securities Allotment Committee of the Board of Directors of the Company on 12th November, 2020 for issue and allotment of a total of 57,430 equity shares of Rs. 5/- each of the Company to the applicants."
            ],
            [
                "24-10-2020",
                "In continuation of the earlier communication dated September 29, 2020 regarding conveying of Board Meeting on October 23 & 24, 2020, Tech Mahindra Ltd has now informed BSE that the Board of Directors will consider a proposal for interim dividend for the financial year 2020-2021, at its meeting scheduled on October 23 & 24, 2020.As intimated earlier Trading Window of the Company is closed from October 01, 2020 and shall open 48 hours after the declaration of Financial Results for the quarter ended September 30, 2020."
            ],
            [
                "23-10-2020",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2020 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Friday, 23rd October, 2020 & Saturday, 24th October, 2020 to consider and approve, inter alia: 1. The audited financial results of the Company for the second quarter and half year ending 30th September, 2020 and 2. The audited consolidated financial results of the Company for the second quarter and half year ending 30th September, 2020. The financial results shall be considered and declared on 23rd October, 2020. TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 23/10/2020 ,inter alia, to consider and approve Prior Intimation to consider the proposal for interim dividend for the financial year 2020 - 2021. (As per BSE Announcement Dated on 19/10/2020) Declared Special dividend of Rs. 15/- per equity share of Rs. 5/- each i.e. 300% of the face value. Outcome of Board Meeting held on October 23, 2020 (As Per BSE Announcement Dated on 23.10.2020)"
            ],
            [
                "27-07-2020",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 27/07/2020 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Monday, 27th July, 2020 & Tuesday, 28th July, 2020 to consider and approve, inter alia: 1. The audited financial results of the Company for the first quarter ended 30th June, 2020. 2. The audited consolidated financial results of the Company for the first quarter ended 30th June, 2020. The financial results shall be considered and declared on 27th July, 2020."
            ],
            [
                "30-04-2020",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/04/2020 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015 ('LODR'), intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Thursday, 30th April, 2020 to consider and approve, inter alia: 1. The audited financial results of the Company for the fourth quarter and financial year ended 31st March, 2020. 2. The audited consolidated financial results of the Company and its subsidiaries for the fourth quarter and financial year ended 31st March, 2020. 3. Recommendation of dividend, if any, for the financial year ended 31st March, 2020. The Board of Directors have recommended a final dividend of Rs. 5/- per share on par value of Rs.5/- (100%) for the financial year ended March 31, 2020, subject to approval by the members of the Company at the forthcoming Annual General Meeting. Outcome of Board Meeting held on April 30, 2020 (As Per BSE Announcement Dated on 30.04.2020)"
            ],
            [
                "24-02-2020",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 24/02/2020 ,inter alia, to consider and approve Prior Intimation of Board Meeting to consider the proposal of interim dividend for the financial year 2019 - 2020 Outcome of Board Meeting held on 24th February, 2020. (As Per BSE Announcement Dated on 24.02.2020)"
            ],
            [
                "31-01-2020",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 31/01/2020 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 (1) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, intimation is hereby given that a meeting of Board of Directors of the Company is scheduled to be held on Friday, 31st January, 2020 to consider and approve, inter alia: 1. The audited financial results of the Company for the third quarter ended 31st December, 2019 and 2. The audited consolidated financial results of the Company for the third quarter ended 31st December, 2019. Outcome of Board Meeting held on January 31, 2020 Outcome of Board Meeting held on January 31, 2020 (As Per BSE Announcement Dated 31.01.2020)"
            ],
            [
                "05-11-2019",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/11/2019 ,inter alia, to consider and approve 1. The audited financial results of the Company for the second quarter and half year ended 30th September, 2019 and 2. The audited consolidated financial results of the Company for the second quarter and half year ended 30th September, 2019. TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/11/2019 ,inter alia, to consider and approve 1. The audited financial results of the Company for the second quarter and half year ended 30th September, 2019 and 2. The audited consolidated financial results of the Company for the second quarter and half year ended 30th September, 2019. (As Per BSE Announcement Dated on 09.10.2019) Outcome of Board Meeting held on November 5, 2019 (As Per BSE Announcement Dated on 05.11.2019)"
            ],
            [
                "30-07-2019",
                "Quarterly Results A meeting of the Board of Directors of the Company is scheduled to be held on Tuesday, 30th July, 2019 & Wednesday, 31st July, 2019 to consider and approve, inter alia: 1. The audited financial results of the Company for the first quarter ended 30th June, 2019. 2. The audited consolidated financial results of the Company for the first quarter ended 30th June, 2019. The financial results shall be considered and declared on 30th July, 2019."
            ],
            [
                "21-05-2019",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 21/05/2019 ,inter alia, to consider and approve Recommendation of dividend, if any, for the financial year ended 31st March, 2019."
            ],
            [
                "21-02-2019",
                "Buy Back of Shares inter-alia consider a proposal to buy-back the fully paid-up equity shares of the Company."
            ],
            [
                "05-02-2019",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 05/02/2019 ,inter alia, to consider and approve A meeting of the Board of Directors of the Company is scheduled to be held on Tuesday, February 5, 2019 to consider and approve, inter alia: 1. The audited financial results of the Company for the quarter ended 31st December, 2018 and 2. The audited consolidated financial results of the Company for the quarter ended 31st December, 2018."
            ],
            [
                "30-10-2018",
                "TECH MAHINDRA LTD.has informed BSE that the meeting of the Board of Directors of the Company is scheduled on 30/10/2018 ,inter alia, to consider and approve Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, (LODR), intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Tuesday, the 30th October, 2018 to consider and approve, inter alia: 1. The audited financial results of the Company for the quarter ended 30th September, 2018 and 2. The audited consolidated financial results of the Company for the quarter ended 30th September, 2018."
            ],
            [
                "31-07-2018",
                "Quarterly Results"
            ],
            [
                "30-07-2018",
                "Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, (LODR), intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Monday, the 30th July, 2018 & Tuesday, the 31st July, 2018 to consider and approve, inter alia: 1. The audited financial results of the Company for the quarter ended 30th June, 2018 and 2. The audited consolidated financial results of the Company for the quarter ended 30th June, 2018. The financial results shall be considered and declared on 30th July, 2018."
            ],
            [
                "25-05-2018",
                "Prior Intimation of Board Meeting pursuant to Regulation 29 (1) (a) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015"
            ],
            [
                "29-01-2018",
                "January 8, 2018 To, The Manager, Listing Department Bombay Stock Exchange Limited Phiroze Jeejeebhoy Towers, Dalal Street, MUMBAI - 400 001. Scrip Code : 532755 To, The Manager, Listing Department National Stock Exchange of India Ltd. Exchange Plaza, 5th floor, Plot No. - C/1, G Block, Bandra-Kurla Complex, Bandra (E) Mumbai - 400051. NSE Symbol : TECHM Sub: Prior Intimation of Board Meeting pursuant to Regulation 29 (1) (a) of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015. Dear Sir, Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, (LODR), intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Monday, 29th January, 2018 to consider and approve, inter alia: 1. the audited financial results of the Company for the third quarter ended 31st December, 2017; and 2. the audited consolidated financial results of the Company for the third quarter ended 31st December, 2017. We request you to take the same on record. Thanking you, For Tech Mahindra Limited Anil Khatri Company Secretary"
            ],
            [
                "01-11-2017",
                "Quarterly Results Pursuant to the provisions of Regulation 29 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, (LODR), intimation is hereby given that a meeting of the Board of Directors of the Company is scheduled to be held on Tuesday, 31st October, 2017 and Wednesday, 1st November, 2017 to consider and approve, inter alia: 1. the audited financial results of the Company for the second quarter and half year ended 30th September, 2017; and 2. the audited consolidated financial results of the Company for the second quarter and half year ended 30th September, 2017. The financial results shall be considered and declared on 1st November, 2017."
            ],
            [
                "31-10-2017",
                "Quarterly Results"
            ],
            [
                "01-08-2017",
                "Quarterly Results"
            ],
            [
                "26-05-2017",
                "Audited Results & Dividend"
            ],
            [
                "30-01-2017",
                "Quarterly Results"
            ],
            [
                "27-10-2016",
                "Quarterly Results"
            ],
            [
                "01-08-2016",
                "Audited Results"
            ],
            [
                "24-05-2016",
                "Special Dividend"
            ],
            [
                "01-02-2016",
                "Quarterly Results"
            ],
            [
                "03-11-2015",
                "Quarterly Results"
            ],
            [
                "27-07-2015",
                "Quarterly Results"
            ],
            [
                "26-05-2015",
                "Dividend & Audited Results"
            ],
            [
                "30-01-2015",
                "Quarterly Results"
            ],
            [
                "29-10-2014",
                "Quarterly Results"
            ],
            [
                "31-07-2014",
                "Quarterly Results"
            ],
            [
                "14-05-2014",
                "Dividend & Audited Results A meeting of the Board of Directors of the Company will be held on May 13 & 14, 2014, inter alia, to consider and approve : 1. The audited financial results of the Company for the fourth quarter and financial year ended March 31, 2014. 2. The audited consolidated financial results of the Company and its subsidiaries for the fourth quarter and financial year ended March 31, 2014. 3. Recommendation of dividend, if any, for the financial year ended March 31, 2014."
            ],
            [
                "04-02-2014",
                "Quarterly Results"
            ],
            [
                "29-11-2013",
                "Tech Mahindra Ltd has informed BSE that a meeting of the Board of Directors of the Company will be held on November 29, 2013, inter alia, to consider a Scheme of Amalgamation of Mahindra Engineering Services Limited with the Company pursuant to provisions of Sections 391 to 394 of the Companies Act, 1956."
            ],
            [
                "07-11-2013",
                "Quarterly Results"
            ],
            [
                "12-08-2013",
                "Quarterly Results"
            ],
            [
                "21-05-2013",
                "Dividend & Audited Results"
            ],
            [
                "06-02-2013",
                "Quarterly Results"
            ],
            [
                "05-11-2012",
                "Quarterly Results"
            ],
            [
                "09-08-2012",
                "Quarterly Results"
            ],
            [
                "01-01-1970",
                "532755 Tech Mahindra Limited 23/05/2012 Employees Stock Option Plan"
            ],
            [
                "23-05-2012",
                "Dividend & Audited Results"
            ],
            [
                "21-03-2012",
                "inter alia, to consider the Amalgamation of Satyam Computer Services Limited (Mahindra Satyam) with the Company, along with the amalgamation of Venturbay Consultants Private Limited, C&S System Technologies Private Limited, CanvasM Technologies Limited and Mahindra Logisoft Business Solutions Limited (being wholly owned subsidiaries of the Company or Satyam Computer Services Limited (Mahindra Satyam) with the Company, with a view to consolidate the information technology / software and related businesses and to form a single entity providing services in this sector."
            ],
            [
                "08-02-2012",
                "Quarterly Results"
            ],
            [
                "15-11-2011",
                "Quarterly Results inter alia, to:  1. Consider the audited financial results of the Company for the second quarter and half year ended September 30, 2011.  2. Take on record audited consolidated financial results of the Company and its subsidiaries for the second quarter and half year ended September 30, 2011."
            ],
            [
                "12-08-2011",
                "Quarterly Results"
            ],
            [
                "26-05-2011",
                "Final Dividend & Audited Results"
            ],
            [
                "21-01-2011",
                "Quarterly Results"
            ],
            [
                "26-10-2010",
                "Quarterly Results"
            ],
            [
                "26-07-2010",
                "Quarterly Results Interalia to consider:  1. The audited financial results of the Company for the first quarter ended June 30, 2010 (Q1).  2. The audited consolidated financial results of the Company and its subsidiaries for the first quarter ended June 30, 2010 (excluding Satyam Computer Services Ltd. and its subsidiaries)."
            ],
            [
                "30-04-2010",
                "Final Dividend & Audited Results"
            ],
            [
                "22-01-2010",
                "Quarterly Results"
            ],
            [
                "20-10-2009",
                "Quarterly Results"
            ],
            [
                "22-07-2009",
                "Quarterly Results"
            ],
            [
                "27-04-2009",
                "Audited Results"
            ],
            [
                "23-01-2009",
                "Quarterly Results"
            ],
            [
                "21-10-2008",
                "Interim Dividend"
            ],
            [
                "21-07-2008",
                "Quarterly Results"
            ],
            [
                "19-05-2008",
                "Final Dividend & Audited Results"
            ],
            [
                "22-01-2008",
                "Quarterly Results"
            ],
            [
                "19-10-2007",
                "Quarterly Results"
            ],
            [
                "19-07-2007",
                "Quarterly Results"
            ],
            [
                "07-05-2007",
                "Audited Results"
            ],
            [
                "14-03-2007",
                "Interim Dividend"
            ],
            [
                "18-01-2007",
                "Quarterly Results"
            ],
            [
                "18-10-2006",
                "Quarterly Results & Half Yearly Results"
            ]
        ]
    },
    "dividends": {
        "msg": "",
        "title": "Dividend",
        "header": [
            "Record Date",
            "Ex-Date",
            "Dividend Percentage",
            "Details"
        ],
        "data": [
            [
                "01-11-2024",
                "31-10-2024",
                "300%",
                "Outcome of Board Meeting dated 19th Oct 2024 Dividend approved by the Board at its meeting Declared Interim dividend of Rs. 15/- per equity shares of Rs. 5/- each i.e. 300% of the face Record date for the interim dividend is 1st November 2024"
            ],
            [
                "20-07-2024",
                "19-07-2024",
                "560%",
                "Board approves Dividend Recommended Final Dividend of Rs. 28/- per equity share of the face value of Rs. 5/- each (560%) for the financial year ended 31st March, 2024, subject to the Members' approval at the forthcoming Annual General Meeting (\"AGM\") of the Company The Register of Members and Share Transfer Books will remain close from Saturday, 20th July, 2024 to Friday, 26th July, 2024 (both days inclusive) for the purpose of the AGM and reckoning entitlement to the Final Dividend recommended."
            ],
            [
                "02-11-2023",
                "02-11-2023",
                "240%",
                "Board approves Dividend."
            ],
            [
                "22-07-2023",
                "21-07-2023",
                "640%",
                "Board Recommended Final dividend of Rs. 32/- per equity share of Rs. 5/- each i.e., 640% of the face value for the financial year ended 31% March, 2023, subject to the approval of members of the Company at the forthcoming Annual General Meeting. The Final Dividend, if approved, will be paid by 11T August, 2023. This dividend is in addition to Special Dividend of Rs. 18/- per share paid as interim dividend in November, 2022."
            ],
            [
                "10-11-2022",
                "09-11-2022",
                "360%",
                "Pursuant to Regulation 33 read with Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform that the Board of Directors of the Company at its meeting held today: Declared Special dividend of Rs. 18/- per equity share of Rs. 5/- each i.e. 360% of the face value. Fixed 10th November, 2022 as the Record Date for determining the members entitled to receive the Special Interim dividend. The Special dividend shall be paid on Thursday, 24th November, 2022 to equity shareholders of the Company whose names appear on the Register of Members of the Company or in the records of Depositories as beneficial owners of the shares as on Thursday, 10th November, 2022."
            ],
            [
                "23-07-2022",
                "21-07-2022",
                "300%",
                "The Board of Directors have recommended a Final dividend of Rs. 15/- per share and a special dividend of Rs 15/- per share on par value of Rs.5/- (600%) for the financial year ended 31st March, 2022, subject to approval from the members of the Company at the forthcoming Annual General Meeting. The Final dividend, if approved, will be paid by 9th August, 2022. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in November 2021. The total dividend for FY 2021-22 will be Rs. 45/- per share on par value of Rs.5/- (900%)."
            ],
            [
                "23-07-2022",
                "21-07-2022",
                "300%",
                "The Board of Directors have recommended a Final dividend of Rs. 15/- per share and a special dividend of Rs 15/- per share on par value of Rs.5/- (600%) for the financial year ended 31st March, 2022, subject to approval from the members of the Company at the forthcoming Annual General Meeting. The Final dividend, if approved, will be paid by 9th August, 2022. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in November 2021. The total dividend for FY 2021-22 will be Rs. 45/- per share on par value of Rs.5/- (900%)."
            ],
            [
                "05-11-2021",
                "02-11-2021",
                "300%",
                "Declared Special dividend of Rs. 15/- per equity share of Rs. 5/- each i.e. 300% of the face value."
            ],
            [
                "27-07-2021",
                "23-07-2021",
                "300%",
                "The Board of Directors have recommended a Final dividend of Rs.30/- per share (including Special Dividend of Rs.15/- per share) on par value of Rs.5/- (600%) for the financial year ended 31st March, 2021, subject to approval by the members of the Company at the forthcoming Annual General Meeting. The Special and Final dividend, if approved, will be paid by 11th August, 2021. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in & the total dividend for FY 2021 will be Rs.45/- per share on par value of Rs.5/- (900%)."
            ],
            [
                "27-07-2021",
                "23-07-2021",
                "300%",
                "The Board of Directors have recommended a Final dividend of Rs.30/- per share (including Special Dividend of Rs.15/- per share) on par value of Rs.5/- (600%) for the financial year ended 31st March, 2021, subject to approval by the members of the Company at the forthcoming Annual General Meeting. The Special and Final dividend, if approved, will be paid by 11th August, 2021. This dividend is in addition to Special Dividend of Rs.15/- per share paid as interim dividend in & the total dividend for FY 2021 will be Rs.45/- per share on par value of Rs.5/- (900%)."
            ],
            [
                "02-11-2020",
                "29-10-2020",
                "300%",
                "Declared Special dividend of Rs. 15/- per equity share of Rs. 5/- each i.e. 300% of the face value."
            ],
            [
                "25-07-2020",
                "23-07-2020",
                "100%",
                "The Board of Directors have recommended a final dividend of Rs. 5/- per share on par value of Rs.5/- (100%) for the financial year ended March 31, 2020, subject to approval by the members of the Company at the forthcoming Annual General Meeting."
            ],
            [
                "03-03-2020",
                "02-03-2020",
                "200%",
                "Outcome of Board Meeting held on 24th February, 2020."
            ],
            [
                "27-07-2019",
                "25-07-2019",
                "280%",
                "The Board of Directors have recommended a dividend of Rs. 14/- per share on par value of Rs.5/- (280%) for the financial year ended March 31, 2019, subject to approval by the members of the Company at the forthcoming Annual General Meeting."
            ],
            [
                "27-07-2019",
                "25-07-2019",
                "280%",
                "Rs.14.0000 per share(280%)Dividend"
            ],
            [
                "28-07-2018",
                "26-07-2018",
                "280%",
                "Rs.14.0000 per share(280%)Dividend"
            ],
            [
                "29-07-2017",
                "27-07-2017",
                "180%",
                "Rs.9.0000 per share(180%)Dividend"
            ],
            [
                "30-07-2016",
                "28-07-2016",
                "120%",
                ""
            ],
            [
                "30-07-2016",
                "28-07-2016",
                "120%",
                "Rs.6.0000 per share(120%)Special Dividend"
            ],
            [
                "25-07-2015",
                "23-07-2015",
                "120%",
                "Rs.6.0000 per share(120%)Dividend"
            ],
            [
                "29-07-2014",
                "25-07-2014",
                "200%",
                "Rs.20.0000 per share(200%)Dividend"
            ],
            [
                "23-09-2013",
                "19-09-2013",
                "50%",
                "Rs.5.0000 per share(50%)Dividend & A.G.M."
            ],
            [
                "06-08-2012",
                "02-08-2012",
                "40%",
                "Rs.4.00 per share(40%)Final Dividend"
            ],
            [
                "08-08-2011",
                "04-08-2011",
                "40%",
                "Rs.4.00 per share(40%)Final Dividend"
            ],
            [
                "23-07-2010",
                "21-07-2010",
                "35%",
                "Rs.3.50 per share(35%)Dividend & A.G.M."
            ],
            [
                "29-10-2008",
                "27-10-2008",
                "40%",
                "Interim Dividend"
            ],
            [
                "19-07-2008",
                "17-07-2008",
                "55%",
                "55% Dividend & A.G.M."
            ],
            [
                "22-03-2007",
                "21-03-2007",
                "15%",
                "15% Interim Dividend"
            ]
        ]
    },
    "splits": {
        "msg": "",
        "title": "Split",
        "header": [
            "Record Date",
            "Date",
            "Ratio"
        ],
        "data": [
            [
                "20-03-2015",
                "19-03-2015",
                "5:10"
            ]
        ]
    },
    "bonus": {
        "msg": "",
        "title": "Bonus",
        "header": [
            "Record Date",
            "Ex-Date",
            "Ratio"
        ],
        "data": [
            [
                "20-03-2015",
                "19-03-2015",
                "1:1"
            ]
        ]
    },
    "rights": {
        "title": "Rights",
        "msg": "Tech Mahindra has not announced any rights for the last few years."
    }
}